[
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1712480379397,
        "ReviewContent": "I would like to express my sincere appreciation and HUGE thanks to all the staff at  The Land  retreat in Philo, CA. My friend and I spent 4 nights there, and we found the entire experience totally AMAZING. The staff were kind, friendly and respectful, they provided us with a safe space to feel comfortable, be ourselves, and completely restore our energy. The grounds are very well maintained,  breathtakingly beautiful, with meadows, woodland, and the Navarro River nearby. The Soul Stretch, and Yoga classes were revitalizing, and without exaggeration, the food for every single meal was absolutely delicious, they were very well thought out, and catered for everyone s needs. With out any doubt, I would recommend staying at the center to any member of my family and friends, and I personally would like to visit again soon. Many Thanks.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"4058757810955507d0a6e1fb758b1fc8\", \"OwnerResponseText\": \"We enjoyed having you both. Thank you so much for the kind reflections here. Were happy to have you back any time.\", \"OwnerResponseDate\": \"2024-04-07 08:59:39.397547\", \"ReviewLikes\": 1, \"TotalReviews\": 8.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1709801979400,
        "ReviewContent": "Ahhhh! This place is heaven on earth. I went to Winter retreat in December and it changed my life. The Land is nestled in the woods and offers a secluded sanctuary for those seeking respite from the chaos of daily life. The retreat exudes an aura of tranquility from the moment you arrive. I stayed in one of the cozy cabins and was greeted by deer almost every morning. I had some of the deepest sleeps in a long time. The Land offers a diverse range of activities which include yoga, Tibetan Buddhist meditation, nature walks in the RedWoods, and mindfulness workshops. Every meal is made with love and the highest quality ingredients. The staff are attentive, welcoming, and dedicated to ensuring everyone has a memorable experience. Overall, this is the best retreat place I have ever been to. If you are looking for a sanctuary for inner peace and rejuvenation look no further than The Land in Northern California. Highly recommend for anyone in need of a retreat from the hustle and bustle of modern life.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"0c99ed05ef68249010ce1c95ebe9f2d4\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 2, \"TotalReviews\": 15.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1707296379402,
        "ReviewContent": "My husband and I went for a couple of nights and stayed in a cabin. Its really beautiful with nearby trails for wandering in nature. The community that works there was very welcoming and the shared meals were healthy & delicious. Its just outside of the tiny town of Philo where theres a winery, small grocery store and Mexican restaurant, but youre likely to stay on site at the retreat center most of the time. Theres a massive garden and a pool (which we didnt use since its more of a cold plunge in the winter months). Depending on the day and week you ll also find activities on site like meditation and yoga.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"3dfc9058a93d169622883f60c12d6949\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 0, \"TotalReviews\": 1.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1701939579404,
        "ReviewContent": "Reflecting on an unforgettable experience at The Land! This retreat isnt just a place; its a journey to tranquility. Walking through the spacious grounds feels like stepping into a sanctuary designed by nature itself. Safe and beautifully kept, its a heaven for anyone looking to escape the hustle and bustle. Meal times were a culinary delight, with each dinner transporting me to a different corner of the world.   The chefs there are magicians of taste! The staff at The Land deserve a special shout-out. They balance professionalism with personal care seamlessly, ensuring everything I needed was just a request away. Their friendly presence added warmth to my entire stay. And for someone who treasures quiet personal time, the choose your participation approach to events like yoga and gardening was perfect. The discussions led by various experts on spirituality and business sparked new insights without any pressure to engage more than I wanted to. To anyone longing for a pause button on lifes fast-forward, The Land is a retreat that offers just that - plus a chance to meet wonderful new people and rediscover oneself.   Cant recommend it enough!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"b01b2b3e2d04488851e1d7ed7b128143\", \"OwnerResponseText\": \"It was great having you Richard! We hope to see you again soon. Well give your comments to the kitchen staff :-)\", \"OwnerResponseDate\": \"2023-12-07 08:59:39.404206\", \"ReviewLikes\": 1, \"TotalReviews\": 1.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1696669179406,
        "ReviewContent": "May I share, I feel like my stay at  The Land  invigorated my body as I felt so much joy and peace and happiness and connection! The food felt like nourishment for my soul as every bite seemed to have so much flavor dusted with love! I was truly intrigued and binspired by the activities, class options and being able to learn about Tibetan Buddhism from a master Chongwol-la who studied with Lama Glenn and the Dalai Lama which has given me a new reverence and perspective of life and death and our purpose fir being here now! The meditation practices enlivened my body with renewed vigor turned on to life again! I was grateful to attend the  Women over Dinner  event with incredible women connecting in conversation over fabulous food!! Overall, my stay at  The Land  was exactly what I needed to reconnect with myself and others and the earth. I ve been there a couple times for retreats and always had a great experience and plan to go again soon!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"111ad00b24f4ddcee0dcdd614bfdf833\", \"OwnerResponseText\": \"Thanks Maryann! See you soon!\", \"OwnerResponseDate\": \"2023-12-07 08:59:39.406541\", \"ReviewLikes\": 1, \"TotalReviews\": 5.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1696669179408,
        "ReviewContent": "The land is a place that you can call home with a complete experience. A beautiful scenery of green and water on your way to it and once you enter the property , you will be welcomed by your new friends and soon family. Warmth, laughters, knowledge, and so much organic and fresh food. I stay at the tent every time I visit. I feel I am sleeping in nature. Quiet nights and tweets and sunny days. The exercises, workshops, conversations will introduce you to a new version of yourself that is stable, balanced, and purposeful. This is a retreat that will help with self growth, seeing the reality as is, solidarity, support, and for every free woman who is looking for other women like her.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"2934cdab7c9869bde083b70be359b798\", \"OwnerResponseText\": \"Come back soon, Samah!\", \"OwnerResponseDate\": \"2023-12-07 08:59:39.408476\", \"ReviewLikes\": 1, \"TotalReviews\": 3.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1691398779410,
        "ReviewContent": "Awesome place for a work retreat. Very relaxing, nature oriented, fantastic food and overall rejuvenating.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"25779188d180a0cb051624df754e64f8\", \"OwnerResponseText\": \"Hey Chris! Thanks for coming and for putting in a good word. We enjoyed having your group. See you soon.\", \"OwnerResponseDate\": \"2023-08-07 08:59:39.410379\", \"ReviewLikes\": 1, \"TotalReviews\": 9.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1688720379412,
        "ReviewContent": "I had the pleasure of staying at The Land for a long weekend, and I must say it was an extraordinary experience. From the moment I arrived, I was enveloped in a serene and captivating atmosphere. The propertys natural beauty, with its lush landscapes and breathtaking views, provided the perfect backdrop for a great weekend.  Overall, my weekend at The Land was a truly transformative experience, and I left feeling nourished, inspired, and deeply connected.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"433a1bcc6928fcca63093ef45901ea96\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 1, \"TotalReviews\": 13.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1686128379414,
        "ReviewContent": "I travel a lot up & down the coast. Whenever I can, I stop at The Land to rest in the beautiful deep sanctuary they ve created. I always leave feeling rejuvenated and deeply appreciative this place exists.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"f5626a8fb9cad1836524d8958b16c312\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 1, \"TotalReviews\": 5.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1686128379415,
        "ReviewContent": "I arrived for a week long retreat at The Land not quite sure what to expect.  I was amazed at the beauty of the land, the facilities and the warm receptive container of connection that greeted me! I stayed in one of the very comfortable and well appointed glamping tents in a cozy grove of trees and partook of the scrumptious meals in the community lodge just a short walk away. There are multiple opportunities for hiking if you are so inclined but the best part were the classes, yoga and meditation offerings to be had in each day. I spent time in the gardens - 2 acres of flowers, orchards and veggies with places to sit and enjoy the quiet in contemplation, or get your hands dirty in the soil. All in all a splendid week that wasn t nearly long enough and I already have plans to return! Cherry",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"8c9dad3d75eacf510b9c48d4a3b6e675\", \"OwnerResponseText\": \"Thanks Cherry! We loved having you. See you soon\", \"OwnerResponseDate\": \"2023-06-07 08:59:39.415468\", \"ReviewLikes\": 1, \"TotalReviews\": 4.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1686128379951,
        "ReviewContent": "I spent a glorious week on The Land this spring. It was so magical, from the wildlife to nature, to home-cooked meals and the activities offered, such as yoga, meditation, and sutra studies. I never wanted to leave! I was trained in OM in 2020 but have been out of practice. When I arrived, it was explained that I could choose to OM or not. I have loved my experiences with the practice so far, and I wanted to explore it. It was great. I felt safe, comfortable, well-held, and cared for every step of the way!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"f56c2501b3b8c2532afda008a1749cdd\", \"OwnerResponseText\": \"Thanks Carli Jo! These photos are incredible.\", \"OwnerResponseDate\": \"2023-06-07 08:59:39.951715\", \"ReviewLikes\": 1, \"TotalReviews\": 4.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1686128379954,
        "ReviewContent": "I have had the privilege of many long stays at The Land over many different seasons. From swimming in the cool clear Navarro River in summer, to cozying up by the fire during the torrential rains of winter, to harvest time and planting time- The Land offers full spectrum beauty. I could feel the care in every corner- if you search closely there are little altars tucked away that remind you to pause and appreciate nature and the moment. The accommodations are simple and clean. Matthew the chefs food often left me speechless. Which I guess is ideal when your mouth is full of his food! I could go on and on- its literal heaven on Earth and I cannot wait to go back.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"59eec985931bb5e59b207e48106a494b\", \"OwnerResponseText\": \"Thank you Alison! We love you so much. Come back soon and bring Ira!\", \"OwnerResponseDate\": \"2023-06-07 08:59:39.954023\", \"ReviewLikes\": 1, \"TotalReviews\": 1.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1686128379956,
        "ReviewContent": "The Land is the antidote to every crazy thing going on in the world. It s a throwback to everything that is meaningful in life that we ve sacrificed at the altar of productivity and commerce. I had moments of sublime happiness at the Land that I haven t experienced anywhere else. I don t know if it s the immersion in nature, the sense of community or the deep teaching that is part of what happens on the Land, but it is a transformational experience that begins literally as soon as you cross the bridge onto the property. Until you are there - it s hard to quite grasp the magic that wraps itself around you and adjusts the frequency of your nervous system to a place you once knew but barely remember. It s the incredible, organic nourishing food and what it does to your body. It s seeing a sky full of stars at night and thinking  is this here ALL the time? How have I NOT seen it? It s the natural beauty and feeling like a steward of nature. It s being around animals. It s the programs and the practices. It s the people you meet on the Land.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"06d886e5dc34676a8d0da8af7af4ea9b\", \"OwnerResponseText\": \"Thank you so much Beth this was beautiful to read.\", \"OwnerResponseDate\": \"2023-06-07 08:59:39.956293\", \"ReviewLikes\": 1, \"TotalReviews\": 12.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1686128379958,
        "ReviewContent": "I spent a week at the Eros Monastery and it was exactly what I needed. I was welcomed with open arms even though I  chose not to participate in the OM practice. There was no pressure to participate and everyone was willing to answer all my questions. Also, I have spoken with my wife about going with me next time. It felt like home and I will definitely be back at least one a year!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"acd0a5f71e668451118cf9b8a78fb72d\", \"OwnerResponseText\": \"Hey Lenny! Great having you and thanks for the kind words. Until next time.\", \"OwnerResponseDate\": \"2023-06-07 08:59:39.958587\", \"ReviewLikes\": 0, \"TotalReviews\": 2.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1686128379960,
        "ReviewContent": "When first arriving on The Land, the magic of the property is palpable, morning dew on the grassy fields  cats, ducks, and goats roaming  the smell of a hearty breakfast cooking in the lodge and the rare experience of silence and stillness in the air. The Land provides the physical space to go internal and be in deep meditative practice as well as opportunity for community and connection with other committed practitioners. Adjacent to the Hendy Woods, the Land backs up to miles of hiking trails, is bordered by a flowing creek, and has a luscious flower and vegetable garden, giving the nervous system an array of natural landscapes to soak into. During the stay, let yourself be nourished by a rainbow assortment of seasonal local foods cooked with love. Fill up your body and soul with this generous offering. The cabins and houses are both rustic and pristine, with white bedding and comfortable beds, allowing for physical restoration and holding. I have had the opportunity to spend time on the Land for retreats and for my solo-practice and always leave feeling more physically and spiritually connected and restored.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"e7bd3fc2ad3ae536efbf3844db557107\", \"OwnerResponseText\": \"Wow Sara this is a stunning reflection. Thank you so much.\", \"OwnerResponseDate\": \"2023-06-07 08:59:39.960428\", \"ReviewLikes\": 0, \"TotalReviews\": 33.0, \"LocalGuide\": 1.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1686128379962,
        "ReviewContent": "Time moves differently here. I m writing these notes from my cosy cabin, watching the wild deer  wander unhurried through the property. From some of the best sleep I ve had in years, to the morning yoga, my stay at the land was all I hoped for and more - as a psychotherapist, it s crucial that I find places for deep rest and I really found it at the Land. I ve been lucky enough to visit a few times over the last few years and never get used to the stars at night and just before dawn. This last visit, it even got warm enough for a dip in the pool. And the food, oh my goodness.. so nourishing and grounding. Even made good progress on my work - yes there s unbelievably good Wi-Fi in the middle of the woods ! I will definitely be back. And I leave reminded that slower is a real possibility.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"5777a18ca03f5a31afb784ec6f520017\", \"OwnerResponseText\": \"Gorgeous Kate. Thank you!\", \"OwnerResponseDate\": \"2023-06-07 08:59:39.962570\", \"ReviewLikes\": 2, \"TotalReviews\": 11.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1686128379964,
        "ReviewContent": "I m a current guest on the land who came to recover from a chronic illness. Within 24 hours of arriving my symptoms miraculously lifted. The people here are so supportive and friendly and the atmosphere is immensely healing. The food is superb!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"6cea7347a9b0fa69c53dfd7822a80a86\", \"OwnerResponseText\": \"We loved having you, Max. Thanks for coming!\", \"OwnerResponseDate\": \"2023-06-07 08:59:39.964645\", \"ReviewLikes\": 1, \"TotalReviews\": 5.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1686128379966,
        "ReviewContent": "Go to the Land! Ive visited a handful of times. Each time, it surprises me how fun and nourishing the experience is. Between spending time in the beautiful (and big!) garden, to the healthy & delicious meals, and the incredible backdrop of the Northern California woods, I always leave with a full cup. The last time I came, I brought some friends because Ive loved my experience spending time on the Land so much. None of us wanted to leave after our week there. I highly recommend spending time in this NorCal oasis and getting loved up by both the land and wonderful people that live here.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"6abcdbb76f5572f6c8ebc612ad13e46a\", \"OwnerResponseText\": \"It was great having you and your friends, Vicky. Thanks for coming and well see you next time!\", \"OwnerResponseDate\": \"2023-06-07 08:59:39.966534\", \"ReviewLikes\": 1, \"TotalReviews\": 6.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1686128379968,
        "ReviewContent": "Theres no place like this serene utopia of a gem. I have been a couple time for different events. One was a retreat and I all needs were beyond handled. I am a foodie and The Land exceeded my expectations. What a fabulous kitchen! Its a place to go to reset, unplug, find your center and breathe in nature. I stayed in a cabin both times and you just cant beat it. Ill be back!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"3fb12939bd44855ff3e1dbeacccd9fc5\", \"OwnerResponseText\": \"Good to see you again Jeremy. The kitchen staff says hello!\", \"OwnerResponseDate\": \"2023-06-07 08:59:39.968179\", \"ReviewLikes\": 1, \"TotalReviews\": 3.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1683449979969,
        "ReviewContent": "WOW! I cannot put into words how special this place is. My experience on The Land was impeccable. The week was full of nourishing food, deep connection, restorative yoga, walks to the river, mind-blowing talks, and giving back to the community. If youre looking for a place to slow down and reconnect with yourself, this is the place to go!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"073b1091c40463daad047825e1a23cf8\", \"OwnerResponseText\": \"Thanks so much Paige for sharing your experience with us at The Land. Were so glad you could reconnect with yourself while being here.\", \"OwnerResponseDate\": \"2023-05-07 08:59:39.969820\", \"ReviewLikes\": 4, \"TotalReviews\": 6.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1588841980541,
        "ReviewContent": "I was here for a wedding in the summer, and the place is beautiful! Jogging through the redwoods was a fantastic way to start the morning. The Land also boasts the best tennis instructor Ive ever had! I highly recommend getting a lesson with Christoph if you have a chance while youre there. Hes fantastic.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"0c97bb2182006e6f139a807c7b2a04d1\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 4, \"TotalReviews\": 4.0, \"LocalGuide\": 0.0}"
    },
    {
        "venue_id": 37,
        "VenueName": "Eros Monastery",
        "ReviewDate": 1525683580546,
        "ReviewContent": "An amazingly peaceful place to restore",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"The Land\", \"PlaceID\": \"ChIJeSN8YTETgYARP1M9eMdf4mo\", \"ReviewIDHash\": \"6bee5fe2ec3edd81b6e1b67b7fc09f26\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 4, \"TotalReviews\": 37.0, \"LocalGuide\": 1.0}"
    }
]