[
    {
        "venue_id": 23,
        "VenueName": "SoulFlow Oakland",
        "ReviewDate": 1714466800064,
        "ReviewContent": "I am so grateful to be a member of the SoulFlow community. The Saturday morning class, which I have regularly attended for years (!), resets me from my week and grounds me community. Its not every yoga studio where everyone knows your name.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Soulflow Oakland\", \"PlaceID\": \"ChIJZbN99kgrdYMRI84FeNC5b_c\", \"ReviewIDHash\": \"3187bc9b4177142147ce84c73d7fd3e7\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 0, \"TotalReviews\": 1, \"LocalGuide\": false}"
    },
    {
        "venue_id": 23,
        "VenueName": "SoulFlow Oakland",
        "ReviewDate": 1712479600067,
        "ReviewContent": "Soulflow is such a fantastic organization with a really great community. Ive been doing yoga classes with Satya for the past couple of years and cant recommend her/the group highly enough.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Soulflow Oakland\", \"PlaceID\": \"ChIJZbN99kgrdYMRI84FeNC5b_c\", \"ReviewIDHash\": \"92e7a2bb5a86005534f86b4eabde49de\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 0, \"TotalReviews\": 4, \"LocalGuide\": false}"
    },
    {
        "venue_id": 23,
        "VenueName": "SoulFlow Oakland",
        "ReviewDate": 1712479600071,
        "ReviewContent": "This yoga and healing center has quickly become my go-to spot for wellness! Ive had the pleasure of practicing with several instructors - Satya, Aja, Jose, Malika, and Josie - and each one brings a unique style and positive energy to their classes. The best part? The community here is incredibly welcoming and inclusive. Whether youre a seasoned practitioner or just starting out, youll feel right at home. Plus, the center offers a wide variety of classes, so theres truly something for everyone. I cant wait to explore more classes and meet the other instructors! Highly recommend this center to anyone seeking a supportive and enriching yoga experience!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Soulflow Oakland\", \"PlaceID\": \"ChIJZbN99kgrdYMRI84FeNC5b_c\", \"ReviewIDHash\": \"516e69379b774e465d00db78ca10235a\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 0, \"TotalReviews\": 22, \"LocalGuide\": true}"
    },
    {
        "venue_id": 23,
        "VenueName": "SoulFlow Oakland",
        "ReviewDate": 1712479600073,
        "ReviewContent": "I ve attended classes at many yoga studios in many cities around the country and have never found a community as special and phenomenal as soul flow. I absolutely love the accessibility and inclusivity of the classes, the honoring of yogas origins, the warmth of the teachers and members, the enormous spiritual and mental health lessons I ve learned. Soul flow has allowed me to significantly deepen my yoga practice and overall improved my health quality of life. Much gratitude <3",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Soulflow Oakland\", \"PlaceID\": \"ChIJZbN99kgrdYMRI84FeNC5b_c\", \"ReviewIDHash\": \"09ee31fd191d9549084d70c12b873751\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 0, \"TotalReviews\": 1, \"LocalGuide\": false}"
    },
    {
        "venue_id": 23,
        "VenueName": "SoulFlow Oakland",
        "ReviewDate": 1712479600075,
        "ReviewContent": "Soulflow is a fun, inclusive studio, and the community is really welcoming! I love how Satyas yoga classes always leave me feeling grounded and energized. The location in downtown Oakland is great--the studio is in a cool old building and gets lots of sun through giant windows, and it feels somehow connected to the flow of the city but also removed enough to be peaceful. Its super accessible by BART, and parking is usually pretty easy on Saturday morning.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Soulflow Oakland\", \"PlaceID\": \"ChIJZbN99kgrdYMRI84FeNC5b_c\", \"ReviewIDHash\": \"a317a86d326ba066514db30025f47f0a\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 1, \"TotalReviews\": 6, \"LocalGuide\": true}"
    },
    {
        "venue_id": 23,
        "VenueName": "SoulFlow Oakland",
        "ReviewDate": 1709801200076,
        "ReviewContent": "Despite being a bit difficult to find, the space has an amazing yoga vibe. The set up with the open windows is beautiful. The studio feels serene. I had a super sweet instructor, Courtney, during my class who made the experience even more memorable! The studio also has meditation pillows, blankets, and yoga mats and blocks available for use that is especially good if you are visiting from out of town! Would definitely recommend visiting if you live/visit the bay and would visit again!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Soulflow Oakland\", \"PlaceID\": \"ChIJZbN99kgrdYMRI84FeNC5b_c\", \"ReviewIDHash\": \"bb23a0a03c55b2907ba64c86e99b95da\", \"OwnerResponseText\": \"\", \"OwnerResponseDate\": null, \"ReviewLikes\": 1, \"TotalReviews\": 26, \"LocalGuide\": true}"
    },
    {
        "venue_id": 23,
        "VenueName": "SoulFlow Oakland",
        "ReviewDate": 1707295600078,
        "ReviewContent": "A Heartwarming Yoga Journey Filled with Nourishment and Connection Soulflow Retreats has been an absolute delight to be a part of as both a caterer and attendee. Satya is an incredibly talented yoga teacher and retreat organizer who touched my heart with her unmatched organization, impeccable care, open communication, and unwavering commitment to safety. As a caterer for Soulflow retreats, I was astounded by the care that was exhibited towards the culinary team. The commitment to safety protocols created an environment that prioritized well-being, allowing us to fully immerse ourselves in the transformative retreat experience. Whether youre attending as a guest or working behind the scenes, the loving touch and attention to detail will leave a lasting impression on your heart. Satyas teaching style is intuitive, adapting to the needs of each individual in the class, while also fostering a sense of unity within the group. The community she cultivates is truly special - a place where everyone feels welcome, celebrated, and supported. With heartfelt gratitude.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Soulflow Oakland\", \"PlaceID\": \"ChIJZbN99kgrdYMRI84FeNC5b_c\", \"ReviewIDHash\": \"53961985be4c7dcc74d694f3ad1818a7\", \"OwnerResponseText\": \"Thank you Ashley. Such an honor to collaborate with you!\", \"OwnerResponseDate\": \"2024-02-07 08:46:40.078496\", \"ReviewLikes\": 1, \"TotalReviews\": 1, \"LocalGuide\": false}"
    },
    {
        "venue_id": 23,
        "VenueName": "SoulFlow Oakland",
        "ReviewDate": 1704617200080,
        "ReviewContent": "I love the SoulFlow space dearly! The teachers and community really create something special. A loving, generous container for a healing practice that centers expansion and collective liberation",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Soulflow Oakland\", \"PlaceID\": \"ChIJZbN99kgrdYMRI84FeNC5b_c\", \"ReviewIDHash\": \"a3c243a77ce91a83e9c589406caf6a62\", \"OwnerResponseText\": \"Thank you for your thoughtful reflection Cristina! Appreciate you being part of our community.\", \"OwnerResponseDate\": \"2024-02-07 08:46:40.080545\", \"ReviewLikes\": 0, \"TotalReviews\": 11, \"LocalGuide\": false}"
    },
    {
        "venue_id": 23,
        "VenueName": "SoulFlow Oakland",
        "ReviewDate": 1704617200082,
        "ReviewContent": "I have been a member of SoulFlow Oakland for several years now. I enjoy each and every yoga class and special event that I attend, and I find the quality of the teachers and facilities to be outstanding. Satya has created not just a business, but an incredible community that is based on kindness and compassion. She and the other teachers support each participant in finding exactly what they are looking for specifically. I feel a deep sense of gratitude for the clear, intentional focus on and inclusion of marginalized groups. How wonderful that everyone can find a safe and nurturing space at SoulFlow Oakland!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Soulflow Oakland\", \"PlaceID\": \"ChIJZbN99kgrdYMRI84FeNC5b_c\", \"ReviewIDHash\": \"30b8b35e4c5622cac5bb9c777adaba7f\", \"OwnerResponseText\": \"Thank you Lisa! This is exactly what we envisioned when starting Soulflow. Thank you for being such an integral part of our community.\", \"OwnerResponseDate\": \"2024-02-07 08:46:40.082605\", \"ReviewLikes\": 0, \"TotalReviews\": 3, \"LocalGuide\": false}"
    },
    {
        "venue_id": 23,
        "VenueName": "SoulFlow Oakland",
        "ReviewDate": 1704617200535,
        "ReviewContent": "Knowledgeable teachers and a friendly environment. Great mom and pop yoga space. Was looking to get away from corporate vibes.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Soulflow Oakland\", \"PlaceID\": \"ChIJZbN99kgrdYMRI84FeNC5b_c\", \"ReviewIDHash\": \"f52c535fd7e6cd98dc40fba1e788a856\", \"OwnerResponseText\": \"Thats what were talking about!\", \"OwnerResponseDate\": \"2024-02-07 08:46:40.535176\", \"ReviewLikes\": 0, \"TotalReviews\": 2, \"LocalGuide\": false}"
    }
]