[
    {
        "venue_id": 26,
        "VenueName": "Sound and Soul SF",
        "ReviewDate": 1714466888890,
        "ReviewContent": "Emmas sound healing class was beyond amazing.  Thank you Emma!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Sound and Soul - Sound Healing with Emma\", \"PlaceID\": \"ChIJs0W86iZbe4MROOFN5xQAbdM\", \"ReviewIDHash\": \"ec6c01e26d352c2e762a0aac8eadf41a\", \"OwnerResponseText\": \"Thank you, Liz! It was such a treat to get to offer the sound bath for your group. Hope to see you again soon :)\", \"OwnerResponseDate\": \"2024-05-05 08:48:08.890203\", \"ReviewLikes\": 1, \"TotalReviews\": 2, \"LocalGuide\": false}"
    },
    {
        "venue_id": 26,
        "VenueName": "Sound and Soul SF",
        "ReviewDate": 1714466888893,
        "ReviewContent": "This was one of the best experiences I have ever had! Emma was fantastic. I didnt even know what a sound bath was before this, but it was the most relaxing experience I can imagine. It was also very meant to be as far as timing - Emma came to our new home a day after closing and it was empty which was great for acoustics and she blessed our home with her meditative sounds. Thank you so much Emma!!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Sound and Soul - Sound Healing with Emma\", \"PlaceID\": \"ChIJs0W86iZbe4MROOFN5xQAbdM\", \"ReviewIDHash\": \"1ae3fa07a9b91600b5c914306a5b9822\", \"OwnerResponseText\": \"Thank you Ilona! It was such a treat for me to be able to offer your first sound bath *AND* your new homes first sound bath :) I hope you two are settling into your new space beautifully.\", \"OwnerResponseDate\": \"2024-04-30 08:48:08.893756\", \"ReviewLikes\": 1, \"TotalReviews\": 1, \"LocalGuide\": false}"
    },
    {
        "venue_id": 26,
        "VenueName": "Sound and Soul SF",
        "ReviewDate": 1712479688896,
        "ReviewContent": "Emma is an incredible sound healer, I could not recommend this experience enough. Ive done private sound healing, as well as public sound healing with Emma (ex. at an event at a yoga studio). She creates such a safe, peaceful, and intentional space for each individual. I was wowd by the experience I had when I did private sound healing with a dear friend. It felt like Emma was pouring love and energy into us and I felt amazing during and after. She took the time before we got started to check-in with each of us over tea, creating the space for a real transformational and relaxation. I loved it so much, that I already have my next sound healing scheduled. I cant thank Emma enough for this sweet and special offering. She has a true gift and Im so grateful that she shares it with us!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Sound and Soul - Sound Healing with Emma\", \"PlaceID\": \"ChIJs0W86iZbe4MROOFN5xQAbdM\", \"ReviewIDHash\": \"146362c9c50cc79e299a451b3c8a3ed0\", \"OwnerResponseText\": \"Sydney! Thank you for these kind words. Youve been so supportive since the earliest days of this offering and Im just so grateful weve connected :)\", \"OwnerResponseDate\": \"2024-04-30 08:48:08.896485\", \"ReviewLikes\": 1, \"TotalReviews\": 10, \"LocalGuide\": false}"
    },
    {
        "venue_id": 26,
        "VenueName": "Sound and Soul SF",
        "ReviewDate": 1712479688898,
        "ReviewContent": "Sound baths with Emma are magical! She is so talented. Emma takes the time to create a safe (and beautiful) space for her sound baths. She puts in so much love and care into the experience and you will leave feeling refreshed, renewed, and lighter.",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Sound and Soul - Sound Healing with Emma\", \"PlaceID\": \"ChIJs0W86iZbe4MROOFN5xQAbdM\", \"ReviewIDHash\": \"2135a70296a62123e2b761b583943de4\", \"OwnerResponseText\": \"Youre the best, Brooke :) Thank you for this sweet review and all of your support of my offering. Its always so lovely to be together!\", \"OwnerResponseDate\": \"2024-04-30 08:48:08.898814\", \"ReviewLikes\": 1, \"TotalReviews\": 1, \"LocalGuide\": false}"
    },
    {
        "venue_id": 26,
        "VenueName": "Sound and Soul SF",
        "ReviewDate": 1712479688901,
        "ReviewContent": "Emma is an incredibly talented sound healer. She creates a beautiful journey from beginning to end of the sound bath, and provides a space to relax, look inward, and find clarity. Emma is intuitive and warm, and she creates an environment that is welcoming, safe, and transformative every time. Plus, her variety of instruments just sound really good and feeling them throughout your entire body is an incredible feeling. I have experienced her sound baths in many different settings - yoga studios, private homes, retreats - and it s always a unique and healing experience. Thank you, Emma, for sharing your gift!",
        "StarRating": 5,
        "ReviewType": "Google",
        "Metadata": "{\"GoogleName\": \"Sound and Soul - Sound Healing with Emma\", \"PlaceID\": \"ChIJs0W86iZbe4MROOFN5xQAbdM\", \"ReviewIDHash\": \"31c7361e3bf825baab52a0c258e3d318\", \"OwnerResponseText\": \"Thank you, Laura! So grateful for you and your endless support <3\", \"OwnerResponseDate\": \"2024-04-30 08:48:08.901328\", \"ReviewLikes\": 1, \"TotalReviews\": 4, \"LocalGuide\": false}"
    }
]