[
    {
        "ReviewDate": 1703030400000,
        "ReviewContent": "We enjoy going to Feinsteins every time we go.  However, last night we had a surprise about the parking.  In the past, if patrons of Feinsteins dined at Restaurant Anzu, parking validation by the restaurant and the club usually took care of most, if not all the hotel parking expense.  NOT THE CASE ANYMORE!  When dining at Anzu last night we were told the restaurant no longer validates parking. We then went downstairs to #FeinsteinsSF, and we were told that they also no longer validate parking at the hotel, unless you are a \"Friend of Feinsteins\" (which if you are not aware is an annual membership costing several hundred dollars).  This resulted in an additional $65 for parking which was not expected.To be fair, on the Feinsteins website on the \"Attending Feinsteins\" sub page, the change in policy is called out, along with the new parking arrangement.  This is not called out elsewhere, and as someone who has attended many performances in the past, why would I look at a page telling me about attending an event?  Even when purchasing tickets to the performance, there was not callout to a change in parking policy.Look we love the venue, we love the performers, and we will be back.  I just think this is something Feinsteins should consider to make sure there guests have the best experience.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"James F.\", \"AuthorLocation\": \"Martinez, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1697241600000,
        "ReviewContent": "I never heard of this venue in SF until a friend of mine recently invited me to the Soul Train brunch experience at Feinstein's. This is an intimate, up-close venue. The buffet brunch was average, but had a good variety of items from bacon, sausage, waffles, eggs, baked goods and fruit. The most important were the bottomless mimosas! The servers were efficient and friendly, constantly coming around to clear empty plates and glasses. The bartender kept the mimosas poured and ready. The brunch lasted for about an hour and the show started shortly after. Watching and listening to the performers really brought back memories of the young me watching Soul Train on TV. It was probably the mimosas, but we even got up and formed a train during the performance!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Sharon S.\", \"AuthorLocation\": \"Pacifica, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1685318400000,
        "ReviewContent": "When I come to city I stay at Nikko Hotel. My absolute favorite. Why? Indoor pool, sauna, steam room, room service, parking, the check In service remembers my children and myself and it means a lot. My kid loves the stuffed dog they available to buy in room. It's got a good feel inside when you walk in. I could even bring my chocolate Labrador Preacher although I've left him home lol. Only bummer in the main entrance has been closed last two times we've stayed. Close to union square two blocks. Close to my favorite bakery in SF!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Julie G.\", \"AuthorLocation\": \"Boulder Creek, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1679356800000,
        "ReviewContent": "Went to a concert there. Getting a drink was such a hassle and the crowd was just a nasty . Saw people telling other to be quiet and being nasty about it. Even though people were singing along. Never again. . It needs a total remodel and bring it upscale. Such a disappointed",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Alan P.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1676592000000,
        "ReviewContent": "Such a nice venue and a gorgeous show! I came here for their Motown brunch and they did not disappoint. The food was tasty, the mimosas were endless, & the show was amazing!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Alexia T.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1672358400000,
        "ReviewContent": "Fantastic & amazing Liberace & Liza Holiday Show last night in San Francisco.  It was truly impressive and these super talented actors, musicians, and entertainers (David Saffert & Jillian Snow Harris) channeled these iconic stars with such precision, passion, and detail that it felt 'so real'. Feinstein's is the perfect venue for hosting such an event. Thank you for such a lovely evening.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Jonathan V.\", \"AuthorLocation\": \"Internacional Benito Ju\\u00e1rez, Ciudad de M\\u00e9xico, Mexico\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1671235200000,
        "ReviewContent": "There is apparently no way to order a drink without having to input your info, email address & Phone number.Furthermore, to a drink you have to submit to being contacted via phone and/or email.This is beyond acceptable in this day and age.So we will not be spending any money here on overpriced drinks at all.They have replaced their service staff with a QR code at every table. I just did a headcount, and they have ONE waiter (which was just announced by a manager) for 86 (!!!) guests! I am seriously stunned by this. Never coming back to this place.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Chris P.\", \"AuthorLocation\": \"Pittsburg, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1663632000000,
        "ReviewContent": "I think Feinstein's at the Nikko Hotel  in San Francisco is one of the best date nights around.The food from Anzu Restaurant and Bar is delicious; the setting is intimate and the music is top notch.We have been going since it opened.  I loved it so much I had a private party for 100 guests on my 60th birthday with Paula West.\" It was everything I dreamed of and more.If you have not experienced Feinstein's at the Nikko....you should!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Radha S.\", \"AuthorLocation\": \"Mill Valley, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1649462400000,
        "ReviewContent": "Let me start by saying I love this venue. I have been coming here for many many years from back when it was the razz room. Back then I used to come here like once a week for a show. Then feinsteins took over. It still the same lovely room, but the prices shot up. Not only the tickets prices, but the drink prices as well. One vesper martini was $31.16 with tip!  Not to mention the $90 ticket price!  I've seen this same artist there a handful of times, and the last time I did the ticket price was $40.  I would love to come here much more regularly but with these prices that's just never going to happen. It's a shame. That being said the staff was very friendly and helpful. I just wish Feinsteins would bring the pricing down to an attainable level again. I would be there all the time.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Daniel A.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1648080000000,
        "ReviewContent": "No. Just no. Ray of Light put on an absolutely stunning 20th anniversary show, but the experience was tarnished for me by a ridiculous venue. I purchased a \"VIP\" ticket. It wasn't super expensive but it was double the price of a regular seat. I'm 5'3\" and they put me in what amounts to a mezzanine seat at these little \"bar\" areas mid-venue. Hardly what anyone would call VIP. I was mostly just unimpressed and would have dealt with it no questions asked, but unimpressed quickly turned to pissed when they seated a very, very large man directly in front of me, in what most people would consider an actual VIP seat. I couldn't see the stage. I requested a seat change, which was granted. Things were looking up, but then I never received the drink I ordered and was charged for 10 minutes in to a 90 minute show. I had even asked when I was first moved if I needed to do anything to transfer my tab, but they told me they'd take care of it. After the show I told them what happened, and they said they'd fix it, and 30 minutes later I got an email copy of the receipt that still shows the extra drink was charged. I'm trying really hard not to be entitled here, but I'm tired of paying a premium for really crappy service. Do better.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Beth A.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1644883200000,
        "ReviewContent": "Swanky little spot for an intimate show. Entire space is approx 40x40, but well decorated and decently spaced out.  Tables each seat 2 people. The stage is easy to see from any spot. The sound is clear and not too loud or low. We saw the first show, post Covid-ish. Valentine's night- seats were $55 each and the performers were worth it. The downside is there are no snack items/tapoas. You can get order a single person cheesecake, 6 chocolate covered strawberries, limited wine and cocktails selection. Maybe this was because they're just getting back on their feet. I'd try it again for sure. Sultry and quaint are the words to describe Feinstein's.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Trish T.\", \"AuthorLocation\": \"San Ramon, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1641081600000,
        "ReviewContent": "Went to an 80's show while visiting San Francisco. It was very fun. Nice atmosphere!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Kris C.\", \"AuthorLocation\": \"San Dimas, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1637452800000,
        "ReviewContent": "Here for the first time to catch a musical. BRAT PACK is an '80s music lover DREAM COME TRUE!!! The actors/singers capture the feel of my highschool years and took me down memory lane with songs from ALL my ''80s favorites!!! Best way to enjoy this is with a loved one who adores those great moments from \"The Breakfast Club\", Weird Science\", Pretty In Pink\", \"Some Kind of Wonderful\", \"Ferris Buellers Day off\" and \"Say Anything!!\" drinks were tasty and any seat there is perfect!!! We had a quiet audience and it would have been TOTALLY AWESOME if they would have allowed themselves to let their hair down!!! If you go.... PLEASE HYPE UP the audience to get the full experience... my daughter and I got some people going with our clapping and singing along so DO THE SAME!!! That crew worked HARD and it showed in their performances!!! May have to go back with some highschool pals... a FUN EVENING in a perfect venue!!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Gloria O.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1637366400000,
        "ReviewContent": "This isn't your average night on the town. It's a chance to get dressed up and see an artist perform in a small venue with a small band. This isn't for everyone and it isn't cheap. I usually buy tickets throughout the year if there is an artist I want to see and I can afford the tickets. From time to time you can find discounts through the venue or other ticketing apps. I love their downstairs space on the 2nd floor. The booths are my favorite. It's cozy and intimate. They opened a newer space on the 3rd floor. It's larger and called the ballroom. It's a space they can convert into anything and seems they are still working out what to do. It currently resembles a convention/education set up due to the rectangle tables. Hopefully they are waiting for the round tables to arrive. Back in the day, singers used to perform in ballrooms. However I hope they eventually are able to make this more of a permanent space.Currently you can order drinks from a QR code. Its overpriced but i usually order one mixed drink. Hopefully they will improve the menu, pricing and allow food again. In the meantime you can dine at Anzu or one of the other restaurants surrounding the hotel. Otherwise the staff is wonderful and I didn't feel rushed. And yes, you have to show your vaccine card to get in.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Janice O.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1636848000000,
        "ReviewContent": "Bought tickets to a show at Feinstein's - which is a proper show venue.  But the show was in a hotelballroom upstairs, NOT actually in Feinstein's! I feel lied to. I WAS lied to. Shame. I haven't been to a trade show in years, but that's what this concert felt like, gross.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Mike P.\", \"AuthorLocation\": \"Los Gatos, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1636675200000,
        "ReviewContent": "This place is really just for rich old white people. I have gone here three times, and of those three times, I was always the youngest person in the room, and I'm in my late thirties. The food is overpriced and so are the drinks. And, when they were requiring the two drink minimum, and the minimum of $20 for food (I call those the dark times), they would also tack on a mandatory 20% tip to your bill. Meaning that if you paid $60 to see a show, which is already pretty high, considering the small venue, and the awkward area of SF that the hotel is located in. You didn't get out of there without paying almost $100 a person. One of my favorite singers in the world used to play many different venues all across the bay area, and in SF proper, but now she only performs here, as if she has signed a contract with Satan himself. And, I just can't afford this venue anymore. Especially since she only performs here for about an hour, when I have seen her perform other places for twice the amount of time, and half the price. After learning that Mr. Feinstein supported Trump financially in the last two elections, I can't continue to knowingly give my money to this venue, or anything that he is associated with.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Paul T.\", \"AuthorLocation\": \"Queens, NY\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1627516800000,
        "ReviewContent": "First date night in SF since the pandemic started! We got to see Eva Noblezada of Hadestown, Miss Saigon and Les Miz perform in an intimate setting. This place is so small that there's really no bad seat in the house. She was wonderful! She was so gracious at the end to give her fans an opportunity to take a picture with her. I love that they are only letting fully vaccinated people into their shows. You don't have to worry about getting infected with Covid-19 as you're enjoying your drink during the performance. The tables are nicely spaced apart too, about 3-6 feet in some cases. As of July, they don't have drink minimums or food.  You order your drink via a QR code and the staff will deliver drinks to your table. I saw Lea Salonga perform here as well. I also got to take a picture with her. Seeing my favorite Broadway stars perform here is such a treat. It beats having to wait outside the theater after the performance and hoping to see your favorite star come out the back door as you would in NYC!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Hazel C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1626048000000,
        "ReviewContent": "Felt lucky that one of my first post-vac, post-pandemic outings was Feinstein's to see Justin Vivian Bond. The room is so nice - beautifully decorated, cozy and intimate. And the staff is just so special - they really want everyone to have a good time and it shows. There aren't many places where you're greeted so graciously!I look forward to returning for other events.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Gwynnie P.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1582416000000,
        "ReviewContent": "Whole thing, show tickets + $20 min. drink/food per person + parking was a little bit on the pricey side, but I guess to be expected in a nice, higher-end hotel.  That said, show was great, seats were great, drinks/food were great and staff (parking attendants, maitre d', waiters) were even better (amazingly warm and accommodating).  Have nothing but great memories of that evening.  Definitely a great place for a special night out.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Brant B.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1574640000000,
        "ReviewContent": "A wonderful place to be up close and personal for a concert! Wonderful drinks, delish small plates and the staff is very friendly! I failed to bring my tickets as clearly instructed and was in a panic about it. The very kind host assured me it wasn't a problem and looked me up by name and said I was good to go! We got there early and were rewarded with front row table seating and enjoyed some delicious charcuterie and cocktails. They seemed to be priced well (remember you're in SF where everything is high priced!) We say Lesli Margherita in her Cabernet called RULE and it did just that!! What a fab performer! So fun!! We have been here for other broadway to the Bay type shows and will be back for more!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Jen O.\", \"AuthorLocation\": \"Fremont, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1574640000000,
        "ReviewContent": "It's been several months since I'd been to a show at Feinstein's. The shows are usually really good, fun, entertaining. I recently went and that still held true. Really enjoyed the show. What was very different was the food menu. I have always been able to find a good variety of food and quality was pretty good, be it a bit over priced. I was very surprised to see the menu was completely changed. There were so few decent \"dinner\" options and it appeared that the menu was now focused on appetizer type foods, but still at dinner entree prices. The only thing that looked appetizing on the menu was the pizza. I ordered the \"Whole Lotta Meatz Pizza\" at $18. Well, this was NOT pizza. It was basically packaged flat bread with some sauce, meat and cheese added on top and put under a broiler for a few seconds. The bread was mostly raw, not crisp at all. The topping were fairly tasty though, but overall very mediocre as a \"pizza\". I wouldn't even call it pizza.I ordered a glass of $15 white wine and it was barely 1/4 full in the glass. Such a rip off. The wine was decent tasting, but again, nothing special.I considered getting a dessert after seeing my neighbor get something that looked tasty. They said don't bother, it was mediocre as well and way over priced at $14.I'm very very disappointed at the new menu. In the future I'll make sure to get dinner somewhere else first and just order a couple drinks at Feinstein's and be done with it.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"David S.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1573862400000,
        "ReviewContent": "Great entertainment. Often specfukingtacular. Food is abysmal, has greatly deteriorated, pizza worse than that you can get at a movie concession. Short rib sliders were tasteless, so watery it soaked through the bun, food served before the beverages arrived, had to ask twice for my drinks, a Diet Coke served warm in a screw cap bottle, with a glass with two ice cubes. They didn't even unscrew the cap. This place is no comparison to 54Below.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Richard S.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1572048000000,
        "ReviewContent": "We love coming here. It is such an intimate entertainment space. Wish the food options were better since there aren't any restaurants we like close by and you have to get in line to get your seats at 6:30 and the shows start at 8pm.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Carroll B.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1566172800000,
        "ReviewContent": "This place was very impressive for my first visit.  I loved the 72 hour short ribs plate.  Bit slow on the water refills but they had a full house that night.  Will definitely go back.  Parking in area is easy also.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Jeff F.\", \"AuthorLocation\": \"Modesto, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1563753600000,
        "ReviewContent": "A little overpriced, but the atmosphere and the performances are excellent. Recently got to watch Top Shelf Classics perform and really enjoyed the experience. Jordan, the event coordinator, will go the extra mile to ensure your experience is one you won't forget.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Keiko O.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1558915200000,
        "ReviewContent": "It is always a fun evening out at Feinstein's at the Nikko! .I have seen so many great shows like Darren Criss, Cheyenne Jackson, Jeff Goldblum, Carson Kressley & Kristine W (hilarious) and many more. The staff have always been wonderful to me and my friends. Fellow patrons are generally chill and friendly and the venue itself is intimate and charming. If you don't leave here with a smile on your face, you may want to get your pulse checked ;-)",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Audrey H.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1557705600000,
        "ReviewContent": "I've been going here periodically since they opened as I'm constantly seeking intimate venues with cocktails and live music, the food is an added bonus that is even more rare to find.  Based on the reviews I'm seeing on Yelp it's clear that people like to voice their opinion when they are unhappy but don't nearly feel as compelled to voice what's good, which is why there's not many reviews of Feinstein's since they updated the menu, which appears to be the main complaint on here.The bottom line:  Feinstein's is exactly what you think it's going to be - good to great shows depending on your interest, good solid classic drinks, and the food is solid and has improved significantly over their past menu.  For people that complain about cost, this is a music venue that needs to charge a nominally higher price for the comfort and option of having food and drinks, that's the only way a place like this can stay in business.  I don't have a problem paying $2-$3 more for each plate of food or cocktail, that's the price of convenience and has to be done at a place like Feinstein's.  Pricing is completely on par with volume and quality.  And you should appreciate the $20 minimum charge, it encourages at least one solid cocktail or plate to enhance the experience that you have specifically come here for.  And finally, don't even think of complaining about a built-in 18% gratuity, that should be expected at a place of this level and I have had good to great servers every time who deserved every penny they got.  A place like this is rare to find for a reason- people have to be willing to pay a little extra for it. I could give some small improvements and suggestions but overall Feinstein's is giving it's audience exactly what they want:  a swank somewhat more mature venue for great live music and cabaret with good cocktails or food.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Ryan B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1555200000000,
        "ReviewContent": "Horrible case of food poisoning as a result of the beef chili nachos made with the movie theatre cheese from a machine. Three days of my life robbed. Do NOT eat the food here.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Thomas M.\", \"AuthorLocation\": \"Newark, NJ\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1550275200000,
        "ReviewContent": "We come here for atmosphere and superb cabaret performers. The service is spotty and the food/drinks a bit overpriced. I found out you can eat at the restaurant upstairs and they'll hold your table. I'm going to do that next time as I waited forever for food. Still-- it's wonderful to have a venue like this in SF. Great night out.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Dina J.\", \"AuthorLocation\": \"Los Altos, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1549929600000,
        "ReviewContent": "I  had a big problem with the house rules. We were informed that there was a $20 extra compulsory expense for drinks or food. Since we had just had dinner and drinks upstairs at ANZU in the same venue, to the tune  of $150., and did not feel like more food or drink, we asked to be relieved from the drink quota...this was in addition to the price of the ticket. They refused .",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Patricia G.\", \"AuthorLocation\": \"Burlingame, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1544659200000,
        "ReviewContent": "We bought upfront tickets for the Michael Feinstein show at Feinstein's At The Nikko for ourselves and two of our friends who were celebrating their 50th anniversary for December 6.  We also had dinner at this venue before the show.  First of all, we all thought the show was fantastic.  Our friends were really impressed by the show and the venue.  Michael Feinstein has to be one of the best entertainers currently performing.  The number of songs that he performs and his memory of them is amazing.  We saw his show last December and there was not one repeat song in this years show.  And his stories are really interesting and, in many cases, very funny.  The Nikko venue cannot be beat.  It is very intimate and there is not a bad seat in the house.  We chose to be upfront to be as close to Michael as possible.  The food, though limited in variety, was very tasty and quite reasonable.  We will definitely return here to see Michael Feinstein and other performers as well.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Joseph F.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1538006400000,
        "ReviewContent": "Vastly overpriced food that's average and bland.  Unfortunate as the restaurant looked so promising. Our waiter was very rude and actually kicked us out after dropping $400 on a tab. I would recommend that my fellow yelpers avoid this spot. Much nicer options in the area. We complained to management but they didn't seem to care.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"ben h.\", \"AuthorLocation\": \"Portland, OR\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1532908800000,
        "ReviewContent": "Great spot to catch a show. Especially nice setting for standup comedy. A little over a year back, I saw Kaseem Bentley perform at Feinstein's: great comic, audience, and venue. Would love to see more standup here at this beautiful theater.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Greyson G.\", \"AuthorLocation\": \"Cherry Street Historic District Neighborhood, Santa Rosa, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1529971200000,
        "ReviewContent": "We went to Feinstein's for a specific event.  First, I absolutely love the venue. It's classic without being pretentious. I wanted this to be \"my spot\", a special place that's a little different that my husband and I could go to for date night.The venue itself: Beautiful. Makes you feel like you are in a 1920s jazz club. However, they pack you in. And when I say pack, I mean you're going to get an elbow in the rib by the person next to you. It was uncomfortably close. And considering the size of the tables, is less than ideal. It was unbearably hot. It was actually quite cold outside. But you have a small venue, Probably 30+ people more than should *actually* be there (given the 140 max occ). The overhead lights are the recessed halogen lights that could be heat lamps AND stage lighting. The food was okay. Not great, but not bad either. We had dessert and a couple of cocktails. I will say, I really love the idea of this. The unbearable heat is a major deterrent.  I personally would pay slightly more for a ticket to decrease the amount of seats to make this a more comfortable experience.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Brie P.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1526860800000,
        "ReviewContent": "The room is intimate, the sound is amazing, and the talent flows like a champagne fountain.  It's the dream of anyone who wishes they had grown up in New York with broadway stars performing at small clubs and cabarets...and, it's just an hour from my house!  Magnificent.  Seating is cramped.  So be prepared.  It does get warm, especially for a \"husky\" boy like me.  The crowd is eager and ready to respond.  The booking agent does a fantastic job.  Kudos.  I can't wait for our next adventure in the big city!!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Michael G.\", \"AuthorLocation\": \"Martinez, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1526860800000,
        "ReviewContent": "Had a terrific time at last night's show (Michael Feinstein, the American Songbook). Overall great experience. I was quite surprised to see the negative reviews here. It appears some things have really changed (for the better)! We bought our tickets online. We bought the $110 tix, but really the $85 ones would be fine, as the venue is intimate, and really all the seats are good. We took BART and walked just three blocks to the Nikko from Powell St. Station. We arrived at 4:00 for the 5:00pm show. Jordan Perlman, the box office manager, was terrific and got us seated with our friends, even though our tickets were not bought together and were originally for different sections. You really should plan to be there an hour early. Nobody was super dressed-up, but everyone looked casually \"smart\". Now, regarding the food...here's where things have apparently changed. There is a new menu and it's fun, eclectic and well-suited to the environment. It's a kind of gastro-pub type food, with an emphasis on fresh appetizers and small dishes to share.  Our group enjoyed salad, flat bread mushroom pizza, a burger and spicy tuna roll sushi. While cocktail prices are high, a Kirin beer is only $7. The service was quietly efficient. They do add an 18% gratuity, so be aware of that. We all enjoyed our food!All four of us had a delightful evening and we will definitely return this wonderful place.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Joanna S.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1521849600000,
        "ReviewContent": "Great, small room, upscale bar food and good drinks. If you like the act you will love  Feinstein's.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"John C.\", \"AuthorLocation\": \"Las Vegas, NV\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1520640000000,
        "ReviewContent": "We saw a great show (Tom Reardon) at Feinstein's tonight.  We always enjoy the service at this venue, but tonight we experienced excellent, above and beyond service that needs to be pointed out.  Before we arrived there was some concern regarding our seating, which the staff handled expertly.  All throughout the performance, however, one particular guest nearby was incredibly disruptive (clearly drunk) and out of control.  It was disturbing several patrons to the point that security had to be called in.  House Manager, Jordan Perlman, acted with much grace under pressure (including from me) and made sure the situation was dealt with appropriately.  What could have been a disastrous evening ended up remaining very enjoyable, thanks to Jordan and his team's expert care of their audience.  We will be back!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"John B.\", \"AuthorLocation\": \"Mission, San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1517097600000,
        "ReviewContent": "First let me say we started off very excited to be back for our second year in a row to see Linda Eder. We showed up at 5:00 to make sure we were first in line to see Linda Eder. This was a Christmas gift for 2 of my friends. The manager and the girl running the theater have to business working with people. Rude as all get out. When you order premium seating make sure it is clear what the rules are to your guests. We waited to have dinner so we could spend money at the venue. Instead we were told the only way to get first pick of seats is to eat upstairs. If that is the case advertise dinner and show package. Once in the charming theater we ordered our meal. Our server was charming. We ordered 3 full meals. Not just showing up to the show and buying a drink. Food was over cooked and poor quality. One of the steaks was so over we had to send it back.  The other two steaks we just chose to deal with it. I was raised in hospitality and this manager needs to go back to class. So not impressed. With the price of the tickets dinner and drinks this was an evening of more than $1000. If you are setting rules on your tickets make sure the rules are plane and clear so people know what to expect. Thank YouHighly disappointed.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Tony C.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1515024000000,
        "ReviewContent": "This is really a two-part review.  My husband and I love this cabaret style venue.  It only seats about 120 people, so very intimate and all seats have great sight to the stage.  We have been there three times and each time the show was amazing; we were so lucky to see Barbara Cook before she passed away; saw Michael Feinstein there in December which was AMAZING, then saw Jeff Goldblum on New Years Eve, which was so much fun.  The ambience in this place is truly 5-star and this type of piano-bar/cabaret just does not exist anymore.  Now, the second part; the food and drinks are just not good and too expensive.  I'm surprised that given previous reviews, Feinstein's has not addressed the matter as there are not as many \"forgiving\" people like myself and my husband.  Having been there before, we know to have dinner before the show at a place we like, then spend the required $20/person on drinks, which are just adequate.  I gave five stars because the venue itself is so rare these days and just special.  I just hope they decide to address the food and drink issues as I would hate to see the place close because people don't want to pay the price for the below average food and cocktails.  However, we will continue to go because we LOVE the venue.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Pam A.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1513382400000,
        "ReviewContent": "Wow, the difference between the low quality of food/drinks and high quality of the venue aesthetic is so stark. You're paying 5 star prices for food and drink for 1 star quality. The only reason to go is for a good performance. They're lucky they can book compelling names for the shows, because the food is terrible.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Fran B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1513382400000,
        "ReviewContent": "The show was great. The food was hideously over priced and completely awful. School lunch and airplane food are better. We had 2 drinks each and 2 entrees and it was $145 for disgusting food. I'll never eat there again. Awful awful awful.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"WestCoastYelper W.\", \"AuthorLocation\": \"Minneapolis, MN\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1512864000000,
        "ReviewContent": "The 1-star is for the fact that it's a live performance venue and those are rapidly disappearing in SF so I don't want this place to close down.  However, Feinstein's needs to get a new chef, manager and a new business model because the one they have sucks.  The food and drinks are overpriced and terrible and with a $20 minimum per person (not including tax and gratuity) there's no incentive for the kitchen or server staff to bring their \"A-game\" - heck, even a C+/B- game would be better.  We wanted to see our friend who was in the show, so we paid $25 each for the tickets - we're on a bit of an austerity budget so we factored in the $40 minimum and hoped for the best.  We ordered a soup, salad and 2 bottled beers for a total of $38 - the soup (corn chowder)  was barely tepid and had an overwhelming fishy smell - it was supposed to be lobster-based, but I think they just poured in some fishy tasting water.  The Caesar salad was just a bunch of large romaine leaves thrown on a plate with 2 anchovies and 2-3 small pieces of tomatoes, the menu said there were \"brioche croutons\", but there weren't any on our salad.  When we pointed this out to the server, she said \"well, I can't bring it back, but I can bring you a bowl of croutons\" - about 10 minutes later, we ate the croutons with what little lettuce leaves we had left.  To add insult to injury, when our bill came, they added $2.00 to our bill to meet the minimum, really?  are you that greedy?  Totally penny-wise and pound foolish - they may have gotten their measly $2 but they lost any and all future business from us and all of our friends - my partner is a musician and actress so we know many people in the target market for Feinsteins.  With the tax and included gratuity, our $38 crappy food and cheap beer came up to $52.  Maybe they need to have a 2-tiered system - remove half the tables and add more \"show only\" seats, charge for the show and recoup the lost revenue by doubling the size of the audience.  The other half can be tables with the $20 minimum (but the food still sucks)",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Iris F.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1510358400000,
        "ReviewContent": "The performers we saw were amazing but the expense to see them was ridiculous. We spent $50 on two tiny horrible salads and one cocktail! The tickets were $17.50 with a $9 service charge and then a $20 per person food and drink minimum. Along with two BART tickets the whole evening ended up costing well over $100 for two people. If the food hadn't been so bad it would have been tolerable. But the ceasar salad I had consisted of two stems of the heads of romain with a couple anchovies draped over them. Most of it was inedible. The waiter had to be reminded of my cocktail and many of the items we wanted to order on the menu were unavailable.Total rip-off tourist trap. You're better off anywhere else.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Sarah S.\", \"AuthorLocation\": \"Dublin, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1509235200000,
        "ReviewContent": "Food: 3/5Service: 4/5Ambiance: 4/5Overall: I come for the shows and it comes with a minimum unfortunately.  Food is ok.The extended review...Food:Steak - The meat overall was very tender and taste was pretty good.  Small in portion unfortunately but you have to buy something to reach the minimum.Service: friendly and attentive waitstaff.Ambiance: a cute setting.  The front seats are a tad cramped but overall a very good venue.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Spencer Q.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1509062400000,
        "ReviewContent": "Three of us went to Feinstein's last night to enjoy Billy Philadelphia and Meg McKay, and we certainly did that. But the food. . .since it's almost Hallowe'en, I suppose it was appropriately dreadful, but be warned: you may not always want to pay extraordinary prices for a penitential \"meal.\" One of us ordered a prawn cocktail which contained 6 or 8 (can't be sure because you needed a microscope to see them) of the smallest creatures imaginable. Their tails were longer than they were, and that's not saying much. They were served without any accompaniment such as bread or even crackers. We two ordered hamburgers. It's not easy to compose a hamburger this bad: a bun with a hard shiny top (meant to look toasted, no doubt) and with no taste at all, enveloping a supposedly rare dollop of ground meat, dry and as tasteless as its bun. It came accompanied by sliced potatoes that looked golden brown but were hard inside.  I asked our waiter if I might have something else---anything else: I don't eat potatoes even when they're properly cooked. A couple of sliced tomatoes? I said. He replied that the chef could make me a little salad, but there'd be a charge. Wine: we each had a glass of red house wine before dinner. They cost $36 for the two. With dinner we asked for a carafe of red wine. The carafe turned out to hold two half glasses of very mediocre wine: $25. Not counting the pre-dinner wine, our check for 2 tasteless hamburgers at $26 each,  2 scanty glasses of wine and an 18% obligatory tip for very bare-bones service came to $95. (Our companion paid for his own prawns!)The minimum at Feinstein's is $20. Have a couple of cocktails, enjoy the show, forget the food.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Helen P.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1505865600000,
        "ReviewContent": "I had the distinct pleasure of hearing Lisa Vroman sing last Saturday Night at Feinstein's at the Nikko.  I have long been a fan of Ms. Vroman's work and was exited to hear that she was performing a cabaret in this delightfully intimate venue.  The Feinstein itself is a great space, with excellent sight-lines throughout.  The sound was excellently mixed (I'm sure no small task with a singer who has been trained to project without technological assistance).  The sound between singer and pianist was always precisely balanced.   And, although pricey, the drinks were good. Ms. Vroman's program was a well-balanced mix of familiar and unfamiliar selections from the musical theater canon.  All songs were introduced with just the right amount of details (and insider information), and more importantly, gorgeously sung.  As a lover of both opera and musical theater, I especially enjoyed her clever mash-up of Glitter and Be Gay by Bernstein and The Jewel Song by Gounod; as a classically trained operatic soprano, I can assure you she completely delivered on both. She was accompanied on piano by Joan Cifarelli, a Bay Area local, and brilliant musician in her own right.  The combination could better be described as a partnership, and Ms. Vroman graciously gave Ms Cifarelli the opportunity to show her chops on some Gershwin at one point during the evening. I was surprised to learn that this was Ms. Vroman's first cabaret, as she seemed completely at ease and at home in this setting spinning tales and delighting the audience.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Adrien G.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1499904000000,
        "ReviewContent": "I've been here several times to see various artists and I'm really in love with this venue. Easy access from BART or if you drive (I prefer to drive as the parking garage is across the street). Intimate setup, for those of us crazy theatre people, it is such a special experience to see a favorite actor or actress perform up close and personal. The post show meet and greets are a plus. Service is great, food is average, and the prices for seating is reasonable.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Mariel G.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1498435200000,
        "ReviewContent": "We've been coming here for years. The menu and the pricing system had changed since the last time we came. Now they call it 'family style' even though the portions are small. 1 item for $10, 2 items for $20, 4 items for $38 and 6 items for $55. So we decided to order 6 items throughout the night. When we got the bill it was for $60 just for the food. We told the waitress it should be $55 for the food and we were told that it's because we didn't order them at the same time. We were not told about this weird rule while ordering and it didn't say so on the menu. This is not a very good system and left a bad taste (excuse the pun) in our mouths although we had enjoyed the show.Otherwise, the food was pretty good although the food was barely warm. The sound system always seem to be a bit off, which is surprising for a small cabaret.The greeters were very nice and welcoming, unfortunately the waitress soured on us after we questioned the bill. Lucky they charge 18% tip automatically. But she would've gotten more if she didn't get an attitude. I recommend just ordering drinks for the minimum $20.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"John O.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1497571200000,
        "ReviewContent": "Great place for entertainment. The menu changed in the past few months. The food selection is mediocre and what is served is lacking. Eat elsewhere before the show and spend your $20 minimum on drinks.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Bruce W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1495584000000,
        "ReviewContent": "Great spot that brings in A+ talent. Very cozy and fun venue. I love the acts Feinstein's brings in, but holding back one star because WOW are the prices for food and drink steep. I ordered a lychee martini and for $15, got two sips worth of a cocktail. No glasses of wine below $16. With the recent menu revamp, it seems like portions got much smaller and prices much higher. I love you Feinstein's, but I'll be eating at home before the show!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Ashley M.\", \"AuthorLocation\": \"Greenville, SC\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1492819200000,
        "ReviewContent": "This was my first time to the Feinstein's at Nikko venue since it replaced the Rrazz Room.  The six of us were here to see Lea Salonga. The seating arrangements for the venue appears similar but there appears to be cosmetic upgrades, such as the lighting.  It is still a classy and intimate venue to see a performance.  There's a $20 cover charge per a person.  The menu consisted of savory and sweet shared plates at $10 an item and a selection of cocktails, wine and beer.  Some in our group ordered the beef sliders and the Margherita pizza. The sliders looked good and the pizza was more of a flat bread style.  I had the chocolate banana sundae, which I thought was pretty good. Food are like appetizers, so don't expect large portions. Very enjoyable performance by Lea.  Feinstein's is still a nice intimate venue to see a performer.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Al L.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1492300800000,
        "ReviewContent": "The entertainment here is always fantastic. Though I've noticed the foods been getting more expensive for smaller portions, as a meal I spent about $12 on last time was half the size and only $2 less this last time I went. I have also noticed that if you sit in what would be considered the \"cheap\" seats (still around $45) the service is much much worse. I waited 40 minutes for food, and only got it when I asked the waiter! Also, they never came back after dropping off the food to ask if we needed anything else. I noticed that the waiters walked around and picked up plates from every other section but ours, they gave water to everyone else but we never saw a waiter come to us to offer water or take anything away until they came with the bill. I had to gesture DURING THE SHOW to get more water, let alone try to get anything else. Previously I've had wonderful experiences here, but this last time was extremely disappointing. It's sad to know that they really do treat you differently depending on what you spend on tickets.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Lily G.\", \"AuthorLocation\": \"Pacifica, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1492300800000,
        "ReviewContent": "really enjoyed watching Lea Salonga with my wife and a couple of friends. This is an intimate environment with not a bad seat in the house. They serve food but I did find that some of the dishes, especially the soup and what they passed off as their Pork Sisig was tepid at best. For what you pay and for the ambience this should be rectified. But with that said the service is very good and so was the show. I would definitely come back. Its Bartable being a couple blocks from Powell station.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"John S.\", \"AuthorLocation\": \"Union City, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1481328000000,
        "ReviewContent": "The venue gets a solid four stars and it would get five if the food wasn't so terrible. It is BARTable and there is also valet and self parking available. We checked in with the hosts and were walked to our table. They also checked coats and such for us. The space is classy, cozy, and intimate, without feeling cramped. We saw Jane Lynch's new A Swingin' Little Christmas show, and she performs with her incredibly talented friends Kate Flannery (Drunk Meredith from The Office!) and Tim Davis (Vocal Arranger from Glee!) and accompanied by the fabulous Tony Guerrero Quintet. It was their first go at this particular show so there were some bumps along the way. Of course, this just added to the fun. Drinks were just fine, although there was a bit of confusion when our server realized that all the menus were incorrect. Whoever was in charge of updating them obviously forgot that day. Our group kept things simple with martinis and glasses of wine. About the food. It's bad. Really bad. I got the mushroom tortellini and it was beyond bland. The pasta and sauce were gummy. The carrot, purple cauliflower, and brussels sprouts on top were nearly raw. My honey got the steak and he said the best part of the dish was the fries and they were just okay. They managed to mess up the steak with the cut of it -- two pieces, one with a bottom layer of fat. After that, the cooking of it doesn't really matter...which still wasn't good. Moral of the story: Definitely see a show here, after eating dinner elsewhere. The food/drink minimum ($20) can easily be met with drinks.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Emily J.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1480723200000,
        "ReviewContent": "Atmosphere:  Straight up 5 stars!  It is intimate and very classy.  Up scale with great acoustics.  There is not a bad seat in the house and most everyone in attendance dresses up for the setting.Waiter:  Kevin was super friendly and answered all of our first timer questions.Food: BLAH!  Do not waste your money here on food.  We figured it would be easiest to dine there.  Huge mistake, 25 minutes for a commercially made flat bread, a supposed kobe burger which was cooked to death despite being asked for medium-rare, served with basic mustard, ketchup, mayo, iceberg lettuce, unripe tomato, and single sliced dill pickle round.  The bun was honestly the best thing served to us the whole night.  The burger was screaming hot and the fries in a small cup cold!  We also ordered the mushroom tortellini, also store bought and cold.  There were three tiny pieces of yellow squash and a overcooked small piece of wilted purple cauilflower.  The sauce was in serious need of seasoning and there may have been a quarter of a cup for the whole dish, almost naked pasta.Drinks: we spent over $100 for 4 drinks each two mules and two Irish coffees, not even a buzz.  The alcohol is nonexistent, AND our first drinks were ordered with our food and arrived with it 25 minutes later.The bill... $192!  Luckily I had read in other reviews that the tip was included because it is too dark to read the lightly printed bill in the dark.  Thus we paid an extra $14 for a margarita , WE DID NOT ORDER! Future visits tips...eat elsewhere, bring your own alcohol in your bag to add to your $20 minimum per person purchase.  Better yet...avoid this overpriced place!We loved our show!  Linda Eder was amazing and we were so grateful to see her perform and meet her after.  Will I drive 3+ hours to return to Feinsteins? NOT A CHANCE IN HELL!!",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Deanna L.\", \"AuthorLocation\": \"Sparks, NV\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1476662400000,
        "ReviewContent": "Gone are the days of intimate nights at the fabulous Empire Plush Room -- the venue that used to house memorable evenings under the management of Rrazz Productions. After Rrazz Productions was kicked out, they found a new home at the Hotel Nikko for several years until it was bought out and evolved into its latest incarnation -- Feinstein's.Let's start with the positives since this is a four star review.The room is beautiful. Feinstein's did more than just \"gussy up\" the old Rrazz Room.  They stripped it of all the tacky accoutrements that made the room look cheap before: crappy projection systems, poorly placed accents, and other things made one think of crepe paper at a birthday party. Thank you, Feinstein's team, for making the room look elegant, intimate and a little more expensive.The acts. Feinstein's seems to keep a nice full schedule of diverse acts, and it's a shame the residents of the bay area don't take full advantage of it.  To me, the opportunity to see Tony award winning actors and actresses up close and personal is a privilege and a treat.  I've seen drag shows, magicians, actors turned singers, commedians and legends in their own right at this venue -- Most memorable and magical was Chita Rivera!  There are acts to satisfy all different interests.What keeps Feinstein's from getting five full stars?Cost.  Back in the good ol' days, an evening out used to be reasonably priced. Can't get that with Feinstein's. If you want to risk your life, you can try to find street parking in the Tenderloin...or for $20, you can park at the Nikko (after validation coupon!!!).  Back in the good ol' days, there used to be just the \"two drink minimum.\"  Now the room enforces a $20 minimum on food and drink PER PERSON.  Feinstein's and the hotel also encourage you to come early and dine at their overly-priced \"Anzu\" restaurant for dinner.  After dining here once under the impression that the meal cost would be applied to our lounge minimum, then finding out they don't give you credit, we've stopped eating here. Imagine paying $50 for your meal only to realize you have to shell out an extra $20 after you're already \"full.\"  And if you think you're going to send a message to the venue by stiffing the staff on the tip, you needn't worry -- they impose a mandatory gratuity on the check.What this adds up to is this typical conversation with friends: \"Well, I'd like to see [cool vocalist], but I really don't want to pay [double the ticket cost by the time you add everything up] to see [cool vocalist]\"Volume.  My buddy and I tend to walk into the room with slight trepidation.  Will there, or will there not be that dreaded thing -- the drum set? Sometimes seeing percussion sets us up for annoying moments during the evening when the accompaniment is so loud that it competes with the vocalist and just overpowers the room. This is something Feinstein's could work on. On our most recent night out (Patina Miller), her pianist was just flat out loud. Nothing delicate about how he handled the piano. Very talented, but very loud.  Other nights we come into the room and it's just piano and bass and the volume complements the room nicely. You just never know.Seating. Those who aren't familiar with cabaret style seating may not understand how this works. You buy a \"ticket\" for a certain area of the room and then it's \"first come, first seated\" for that area. What I find a bit off-putting is how densely they pack people at the tables. No elbow room.  Very little room to place the overpriced food/drink you're forced to buy.  One night another couple's pizza order was so close to me, they offered a bite.  If you know the feeling of an overweight individual spilling over into your seating area on an airplane, then you have an idea of what you may be setting yourself up for.  I recommend aiming for the \"bar seating\" area. You have a bit more personal space, and it affords you a clear and unobstructed view of the stage.Conclusion.The high points do outrank the low points for the most part, and that's why Feinstein's continues to get my (somewhat regular) business.  I do recommend experiencing this place.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Michael B.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1475539200000,
        "ReviewContent": "What can you say?  OVERPRICED and ATTITUDE!  Been there a few times and there was always a line up of lot's of people usually  arguing to get a better seat at the reception area?  Don't understand this?  Two drink minimum? Yikes our bill was over $45.00 just for 4 drinks. and we had to wait for ever for them too.  Very frustrating.   Definitely poor service for the price you pay for drinks.  We had to sit close to people on their cell phones tha were a bit unfriendly and had as much attitude as the staff.   Plus, there was no complimentary parking unless you wanted to pay a hefty price.  Just not worth seeing no name,  and second rate entertainers to perform. Save your money.  I can't imagine what the drag shows are all about?  But I see they advertise them.  If I was gay,  I would rather probably stick to a gay venue.  Paying that much for drag....would be a drag!",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Tom S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1471996800000,
        "ReviewContent": "I just realized that I never reviewed one of our favorite venues in SF. For some reason, even after almost a dozen visits through the years, every time I'm there, I look around and remember how much I love this room and what a quality experience they deliver.What's not to love?  As others have remarked, there practically is no bad seat in the room. Service is swift, unobtrusive, professional and friendly. The sound is perfect and they draw top talent from Broadway and beyond. (I will FOREVER treasure seeing Chita Rivera perform inches from my table.)Price? Well, it ain't cheap, but it IS reasonable. The ticket prices vary by performer, but generally fall between $50-100. There are two areas in the room. Close-up and not-quite. It's a small room so even the \"cheap seats\" get a good view. There are frequently excellent discounts via Goldstar and other providers for the lower-priced seats. In addition to the admission charge, there is a $20 minimum per person (traditional for cabaret venues - previously, the standard was two drinks). We usually arrive early and eat there. The small menu is delicious and is a pretty good value. (For instance I recently had a kobe beef burger and fries that was actually a bit too big and juicy - those are small tables - for $16). Considering we're talking about 5 star SF hotel prices, that rates as cheap!  Of course, if you want to spend your minimum on drinks, two of 'em will take care of it. If you eat at the excellent Anzu Restaurant upstairs beforehand, and notify the staff, you'll have front row seats reserved for you. (You'll still need to spend $20 on after dinner drinks or dessert, though)Really, just an excellent place. I loved the old Plush Room and the Rrazz Room which used to occupy this space. However, it's only gotten better under the artful management of Michael Feinstein and his staff at the Nikko.A very well deserved five stars.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Mark K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1463529600000,
        "ReviewContent": "Beautiful and intimate venue in Hotel Nikko- they don't make them like this anymore. We've been to four shows and every performer has been excellent.  Food& drinks are on the expensive side, but we see it as a subsidy for the wonderful atmosphere and great service.  A date spot that will impress.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Michael L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1459296000000,
        "ReviewContent": "Love to come here for some pretty good entertainment.Fairly recently went to hear Jonathan Poretz. Great show with wonderfulFrank Sinatra songs.  Most enjoyable!.Food served is from the Hotel Nikko....was fair. Cocktails were good.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Restaurant L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1437609600000,
        "ReviewContent": "What a gem this place is! An intimate venue where there's \"not a bad seat in the house\". My husband and I saw Rita Rudner do her stand-up comedy act here on July 17, 2015. Rita was wonderful and it was especially nice to be up-close-and-personal with her. The table service was excellent. We'll be back!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Paula H.\", \"AuthorLocation\": \"San Diego, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1436486400000,
        "ReviewContent": "Nice showroom - sleazy practiceI don't like that the tip is included yet the bill still has a place for the tip.  In the dark lighting of a showroom who is going to be able to see on the bill that it is included.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Tony V.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1428364800000,
        "ReviewContent": "it's a very nice cabaret-style place, intimate environment, and a wonderful roster of performers. the food is good, the drink menu is ok.  management should do a better job controlling their rowdy audience as it ruins the experience for others.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"vida m.\", \"AuthorLocation\": \"Santa Clara, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1424390400000,
        "ReviewContent": "First and last time at this place. There is a $20  MINIMUM CHARGE per person on top of the ticket price. We forgot about it having bought the tickets a month in advance. We had already eaten and ended up ordering take out to comply with the rule. The concert only lasted one hour and servers were moving around during the last song to get the checks settled before the end. I found it annoying and rude.The room is cold and cramped and I kept having to move my chair to make room for people walking through.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Elena M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1423353600000,
        "ReviewContent": "Definitely will be my very last time at Feinsteins.  You have to at least carry 2 bills aside from what you paid for your tickets.  My husband and I saw Wayne Brady tonight who put on a very short show.  We spent $100+ at Anzu's for dinner assuming that we wouldn't have to pay the $20 per person fee at Feinsteins but low and behold they still told us we had to order.  I was pissed.  And what little did that parking validation...discount my butt, I still had to spend another $32.50 there.  This place is a rip off and they won't be getting my business anymore.  I'm broke.  That $32.50 alone I could have used for groceries.  You gotta have bank to go to this place.  Really pissed right now how many times I had to dip into my wallet tonight!  Hopefully, they won't delete my review, and if so at least I know management knows my feelings.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Terry S.\", \"AuthorLocation\": \"Daly City, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1422748800000,
        "ReviewContent": "I had such a blast seeing an old friend perform the other night at Feinstein's at the Nikko Hotel. This was the first time I had heard of or visited the venue. I would return, but think I would dine elsewhere, rather than in the theater. I was obligated to spend a 20 dollar food and beverage minimum with my ticket purchase, but I should have eaten before the show and just ordered cocktails. The drinks were excellent. The soup and beef entree were cold, and the portions very small. For one person spending over $85, I would expect a bit more in quantity, and in quality. The show was fun. I loved seeing the group perform in an intimate caberet setting. I would definitely return, but would dine elsewhere first. This venue is great for more of a cocktail-only crowd looking for some entertainment.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Colleen T.\", \"AuthorLocation\": \"Orlando, FL\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1422144000000,
        "ReviewContent": "I was here a few months back to see Jeremy Jordan perform his solo show. We were kindly greeted at the door and we were then taken to our seats. I had bought tickets for my mother and I and I chose to do the premium seats. One little tip if it is your first time here, make sure you get their early. The earlier you get there, the better the seat you seem to get is. Once seated we were greeted by out waiter who was very kind. We ordered a few alcoholic beverages and some appetizers. There is a $20 minimum for food which you must use while you are there. Once our drinks arrived the show began. The setting made the show feel very intimate as the room is not huge so any show there will feel very personal which I really enjoyed. The food was also great and the drinks were, to me, amazing. All in all I was really impressed with both the show and the venue. The service was great and while we were leaving the people at the lobby desk said goodbye to us. I am seeing Billy Porter there on Sunday and I am looking forward to it.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Leilani H.\", \"AuthorLocation\": \"Pacifica, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1420070400000,
        "ReviewContent": "I was just here last night for the 10:30 John Lloyd Young concert. The Nikko itself is pretty nice and the Kanpai Lounge just outside feinsteins is chic. As for Feinsteins: the venue is a throw back to classic dinner club. Tiered seating, cozy tables, low lighting, but it's still got a sleek modern look. Overall, I was very pleased with it aesthetically. However with several of us up against the side wall, you get friendly with other parties. It's not a bad thing if you're among good company and everybody is nice and having a good time but being so close knit you will hear all the surrounding drama. Unfortunately there were a number of misunderstandings in the evening: the kitchen closed right as this performance's crowd was seated leading, understandably, to unhappy patrons. But seriously, you're only going to serve alcohol and desserts on NYE (without notice!) to hungry customers looking for a meal, who have to meet a $35 pp minimum?! Luckily we had an excellent waiter who was helpful, friendly, attentive, prompt, and really contributed to a pleasurable evening. I would've been in an awful mood w/o him. Then there was confusion w/ another party referring to what were premium seats (in case anyone's wondering, it's the bar seating on the 2nd tier). While I'm on the subject of seating let me also say it wasn't fair to the 2nd show crowd that people from the first show got their seats reserved for them for the 2nd show. Meaning that whole \"first come, first served\" thing is pointless. We were 1st in line, waiting in heels for 45 mins, hoping to get to choose our seats. Then we find out that people who bought tix to both shows got their seats saved just because? Luckily I'm happy to report that this is the kind of place that every seat's a good one. In fact, my view from the side wall was actually perfect. So now that I've addressed the two reasons why I rated 4/5 stars: kitchen closed early and seating's unfair, let me tell you why it got those 4.Our waiter, the venue, and of course the entertainment were all part of the high score but also the food. We had the mozzarella flatbread, California roll, crab cakes, and cheesecake to eat. Mmm, the flatbread was fantastic especially the sauce on top! It was my favorite and the cheesecake was also wonderful. I had the strawberry fields cocktail and it was pretty good. Bonus points for the yummy champagne. Sadly though, the entertainment was concluded about 10 mins before midnight, kinda anticlimactic for NYE.  On the bright side, the crowd remaining in the room celebrated together w/ singing and toasting. So to conclude, I would come back to feinsteins based on the venue and that flatbread but I find their kitchen, seating, and entertainment timing policies unsatisfactory. Nonetheless I had a nice night thanks to my waiter and the good company I was in w/ other tables.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Lauren A.\", \"AuthorLocation\": \"Tracy, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1418601600000,
        "ReviewContent": "the good review is about the entertainment.  as a cabaret feinstein's is great.  the problem is the food.  i strongly suggest that if you want to eat, do so before the show, someplace else. to begin with the tables are too small for dining, great for drinks but you do a balancing act trying to keep your dishes on the table when shared with someone else.  then there is the food, tasteless and very small portions, the wasabi was the only thing on the table that had any flavor.  i tried the bento box and what a waste.  the soup, a pure of cannelini was without any flavor, served lukewarm.  the macadamia crusted salmon was cold and raw.  not raw like seared ahi or sashimi, barely warm on the outside with a green paste on it and what looked like burned chopped something underneath that was difficult to eat and a few cold baby vegetables.  and the two pieces of sushi? they tasted like they were from an all you can eat buffet in stockton.  in fact, i have had better food at such places and did not have to pay $24.00.  my friend had the caesar salad, a big wedge of romaine, a little pile of grated cheese, and a sauce boat of dressing with a little bowl of croutons.  she had a problem trying to cut it into manageable pieces, especially given the size of the table.  her risotto was ok.  while other servers seemed nice, ours was rather surly, just frosting on the cake as far as i am concerned.  i will go back for the entertainment but i will eat someplace else or afterward, certainly not there.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Roger R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1417046400000,
        "ReviewContent": "I went to see Telly Leung from \"Glee\" and many other shows at Feinstein's, and it was most enjoyable!  The check-in guy was super friendly and helpful, and we got nice seats all together in a corner facing the stage.  They have a $20 food/drink minimum which is not a problem as they have good food selection (remind me to get the cheesecake next time!) and a nice drink/wine list as well.  I got a small carafe of cab, and that suited me just fine as I sipped and enjoyed throughout the show.  Acoustics were good and the size of Feinstein's is intimate to see and hear your artist of choice.  Wonderful job, Telly!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Maile N.\", \"AuthorLocation\": \"Honolulu, HI\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1415923200000,
        "ReviewContent": "Went here last Friday night to hear Laura Benanti.  We've been to Feinstein's many, many times - to hear the man himself as well as countless other entertainers.  Love the intimacy of the room and the quality of the acts for the most part is good to great.  Think Laura has an amazing voice and a wonderful rapport with the audience but her song choices were just odd.  Don't know another word for it.  Still an enjoyable evening but like many others, we were put off by:- $20 minimum/person ON TOP of the ticket price.  A little greedy Feinstein's. Your best bet is to skip dinner or have a light dinner and enjoy your food here.  The food is delicious (though the tables are obviously small) but would much rather order because we want to, not because we're trying to spend $40.- HUGELY disappointed when Laura said \"We're almost out of time, our hour is about up . . . \".  What???  Performances are now limited to just 60 minutes?  At these ticket prices?  Who made that rule?  There's no second show.  There's no pricing adjustment for such a quick set.  Lots of tables were still eating/drinking when the show was over.  In our opinion, that's the biggest negative.Unless Billy Porter or Kelli O'Hara or Sutton Foster decide to perform at Feinstein's, we won't be coming back.  Not worth the premium price for 60 minutes of entertainment.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Sarah A.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1414454400000,
        "ReviewContent": "Bought tixs to see Tim Hockenberry 11/26/14. This show was cancelled but was kindly informed that tixs were still available for the Saturday show. We rearranged our schedule & contacted Mitchell who was to be the point of contact per e-mail. Mitchell was out of the office for 4 days. So we talked to William to change nights. I did ask William to waiver the 2 drink requirement for the time & trouble of rescheduling our other commitments & our dinner reservations there at Hotel Nikko. He said he would ask Mitchell. Seemed strange for such a small request. He later called & said no, Mitchell would not do this. The pettiness really bothered me so I cancelled the show, dinner & hotel reservations (all at Hotel Nikko.)  He said he could not cancel hotel res. but would transfer me to that desk. Not surprising he transferred me to the restaurant. Called back & spoke to the very kind front desk manager to cancel hotel res. Sorry forgot her name but she was very nice about getting us a room last minute (& later cancelling.) I figured we wisely saved ourselves about $800. by missing this event. It felt good not to give this establishment our money. Mr. Hockenberry, we hope to catch you at another venue.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Dori B.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1411948800000,
        "ReviewContent": "We saw Frenchie Davis at Feinstein's last night after dinner at Anzu. Love the intimate cozy feel of the venue. Sound was amazing. Drinks were good also. There is $20 minimum that includes some bites also. If you dine at Anzu, you get to pick your seat first and reserved I think 1st to second row. Very good!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Vol T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1411603200000,
        "ReviewContent": "Eloise had The Palace.  Michael Feinstein has this place.  As outsized as Eloise's Palace is, Feinstein's is just the opposite.  Tucked away inside the Nikko Hotel, it's wee in scale (140 seats) with nary a bad seat in the house.  I've heard some remark that they actually sat too close to the performers on stage and I can see where this might be possible.  I sat at a small center table in the second row and could probably have leaned over and fondled Fred Willard's foot.  Who wouldn't want that?    Tickets to shows at Feinstein's come with a requirement to spend an additional $20 per person for food and drink.  Again, this isn't a bad thing.  All of the food comes from the on-site restaurant ANZU and much of it falls in that sweet $15 and under spot.  Add a drink (cocktails $14, beer $6.50) and you easily satisfy the requirement.  A Crunchy Asian Garden Salad ($10), a shared Margarita Flatbread ($12), and a couple small carafes of BR Cohn Silver Label Cab ($30 each, about 3 glasses per carafe) were the perfect accompaniment when watching Laraine Newman channel her inner Cher in a performance of Celebrity Autobiography.  Food and drink can be ordered and served throughout the show but out of respect for performers and patrons, best to get the party started early (doors open 90 minutes before showtime).An added benefit of this intimate venue is the likelihood that the performers might be present in the bar area (just outside the venue) post-performance.  While not guaranteed, interacting and getting photos taken with the performers you came to see is a possible perk that elevates this venue to the top of the heap.  Additional info:THE VENUE -*  Technically, this is a partnership between the Nikko Hotel and Michael Feinstein.  *  THE ACTS - *  Michael Feinstein is a highly regarded singer, Emmy and Grammy nominated, with cabaret origins.  Much of what is booked here (though not all) falls into the \"cabaret\" genre.  *  If you're a pop culture junkie who loves a good laugh don't miss Celebrity Autobiography, the show I saw here.  It plays all over the place ; get on their mailing list at celebrityautobiography.com.  *  Discounted tickets to performances here can often be found on goldstar.com.  THE ADDITIONAL $20 PER PERSON - *  The $20 per person food/drink requirement isn't unusual for a nightclub; Yoshi's has a similar requirement accompanying its ticket purchases.  PARKING - *  There's a pay parking lot across the street from the hotel which will run you about $15.  *  A better deal - and not a bad walk - can be had at the Sutter-Stockton garage.  On a Sunday evening my parking bill there was a mere $4.  *  If you choose to park at the Nikko Hotel, know that ticket holders get 1 free hour of hotel parking.   *  Easy accessibility from Bart.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Tracey A.\", \"AuthorLocation\": \"Marin County, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1407456000000,
        "ReviewContent": "We came here to watch Megan Mullally, love her!!!We got one of those groupon things so we got seated on the side. Still a good spot. Food was delish but tiny. Drinks? Can't even remember them.Atmosphere was great. It's very intimate with the performer. We were pretty close. Minus one star for the snooty person using language that offends. He basically said along the lines that we are in the cheap seats and that we weren't allowed to move.There are better choice words to let us know this without insulting us.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Cuti E.\", \"AuthorLocation\": \"Emeryville, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1401580800000,
        "ReviewContent": "This place is a gem!  Excellent service -props to the Maitre D' William and the hostess who were efficient and helpful.  The food is great here.   I ordered the Feinstein's Bento box - with 3 appetizers and a choice of entrees.  I chose the Beef Onglet and it was fantastic!  My parents ordered crab cakes and they really enjoyed that too.  Great mixed drinks!  The $20/person minimum was well spent!  And the music - awesome!   It's classy, intimate and fun.  This is a beautiful place for a date night or to impress guests!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Perla N.\", \"AuthorLocation\": \"Palo Alto, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1398384000000,
        "ReviewContent": "A bit pricey but a nice, clean venue with professional staff and quality events.  The Wasabi Prawns were spicy and tasty, even though there was more sauce than I prefer. Ordered that twice!  The Lettuce Cups tasted bland after that, silly us.  The Chipotle Cabaret is a great cocktail (went lighter on the lime juice).",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"a l.\", \"AuthorLocation\": \"Clements, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1395014400000,
        "ReviewContent": "Came here for my boyfriend's mom's birthday. We attended the Sunday 7pm show where Cheyenne Jackson was performing.  I had no idea who this guy was, nor was I aware of where it was going to be at...so I had no expectations.  We got there 40 minutes before the show.  There was no line, we got seated quickly, and the waitress came to take our order.   The issue with this venue is that you are required to spend at least $20/person if you bought the Groupon ticket.   There were 4 of us, so that was $80 dollars gone right when we walked in the door. I'm very blessed that I didn't have to pay thanks to my boyfriend's dad.  I'd pays to be aware of that!  But yes, anyways.  Where was I? Oh jes, food.  They make it easy to spend your $20 quota on food and alcohol!  Everything is pretty much $10 and up for appetizer sized food so don't come here hungry / cheap.  I ordered the California roll and the rest of our group got the short ribs, Japanese fries (still unsure what was Japanese about them...), and chicken eggrolls.  The CA roll was unimpressive, but then again, it was just a CA roll.  They give you six pieces.  The short ribs order came with 4 ribs and from what I heard (I don't eat pork), they were delicious, filling, and probably the only thing filling on the menu.  I can't attest to this but I'd believe it.  It smelled good.  The eggrolls order only came with three measly eggrolls.  It seemed kind of ridiculous for the cost, but ohhhhhwelllllllll.  I didn't try them, but I'd imagine it might be hard to mess them up.  To fulfill the rest of my $20, I decided to order a drink.  My boyfriend's mom got the pineapple express and I got the strawberry fields.  I didn't try hers, but mine was delicious!  It's probably the only cocktail I've actually ever liked in my 2 years of legal drinking (:p).  It tasted like a light strawberry lime juice with a background flavor of booze.  It was great because it wasn't too sweet and the alcohol wasn't overpowering.  This drink is a winner.  I'd get it again.  It's too bad it doesn't come in a pitcher size. Just kidding. Kind of.Now to briefly talk about the venue.  I actually really enjoyed it.  It was definitely a more intimate setting; we were sitting 4 rows behind, and I think there were only 2 more rows behind us.  The sound was good, the lighting was good.  I have no complaints about the venue itself.  And Cheyenne was great! He seemed like a very personable, funny guy with a great voice.  I'm glad I got to hear him even though I had no idea who he is when I walked in there.Overall, I had a wonderful experience.  Watching small shows here isn't a cheap regular thing to do, but it's definitely great to attend once in a while or for special occasions.   I'd come back!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Vivian L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1394323200000,
        "ReviewContent": "This venue is small, nice atmosphere and good music.but...I think that they do not want you to return..because of their attitude towards the customer. Bought  two tickets at Goldstar to watch Paula West at the Feinstein. I was in a hurry to order tickets, and did not notice the fact that, before clicking to approve tickets order, it is noted in the bottom of the page, that in addition to ticket price, you MUST also spend $ 20 + 18% gratuity + tax for every guest present at the show.So, after having dinner at the Nikko's Japanese restaurant ( before the show) , we were forced to pay the above sum, even though we did not order up to that amount. So our check,for   6 people, total of $ 153.99, includes  $ 36 for \" showroom minimum\" , which actually means \" $ 36 for nothing \".It is not the money..it is the principal......I am not going back there. Going to Yoshi's instead.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Ari S.\", \"AuthorLocation\": \"Fremont, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1393718400000,
        "ReviewContent": "I love how small and intimate this place is. I saw Paula West last night and she was incredible. What I do not like is that there is a min $20 food/beverage charge with 18% gratuity and a cocktail is $14. 4 drinks totaled $56 :(",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Magda G.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1393200000000,
        "ReviewContent": "Impressed with this venue - intimate, good acoustics, and you can reach out and touch the performers, they are that close. Seating is not cramped with good sight lines for all seats from what I could tell. Actually, I think the seats in the very front are too close. Service was fine except waited for almost an hour for a coffee and cup of tea that finally came 5 minutes before showtime. I'm not giving it 5 stars because it's pricey. The $20 food/drink minimum is too high for the choices and portion size, then add 18% and cost of tickets and you're looking at a lot of money for only an hour-15 minute show. The highlight definitely, was the fabulous Paula West! And the musicians! I'd say come here for a very special performer but not for a regular night out.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Helen Y.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1392681600000,
        "ReviewContent": "A nice update for a classy space. Went to hear the amazing Paula West sing there on Valentine's Day and couldn't have been happier by the service or the music. The person who seated us was very pleasant and even suggested to my friend and I that we sit on the bar seats toward the back which a) had a better view and b) gave us more room than sitting at a table. Tickets were reasonable at $35 each (will call) and there is a $20 per person drink minimum once the show began. I had a coffee with various liquors added along with a shot of Maker's Mark. Yummy! They were so busy that it took awhile to have our server take our drink orders, but she was very apologetic and we had great service during the show.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"David G.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1387152000000,
        "ReviewContent": "Very nice venue....you can sit anywhere and be fine, so don't think you have to pay for the \"front of house\" tickets. While I'm not a fan of imposed drink/food minimums, I get it......and I will say that the drink I was having was not horribly priced.....the coffee with two kinds of alcohol. Very enjoyable and I think $7. So I could have 3 and fulfill my minimum :-)",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Laurie H.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1386374400000,
        "ReviewContent": "So excited that there is a small, intimate venue for great musical talent. Just saw the amazing Betty Buckley. Tickets w/seats \"up front\" --$80 pp plus the usual service charge for the tickets.then tack on the $20pp minimum for food or drinks and as they say repeatedly on the website \"for your convenience\" they have decided the gratuity will be 18 percent. For goodness sake, I'm a big person and I can decide what I choose to tip based on  the level of service. Loved the show but again it was an hour and 15 minutes, max. Somehow feel a bit gyped.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Jane V.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1385856000000,
        "ReviewContent": "I went here to see Tony DeSare back in October, and I couldn't have been more pleased with the venue. It was small and intimate, and the seats were all arranged for a good view of the stage. Seating was first-come, first-served (unless you ate at the restaurant upstairs, which allowed you to reserve a seat earlier), but arriving when the doors opened (about an hour before the show) allowed us to get a great seat right in front.  It was a great view of Tony DeSare's impressive piano technique (which involved reaching inside the piano at times). I can honestly say I've never been to a serious concert venue that made it so easy to be so close.The food and drinks were great, with very reasonable prices and a surprising amount of selection given that it was mostly just appetizers and desserts. There were at least 4-5 options on the menu that were suitable for vegetarians, and I think one of the dishes was either vegan or very close to it. If that's important to you, definitely call ahead to verify. The staff was friendly, and I didn't feel like there were any surprises in terms of fees/food minimums. It was made very clear on the ticketing website that there was a $20 minimum per person, which is reasonable even if you don't drink alcohol. In terms of sound, Feinstein's was perfect. There were curtains and low ceilings and you didn't get that annoying echo some places have. It was cozy, intimate, and everything was performed at the perfect volume. I would definitely go back if someone else I wanted to see was performing there.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Stefanie H.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1382313600000,
        "ReviewContent": "A drastically different experience from a few months ago. I was so impressed with this place when we came in May; I could hardly believe I was in the same place. The service at our pre-show dinner upstairs was mediocre at best. The waiter forgot the last course of our pre-fixe meal and served up our check instead. Oh, and apparently our tickets don't include the $30 food and drink credit they used to, so our bill was $200. Then our bill downstairs during the show was another $100 because, as the very snippy waitress said as she snatched up my card, \"there's a $20 minimum like I told you more than once.\" which is silly if you're a non-drinker who isn't thrilled at the idea of paying again for a dessert you'd already paid for upstairs.Keep your divas, even Linda Eder couldn't out diva our rude waitress. I won't be back here. Next time I'll sit in the lobby and listen quite contentedly.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Ty A.\", \"AuthorLocation\": \"Seattle, WA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1381017600000,
        "ReviewContent": "I wish I liked this place better because I love listening to great music in small intimate venues. On our recent visit, the music was excellent, but the seats we were given were much worse than expected even though we were among the first to arrive. Better seating is given to those dining at Anzu. Because I am not a fan of Anzu, I had a bad seat and ate from the mediocre and crazy overpriced for super small portions bar menu. In the end, the great musical performance did not compensate for the uncomfortable vibe. I will not be going back, but If you go, make sure you understand how not to be stuck at a bad seat, eat before you go, and only go for the music.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Ed C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1381017600000,
        "ReviewContent": "Went to see Oleta Adams at Feinsteins last night.  First time there.  Let's start with ambiance.  Dark somber room (I guess this is supposed to be elegance?)  No art on the walls, just a dark curtain as a backdrop and the stage.  The space is definitely small and intimate.  Fits maybe 100 people.  Service was great.  Hostess was very friendly.  So was waitress.  Menu:  Here's the catch.  On top of the cover charge, there is a $20 minimum food and beverage charge.  So, you have to order food and/or drinks.Drinks: LOTS of drinks to choose from.  Specialty drinks, fine wines, beers etc.  Wines range from about $9 a glass to about $375 a glass and everything in between.  (Can get bottles too.) Specialty drinks are about $13, beers are $6.  So for drinkers, lots of choice.  Also, tea and coffee.  My wife and I don't drink so we can't comment on the drinks other than what we saw on the menu.  Food:  They have some variety.  We calculated $40 worth of food and ordered accordingly.  For $40 we got:  A Margherite Pizza (wife liked it).  An olive plate (nice mix of olives, quite a few), Cheese plate with 4 types of cheese, some crackers and apple slices and Pork Ribs.  The pork ribs were not exciting because the sauce was not very good.  But the cheese was tasty as were the olives.  By the way, Oleta Adams was great.  Definitely a class act.  She gets 4 stars.  So, why only 3 stars to the venue?  Well, mostly because it's pricey.  We got our tickets through goldstar so we only paid a little over 1/2 price.  So tickets for 2 were $60.  Then there's the $40 minimum.  They include an 18% gratuity automatically (not too fond of that move - although we always tip in the 15-20% range anyways if the service is good. Just like to have the option to not tip as well if the service is lacking - which it wasn't).  So total food bill with gratuity and tax turned out to be about $52.   Total for the night for 2 people was $92 dollars.  That's more than we usually spend but, what the hell, once in a while you have to splurge a little.  If there's an artist that you really want to see, then it's worth it.  Too expensive for a casual hang out unless you're rolling in dough.  The sound in the place was great.  I noticed there's a lot of cabaret type acts that play there so if that's you're thing and you can afford it, you might just love the place.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"X Y.\", \"AuthorLocation\": \"Castro Valley, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1380931200000,
        "ReviewContent": "Great spot in the City. Intimate room. I've been a couple of times since it became Feinstein's. Sutton Foster was terrific, and at 85, Barbara Cook was also amazing. I'm really looking forward to Linda Eder.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Steven M.\", \"AuthorLocation\": \"Financial District, San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1378771200000,
        "ReviewContent": "This is a great venue with a great atmosphere!Go check it out! =)",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"April R.\", \"AuthorLocation\": \"San Francisco Bay Area, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1378425600000,
        "ReviewContent": "Such a small space, used to be the Rrazz Room, great venue. We've been here twice since rebranding, last night Christine Ebersole, a great performer. Service is haphazard, drinks a little light, desserts a little heavy. Under no circumstance should you let them seat you at Table 49. This is the worst table in the room. You will have lights glaring in your eyes, and a lousy view. Come for the show. Enjoy!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"William M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1377907200000,
        "ReviewContent": "What an amazing venue. The space is incredibly intimate and the service is excellent. I went with a small group and sat very close to the stage. The sound, atmosphere and ambiance are premier and the drinks are exceptional. I honestly can't think of one thing these folks do wrong. I plan to return for date night.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Isaac C.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1377648000000,
        "ReviewContent": "Love the space they have here. They make you feel like a pimp in the zone.  The performers are in your lap and it feels like they might be in your living room. It set me back a few bucks but it was totally worth the dollars. you gotta spend it to make it ho!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Dru P.\", \"AuthorLocation\": \"Lafayette, IN\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1377648000000,
        "ReviewContent": "I love this place. It's a rare treat in the city to be able to have such an intimate setting for a show. I saw modern day TorchSinger Spencer Day there a few months ago, and it was a great performance. Literally not a bad seat in the house. They have a wide variety of acts coming in, with a specific focus on Broadway performers, contemporary musicians and fans of the Great American Songbook. The service was really attentive, and I really enjoyed my dinner from the upstairs restaurant, Anzu. The ceviche was some of the best I've had, my only complaint is that there wasn't more of it on my plate. Before the show we sat in their lounge area called and had some delicious happy hour food. The wings are delicious. Really. For me, being able to see musicians and performers in an intimate, classy setting-- is well worth the extra loot spent.  I'll be back!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Krista N.\", \"AuthorLocation\": \"San Pedro, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1376956800000,
        "ReviewContent": "Excellent venue with first class performances. Perfect social spaces, amazing for date nights and celebrations. Good to go.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Christopher L.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1371254400000,
        "ReviewContent": "Expensive.  Additional charges are $8.25 per ticket and 18% gratuity and sales tax.  All in all a very expensive evening.  Why not go to a Broadway show or a show at ACT or Berkeley Rep?Must better value for your money.  I will not return.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Richard H.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1369699200000,
        "ReviewContent": "As a long time attendee of the Rrazz Room, I am very happy Michael Feinstein took control of this wonderful space and that it did not sit empty for long, especially with the closing of the Rrazz Room soon after their move.  Feinstein's has made some wonderful cosmetic improvements with the outside bar and entrance area.  The black curtain replacing the white curtain across the back of the stage is a nice cosmetic improvement as well.  Don't let the higher ticket prices get you down...while it seems shocking at first, each ticket comes with a $30 Anzu or showroom credit.  I don't find the menu prices have increased at all, and like that I've all ready put $30 per ticket towards my bill.  Feinstein's doesn't pack the room the way the previous occupants did.  We've been to Feinstien's twice now, and commented that four of us were comfortably seated in a space that would have been cramped in the past.  The seats were perfect...until the two tall guys came alone five minutes before the show started and completely blocked my view for the entire show....it's definitely worth paying the extra $10 per person to not have that happen. Additionally, it appears the staff have been trained to be less intrusive during the show.  While the staff used to flutter about constantly, doing their jobs, often now I see a flood of staff come through in between songs, being less obtrusive to both the patrons and performers.  I noticed this great change immediately!  I'm also pleased to find they've employed some of the previous venue's wait staff.The only reason I did not give this five stars is that I was a club member of the Rrazz, and always had the same perfect seats at every show, and didn't have to fight the crowd for a seat, so I guess I'm a little spoiled in this space.  I hope Feinstein's will offer up something like that very soon.  You can reserve your seat if you eat at Anzu's first....but their menu has never been appealing to us  in all the years we've been attending shows at the hotel.This is my favorite venue to see a show. Period.  The space is intimate, the sound is fantastic and 99% of the time performers sign autographs and pose for photographs afterwards.  Thank you Feinstein's for keeping the wonderful nightclub tradition alive in San Francisco, I was really feeling lost without it!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Steele C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1369440000000,
        "ReviewContent": "Great management now for this nightclub. Feinstein's is a welcome change from the Rrazz Room, where only the gay male couples got decent seats and the rest of us got the leftovers. Rude managers/owners came west and brought their nastiness with them (giving the nice people from New Jersey a very bad name). Last time I was at Rrazz Room, they sat me so far over to the side that I could see the back of the performer's head. Right before the show started, they put up a Big Amplifier Box right in front of me and then I couldn't even see the back of the performer's head. Too late to make a scene because show was starting, so I waited until afterward and talked to one of the Jersey boys -- he couldn't have been ruder and completely blew me off. Then the Nikko blew Jersey off (who's got the rrazz now?) and Feinstein's came in. Different demographics scattered throughout the club, not crammed in like sardines as we were when Rrazz ruled, and respect for their paying guests. Enjoyed Spencer Day tonight (he'll be there 5/25 too)... a modern day torch singer who's very talented and clever. Thanks Feinstein's for making this into a great nightclub, just what we needed in SF.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Cydney B.\", \"AuthorLocation\": \"Vancouver, WA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1369353600000,
        "ReviewContent": "I really wanted to give Feinstein's five stars, and hopefully will as they iron out the kinks in their new location.  It looks gorgeous, simpler and yet more elegant than The Rrazz Room did.  It is expensive and there are a lot of charges first time visitors may be surprised by, but service was good, sight lines were not.  All tickets come with a $30.00 food/beverage credit which is a smooth move.  The staff seemed eager to provide a great experience and although struggling with a lot of tables, our server was excellent.  One note that was troubling and disconcerting was a  handful of customers who were overserved and interrupted the show with loud, bellicose comments to the performer.  It was funny a few times, but it got obnoxious quickly and no one seemed willing or able to quiet the guys.  Sound was good, lighting a great improvement, food was small portioned but tasty and our table was too small for the food and beverage we ordered, so thank God we were seated early enough that we could 'borrow' the empty table next to us.  The banquet we sat on was very uncomfortable and our backs were in agony by the time the show was over.  One commonly expressed complaint we heard is the way the front of house staff tell everyone that asks for better seating that the room is 'sold out' and changes can't be made.  After hearing that a dozen or more times, the people loudest got moved while several tables weren't even used and others had quite a few empty seats.  I've owned and operated a lot of restaurants and clubs and I know the value of good seating, but I truly believe one of the things that killed The Rrazz Room was their handling of guest seating.  I hope Feinstein's works through these tiny glitches and becomes the great and elegant nightclub San Francisco deserves.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Stu S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1368489600000,
        "ReviewContent": "Went to the club last Sat. night to see Sutton Foster and had a delightful time. I was not already a fan and now am.     The club looks beautiful and was comfortable with good sight lines. An intimate nightclub for sure. I have many times spent more money at larger venues only to be seated far away. I don't think that is even possible here. I was impressed with the level of service from the staff. They do really seem to be working as a team.   I will be back soon!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"D. S.\", \"AuthorLocation\": \"Fairfax, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1368403200000,
        "ReviewContent": "Great space. Great service. Great performance. So what gives, Feinstein's? Why are you trying to steal my money?We paid 18% gratuity to order tickets online. Then we paid another 18% gratuity for the service. The \"front row\" seats ($95/each) that we bought came with $30 credit for food and drink, but apparently gratuity and tax is levied separately. One other caution: there is a bottle of Dom Pérignon misprinted on the menu at $30. It is $30 for a glass, not a bottle, duh.(*Update - since writing this, Feinstein's sent an email saying they \"heard us.\" Now every guest must spend a $20 minimum on food and drink. Um. This is better how?)Getting seated was a mess. We came an 1 1/2 hours early because that's when we were told doors would open. The hostess told us they'd start seating in about 15 minutes, which was fine, and we stood over to the side. Fifteen minutes later, when they opened, some other couple had come to check in. Instead of saying something like, \"oh, this couple was here before you,\" the hostess just sat them before us!I came here to see Sutton Foster, who I've been obsessed with for a few years now. She did not disappoint. Neither did the space. It felt a lot like Sutton Foster came to your living room to perform. We still got a booth seat on the floor, and Sutton was amazing. She even hung around afterward in the hotel bar. It really doesn't look like there's a bad seat in the house, but I'd advise against the cheap seats. I think in a full house -- which ours was not -- the number of heads might make it hard to see the performer. There is also only a $20 difference between the worst and best seats in the theater.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"David S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1368316800000,
        "ReviewContent": "Cozy venue, I don't think there are any bad seats in the house.  It's not cheap, but with acts like Sutton Foster I didn't expect it to be a discount show. They have a wide selection of drinks and reduced menu from the restaurant Anzu upstairs, many of the portions aren't very large but they are satisfying. Service tries to keep quite during the performance and do a good job. The seats are fairly comfortable, that's am important thing to me.I like the piano bar just outside, it gives you a great place to hang out when you wait.  If you go for good seats be sure to check in at 5:30~5:45p (for the 8pm show) and reserve a table.I've added myself to their mailing list, I'm going to keep an eye on upcoming shows. If the right act comes back, I'll be there.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Sean S.\", \"AuthorLocation\": \"San Ramon, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    },
    {
        "ReviewDate": 1368230400000,
        "ReviewContent": "Very expensive compared to the Rrazz Room.  Ordered  food and it came cold.  Sent it back and it still came cold so we just ate it.Have to figure $100+ per person to see a show.  The show was 65 minutes.  Won't be returning.Poor value for the money.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Feinstein's at the Nikko\", \"AuthorName\": \"Robert K.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "Feinsteins at the Nikko",
        "venue_id": 17
    }
]