[
    {
        "ReviewDate": 1713052800000,
        "ReviewContent": "I recently went to the Freight & Salvage Coffeehouse with my beloved to see Jai Uttal & friends. Freight & Salvage is a non-profit and a lot volunteers help run it. All in all great organization and a nice small intimate venue to see music. Me and my beloved really enjoyed the kirtan and performance. Great evening. We will return.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Shane S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1707868800000,
        "ReviewContent": "it's the place to go for the kinda music i wanna hear.  an auditorium though, not a club. You can buy limited food and drink.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Quentin C.\", \"AuthorLocation\": \"Novato, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1702598400000,
        "ReviewContent": "Came here for a moth taping and this venue was great! The acoustics were excellent - we could clearly hear everyone. It fit a lot of people but didn't feel overwhelming. Everyone staffing the event were very nice and everything was labeled clearly so it made navigating the venue extremely easy. During intermission, everyone crowded to restrooms, fortunately, the venue has gender neutral bathrooms (and not single stalls either!) on the upstairs area that were clearly labeled and easy to get to.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Anna S.\", \"AuthorLocation\": \"Seattle, WA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1702252800000,
        "ReviewContent": "Love the music, but always hate the chairs. They just don't match my body and I am always uncomfortable. I typically will stand for a good portion of a show.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Bart F.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1700524800000,
        "ReviewContent": "Performed at the most welcoming open mic. Beautiful space. Lovely people. You can feel the room is alive with music and discovery.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"M J.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1699056000000,
        "ReviewContent": "Had to update my review to RAVE about acts I've heard in the past month or so- Graham Nash, Andy Falco & Travis Book (of Incredible String Dusters), PAT METHENY (last night!)- so incredible!!! Absolutely stunning performances in equally stunning (and friendly welcoming) Berkeley venue. Intimate yet world class. That sums up Berkeley to me. We get to have this!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Lin B.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1699056000000,
        "ReviewContent": "I love the homy atmosphere and the cute concession stand. East talk to others too and great talent!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Bay C.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1699056000000,
        "ReviewContent": "First time here.It's easy to find and has top talent like Pat Metheny.Fine acoustics. Easy to navigate inside.Decor: ok and clean.A mini deli has very good prices and wine/beer. Sandwiches are just $6.00 I did not partake.Customer service: excellent and helpful.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Bert K.\", \"AuthorLocation\": \"Mountain View, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1692144000000,
        "ReviewContent": "We love it!Great food, coffee, drinks while experiencing such wonderful music and shows. Thank you for being there, and staying there, F and S!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jan W.\", \"AuthorLocation\": \"Santa Cruz, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1691539200000,
        "ReviewContent": "Fantastic venue.  Not a bad seat in the house, great sound, staff was very nice, bathrooms were spotless and parking at the garage right next door was easy and affordable.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Shanna K.\", \"AuthorLocation\": \"San Mateo, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1691366400000,
        "ReviewContent": "Ticket fees are up there.  Staff was bossy but no one really took responsibility for anything. The venue's acoustics are worthy of bumping it up to two stars but not much more.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Juan J.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1689292800000,
        "ReviewContent": "If you you are in need of proof of life after 80, go see Graham Nash at your first opporutnity. His voice was so close to the octaves he hit with CSNY, that i could scarcely belive my own ears.  I've seen the band many times since 1968, and Graham is the real thing that makes up the heart and soul of musical genius. Last night he filled the hall with storys, acoustic music, electric music and harmonies that are almost as good as the oldend days with Crosby, but reallly, that is impossible to recreate, ever again. Loved the guy as he left us in Berkeley and flew off to Geneva, etc.  I only wish he played Chicago, my pesonal anthemn.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jeffrey N.\", \"AuthorLocation\": \"Tracy, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1689033600000,
        "ReviewContent": "Great venue! Interesting performances. My only regret was lack of concessions for 12 pm performance.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Leslie K.\", \"AuthorLocation\": \"Mendocino, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1683072000000,
        "ReviewContent": "We love Freight & Salvage, the box office customer service is stellar, prompt & helpful.    We live in south bay so we don't get up there as much as we would like but it is a fantastic venue with an eclectic lineup.   The adjacent parking garage is very convenient.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Mr Kitty K.\", \"AuthorLocation\": \"Mountain View, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1677888000000,
        "ReviewContent": "Great venue for musical acts. Not too small but not too large either. Great seats and views from pretty much anywhere. Walking distance to nearby restaurants for post-show eats.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Maggie V.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1671494400000,
        "ReviewContent": "We had such a lovely experience at the Freight & Salvage for Booker T. The sound was perfect in the listening space. There's really not a bad seat in the house, but if you want to sit up front, paying for the premium seating is still very reasonable. Masks are no longer required so drinks are now allowed in the listening space. It was a simply fabulous night.  GREAT music!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Kami T.\", \"AuthorLocation\": \"St. Leo's, San Jose, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1670198400000,
        "ReviewContent": "Mahalo Freight & Salvage, what a beautiful venue you have. No seat is a bad seat. Chairs are so comfortable and not tight, get space. I wanna say Mahalo nui for bringing Hawaiian music here to the bay area Kalani Pe'a, Landezza Ohana, Kumu and her halau and much more. Please continue to reach out and bring more artists from the islands to here.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Rebecca P.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1670112000000,
        "ReviewContent": "Wonderful experience, the place is clean, well-ventilated , and friendly staff. We watched a jazz group that performed well. The only thing is if they can have more food selections in the cafe area, like sandwiches and/ or burgers.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Lizelle C.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1665705600000,
        "ReviewContent": "What a great organization/venue/cause/mission in downtown Berkeley. This non-profit venue is all about world music, folk and music education. They have some sort of programming every day/night: folk nights, Sundays with Bobby McFerrin (the 'Don't Worry Be Happy' singer) to a renowned singer from Mali. I also spied banjo classes and so much more.My experience with F&S has only been for The Moth nights. Approximately once a month they host these storytelling evening where attendees can share their 5 min prepared story on a certain theme. Stories are voted on by selected judges in the audience and one special storyteller walks away a winner. (def look it up if you want to know more). A few things: they still have strict mask policies and they don't allow food or drink in the theater portion (you can consume in the lobby). They do have a parking garage next door although it's a bit pricey.As I have yet to see music, I can't share critique on acoustics, but for The Moth nights, the place can handle a small-medium sized crowd and serves as a great community center!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Stephanie Y.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1664755200000,
        "ReviewContent": "We have been back to the Freight many times over the intervening years for concerts and gatherings.  Alan and I saw Theodore Bikel, Marcia Ball, Pamela Rose's show Blues is a Woman and other shows I don't remember.  When Alisa Clancy retired from KCSM last year her retirement party/concert was here.  More recently there was a memorial concert for Richard Hadlock, a musician and incredible radio host on KCSM.  Nina and I attended and the concert and the memories shared by friends and family members were wonderful.  While we were there we bought tickets to hear Samara Joy, a 22 year old singer w/ a magnificent voice and amazing stage presence for someone her age.  The concert, on September 22nd, was stellar and the sound, as usual, was perfection.  Covid protocols are strict, which I appreciate, because that gives me the sense of comfort I need to attend.  Vaccination verification is required, as are masks while you are anywhere in the facility.  The Freight is one of my favorite concert venues.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Toni M.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1660608000000,
        "ReviewContent": "I attended a Leo Kottke concert at the Freight recently.  The Freight made it clear that they wanted all patrons to wear masks, despite the City's  posiiton that indoor venues recomend but not require masks (Berkeley has its own health dept and can set its own guidelines). I wore a mask as did all the patrons I saw. However, I and others were reprimanded quite vehemently  by a staff mask nazis if our masks did not meet the staff person's ideals. When I was reprimanded a second time because my mask did not completely cover my nose, I left. I will not be going back. There is a fine line on enforcing personal standards. Using volunteers who may have some sort of animus attached to the issue at hand is not an approach I would recommend for a business dependent on public support.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"John Z.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1659916800000,
        "ReviewContent": "I've been curious about seeing a performance here after seeing this venue from my visits to the Berkeley Rep across the street. After missing Taimane's visit in 2019, I finally came to The Freight for Taimane's Hawaiki concert tour. I came to find out that the venue is a nonprofit community arts organization that is dedicated to promoting music rooted in and expressed through regional, ethnic, and social cultures around the world and is supported through the shows, grants, benefit performances, volunteers, and donations.For the concert, the tickets were general admission which is open seating in the venue.  Getting there shortly after the doors opened, we selected fourth row center aisle seats. But with its size, it appears that most seating on the lower section allows for a good view of the stage. The sound system was superb as the system was designed and installed by Berkeley's Meyer Sound Labs.The Freight requires all attendees to show their vaccination cards and to be masked in the venue. The workers at the check-in and in the venue were friendly. I'll be checking out The Freight's calendar for performances and will be back for Taimane's next visit.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Al L.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1655683200000,
        "ReviewContent": "I loved this place for so many years. Great sound , they book many great acts, excellent line of sight. Been a loyal customer from the days when they were still at their old location by San Pablo Ave But what they're doing with the entry requirements is baffling. The result is a really strange , stale & cold concert going experience. Nowhere else in town is requiring medical records & masks to be worn at all times. No drinks & no food. I feel like I'm visiting a nursing home. This is summer of 2022. I look forward to updating this review when they regain some sense of sanity ...hopefully before they turn all their customers away. Most people under the age of 70 have stopped going because of these restrictions. Better to go hang elsewhere where you can see your friends faces, have some fun, & not be subjected into these invasive requirements",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jon S.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1654300800000,
        "ReviewContent": "What a lovely evening with Eilen Jewell (Mess Around off the Boundary Country album)Freight and Salvage continue to offer amazing live music in an intimate setting at a reasonable price.Freight and Salvage are current with local and CDC COVID-19 protocols and offer a streamlined process to enter the facility..Matt says check out the calendar and go see your favorite music live!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Matt W.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1651795200000,
        "ReviewContent": "Great smaller venue for a show.  Decent prices on snacks and drinks outside of the hall.  Beware of the biatch mask police lady who ruined the entire experience by insisting our masks placed a certain way.  Everyone knows how to wear a mask by now.  This pushy woman had her own agenda.  Everyone else was great!!",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Paul M.\", \"AuthorLocation\": \"Boston, NY\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1648771200000,
        "ReviewContent": "Excellent music venue! They always have great shows! Love their selection So glad they are open for business and that they have taco options. We did not try them this time but will next time . Fun!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Kim C.\", \"AuthorLocation\": \"Danville, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1646006400000,
        "ReviewContent": "Awkward place to see a performance. The seating is awkward and gawd forbid you should have to use the restroom during a show and disturb everyone next to you because of how the seating is. Not really a place to get a beverage/snack though they have any awkward place in the back of the audience to purchase. I recently received a refund for a canceled concert that had been rescheduled 3 times, and they shorted me $7.42. For what? There shouldn't be a service fee. There was no service. They should throw in a couple extra bucks for inflation and for my time spent tracking down where the refund was. I'm sorry the pandemic has hurt everyone, but this is not the way.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Cindy Lou W.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1643760000000,
        "ReviewContent": "Don't go here if you believe in your right to choose whether you get a booster shot because you won't be admitted if you don't have one even if you're fully vaccinated.Honestly.. is it even legal to allow a sale of a ticket without a disclaimer that a booster is necessary and then deny you entrance..?Extremely angry at this establishment and will never go here ever again.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Justine K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1641772800000,
        "ReviewContent": "Hello,I would like to say how disappointed I am in your companies ability to notify your customers of a RESCHEDULED show. I purchased tickets for the Andy McKee 1/11/22 show, took time off work, drove 3 hours to Berkeley, lodging, etc. just to find out while visiting your website for directions that the show was rescheduled to May 2022. I received no call, no email, NO notice whatsoever that this show was rescheduled. I find this extremely unprofessional and will not be returning to your establishment.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Sofia L.\", \"AuthorLocation\": \"Truckee, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1639008000000,
        "ReviewContent": "We have recently moved to Berkeley and have already attended 5 wonderful concerts at The Freight.   What a privilege to be in the presence of Bobby McFerrin on Monday noons, with the audience wholeheartedly chanting the background rhythms as he sings, wails, whispers and drones his magical leads.   With one of us in a wheelchair, we were also grateful for the kindness shown by the staff in enabling us all to be able to participate.  What a gift to be part of this community!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"A F.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1634601600000,
        "ReviewContent": "This place is the best music venue I've been to.  You can be the same room as some of your favorite artists, just feet in front of them.  The sound system is wonderful, and they keep everyone safe by checking masks, and vaccine cards.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Michael B.\", \"AuthorLocation\": \"Pacifica, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1634601600000,
        "ReviewContent": "This venue is terrific.I've been here a couple of times for The Moth, which I highly recommend.  This week was the first time I've attended a musical performance.  Croce Plays Croce was astonishingly good, and it's such an intimate venue.  We really felt like the musicians and the audience were just having a great time together.  Their COVID policies are very good.  Proof of vaccine and masks are both required.  One can enjoy drinks and snack in the lobby, which is amply roomy for social distancing.  They have a nice little beer and wine selection.Inside the theater, food and drinks were not allowed.  This may be the first time I've seen 100% mask compliance recently, and it did not detract at all from the enjoyment.  I'm going to be checking their calendar for other musical events, and will be seeing if any friends want to go again to The Moth with me.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Linda M.\", \"AuthorLocation\": \"Hayward, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1614297600000,
        "ReviewContent": "Such a great place. We have enjoyed a few concerts here. Cozy but still plenty of room for a decent sized crowd. Very intimate venue. Ever seat has a decent view. Cute snacks and drinks available. We will definitely return.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"David J.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1577836800000,
        "ReviewContent": "What a great space for intimate music. And a non-profit, hooray! Staff and volunteers were lovely. Conveniently located next to a parking garage. Simply nothing to dislike. Thanks for keeping the Freight rollin'!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Stacy B.\", \"AuthorLocation\": \"Northern California, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1575676800000,
        "ReviewContent": "I saw an NPR Moth slam here. It was an intimate and yet professional venue. I loved it and enjoyed the wine and truffles for sale too.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Tanya W.\", \"AuthorLocation\": \"Novato, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1574640000000,
        "ReviewContent": "I am reposting my review based on the comments that I made after attending a concert there. I saw Bobi Cespedes with her ensemble. I saw a couple of friends their. The go regularly and are not of color. I also received a comment from them asking what black musicians I'd like to see there . I didn't answer because the Bay Area is dripping with local African American talent. Insulting, like the comments of the woman from the Jazz school. The place is a nice venue for a concert, small and intimate, however, they have some issues as you can read in the reposted view below. It was hard to fully enjoy the experience, in light of the following...This is a space that I usually make fun of because the events they have aren't accessible \"interesting\" to me. But they had a concert with Bobi Cespedes, so I had to go support her. I miss the old Conjunto Cespedes and it was wonderful seeing here there with Lichi Fuentes and Marcos Diaz!I thought they were of the same ilk of the Jazz School. And I think that it may be. But my husband and I ran into Tito Gonzalez at the Berkeley Farmer's Market and he was passing out flyers for his show. We said, \"I didn't know that they allowed black people on stage there, and he proudly said that he would be on. We couldn't make the show, but a Cuban friend went with her boyfriend (Italian) and they had a fantastic time.And while, I still find most of their events, not of my taste, meaning that I don't understand why there isn't more of an African American blues presence, considering that some of the blues clubs (Eli's Mile High, Biscuit and Blues, etc.) are gone - one temporarily (hopefully in the case of B&B). They like their bluegrass, blue-eyed sould, etc. But I digress.The only black people they seem to like speak Spanish and the only problem is that black people speak many languages, mostly English in this area. But there's also French, Arabic, Portuguese - you get my drift. That's great for Tito and Bobi, but for the rest of us, there's no there there.For more stars, I need to see more diversity.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jacqueline F.\", \"AuthorLocation\": \"San Pablo, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1572307200000,
        "ReviewContent": "Freight and Salvage is small enough that there are no bad seats and large enough to attract some great performers. I have seen several shows, for some I needed earplugs and others were perfect for me. I suspect that the artist has control over the volume. Being a nonprofit allows them to book a variety of artists that you will not see at other places. We were on the guestlist for the last two shows we saw here, so I can't really comment on the ticket prices. In the past ticket prices have always been reasonableWhat I really enjoyed was the framed calendars that lined the hallway to the bathrooms. \"The Freight\" has been around since 1968. It was interesting to see all the different performers that played there over the years, some became famous, others are pleasant memories, and some I have no idea who they were.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Terry T.\", \"AuthorLocation\": \"East Bay, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1571702400000,
        "ReviewContent": "This music venue was not what I expected. It's much better! \"Coffeehouse\" is not a great description. It's actually more like a small music hall with auditorium style seating, a large, bright lobby and a great snack bar with lots of higher-end food choices (sliders, soup, vegan and vegetarian, etc.). Everything looks new and stylish. The sound was really good, because it's a venue designed for performances, which a coffee house really isn't. Freight & Salvage was very accommodating to my friend who uses a wheelchair. The staff helped me move seats so that her wheelchair could be in the front row. My friend has a hard time drinking from a bottle, cup or can without a straw. The venue didn't have any straws but the young woman working at the snack bar went across the street to another restaurant to get a straw and brought it to my friend so she could drink her Coke. That's service above and beyond! Thank you Freight & Salvage! (We were there for an acoustic Kris Allen show, which was great. I don't live in the area, but I will definitely keep my eye on the F&S calendar and find other shows I want to attend.)",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Maggie W.\", \"AuthorLocation\": \"Atascadero, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1570233600000,
        "ReviewContent": "Best live music venue in the Bay Area.  Wonderful acoustics, wonderful staff, and always a fantastic experience! We are lucky to have such a jewel!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"y. h.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1569974400000,
        "ReviewContent": "Best kept secret in Berkeley! Recently found this venue and saw Gretchen Peters and David Bromberg... all I can say is amazing! Very intimate, not a bad seat in the house, new food options, beer and wine, and run by wonderful people. Can't wait to go back!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Stacey A.\", \"AuthorLocation\": \"Mill Valley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1569369600000,
        "ReviewContent": "I've always loved this place. I have seen several concerts here. Love the casual, easy feeling and the openness of this place. My first concert was Kim Nalley singing Ms. Nina Simone, Talk About Perfection! My next concert was Kim Nalley doing Aretha Franklin (I see a pattern here) again another amazing night. The only set back is people come in and save 10 seats for their friends, not fair!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Michael C.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1564876800000,
        "ReviewContent": "Great place to see your favorite artists...very intimate very memorable setting...always check their line ups and always buy if i see someone I like...",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Sean M.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1560816000000,
        "ReviewContent": "Went to the Moth-very poignant and vulnerable storytelling.  Also funny, authentic.  Great venue.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Thomas M.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1560643200000,
        "ReviewContent": "Love the vibe and the talent. No matter who I see here, it's always great and I love seeing live music talent. They also have literary events and community forums as well. A great community resource.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jane T.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1557532800000,
        "ReviewContent": "I've only been once but totally loved this venue. Every seat is a good one and they have first class acts always. Will go back again.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Edie T.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1553644800000,
        "ReviewContent": "I can't believe that I never reviewed Freight and Salvage as we've been here probably 5 times by now.  The great part is the Freight is nonprofit supported by generous charitable contributions, grants, and tireless volunteers who are passionate about their mission.  A small enough venue to have a great view and sounds anywhere, you don't have to go far for beverages and snacks as it is served to the right when you enter enabling you to stretch you legs during intermission and enough space to mingle without worrying you need to keep your eye on the time when you should return.  They have a great variety of talent including roots, folk, jazz, celtic, latin, afro-fusion, country, although we have only been here for Hawaiian music.  We were here mostly for Uncle George Kahumoku and other slack key greats he is touring with like Nathan Aweau, Kawika Kahiapo, Jeff Petersen, and Led Kaapana.  Recently we were treated to the sounds of our own Berkeley native Patrick Landeza opening up for Grammy award winner Kalani Pe`a just about 10 days before he went on to win his second Grammy.  Amy Hanaiali`i, I have my eyes on you next.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Joyce Z.\", \"AuthorLocation\": \"East Bay, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1550793600000,
        "ReviewContent": "Viva la Peruana Susana Baca!  Enjoyed this small, intimate venue for a sold-out concert last night.  Great acoustics, clean bathrooms, small bar and they are a non-profit to boot!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Frances M.\", \"AuthorLocation\": \"California City, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1550188800000,
        "ReviewContent": "We had our first visit to F & S Coffeehouse to see Booker T. Jones and his newly formed pre-school aged band. We didn't realize that the auditorium was mostly seating with hardly any standing space. We also noticed that 90% of the audience were Caucasian senior citizens (hmmm...). Sadly, the performance was terrible most likely due to the fact that the band just doesn't play well together or that age has manifested full force. It was reminiscent of a couple of friends jamming out in their parents' garage with little consideration for staying in tune. I love Booker T.J. but not enough to pay $40 for an ill-performed show in a coffeehouse full of senior citizens. I strongly feel that the price had something to do with the name and not the quality of the music. I hope they keep jammin' together and hone their skills as musicians. On a good note, I applaud the musicians for putting themselves out there and trying to do their best. I'm sure there are more 'fitting' bands that should be playing in a theater-like venue such as F & S. I may or may not come back for a second show but it was nice to check out a new place in a new part of town.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Tomodachi B.\", \"AuthorLocation\": \"Portland, OR\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1548806400000,
        "ReviewContent": "No matter who I see at freight and salvage, the venue is almost always the star of the show. It is a very nice small music venue in the heart of Berkley.  Accessibility is superb, whether by private or public transportation.  There is a giant public parking lot literally next-door with stairs that lead to the front door of the venue.  Once inside you will find a a very chill atmosphere with comfortable seats, large aisles, good vending and great sight-lines.  We frequently sit in the last row and dance behind our seats all night.  The acts that play here are diverse and talented.  You might see Hawaiian Masters one night and Hot Tuna the next.  I recently saw Paris Combo there and the entire delightful show was in French. Tickets are generally sold at a modest price but this is the Bay Area so nothing is cheap.  Enjoy great music at the Freight and Salvage.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Joel S. W.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1546560000000,
        "ReviewContent": "Great room... The best....but please fix your web presence.... conflicts with Google searches using your name and where us the open mic posted? Kinda hard for outatown visitors",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Yvonne W.\", \"AuthorLocation\": \"Fresno, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1543622400000,
        "ReviewContent": "Food and beverages are AMAZING! Most of all, THANK YOU, THANK YOU, THANK YOU for bringing Peter, Paul, (and Mary) to Berkeley and the East Bay! This 30 year old millenial PP&M diehard who's been a fan of The Trio for 25 years is eternally and  forever greatful!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jonathan K.\", \"AuthorLocation\": \"Longwood - Winton Grove, Hayward, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1539648000000,
        "ReviewContent": "I went there for a spoken word performance and got recruited as a judge. It was a great. The performers were gifted and mostly queer, trans, poc and masc. The audience was boisterous and good natured. The MC said the mostly masc gender thing was unusual.The show started a little later than advertised but it gave me time to flirt with my date and try a few things from the kitchen. The food was so-so, but oh well.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Sugar E.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1537228800000,
        "ReviewContent": "Auditorium seating, first come, first serve. So you get the same view no matter where you sit.Clean gender neutral restrooms so there are no urinals. Just stalls.Being downtown Berkeley, there are plenty of food options before or after the show.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Evan W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1535846400000,
        "ReviewContent": "Just got home from seeing Arlo Guthrie!  Wonderful concert!  Freight and Salvage is a wonderful place to spend a Saturday evening.  Definitely recommend it as a possibility for your night out!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Carol T.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1535328000000,
        "ReviewContent": "Love this venue - wish the audience was consistently more diverse but they try to have music that touches everyone. Sound system is excellent, prices are reasonable and seating is comfortable. I don't like the more recent \"reserved\" seating area - seems preferential - catering to those who know the bands??? They always take the best seats and reserved seating is not really an option for everyone. I think they should ditch that preferential bull..it. Enjoyed when they had side tables mixed into the seating for drinks - that was very nice. Wines are crappy and anything in plastic tastes worse - I bring my own water or iced tea. Overall, a fabulous venue with creative and fun classes - 50 years strong and a valuable addition to our community. We need to continue to support this wonderful venue!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Pam S.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1534291200000,
        "ReviewContent": "Freight and salvage great venue for music. Even though I attended UC Berkeley, I had never been there before. They have music seven nights a week.My husband, best friend and I chose to go here for a zillion Bandalin music. Venue is wonderful. The seats are comfortable and there is enough room in the Rose to move in and out without disturbing other people. Dancing can be done in the aisles. As it's been said and other reviews no seat is bad. Visibility of the stage is perfect every seat.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Kim B.\", \"AuthorLocation\": \"Dublin, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1532736000000,
        "ReviewContent": "We love this place.  My husband plays the fiddle and enjoys traditional music so we find time to enjoy the shows whenever we can.  There isn't a bad seat and they offer light refreshments.  We usually go out for dinner and make a great evening out.  They manage to book talent from all over that we've never even heard of.  Highly recommend.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Carol J.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1530576000000,
        "ReviewContent": "Good music. Great atmosphere. Food and drinks was responsibly priced. Not sure about families with children but hope to try and go back with her daughter who would really enjoy.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"D B.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1527465600000,
        "ReviewContent": "This was my first time here but it won't be my last. I like the size of the venue (not a bad seat in the house) which allows for intimacy between the performers and the audience. Sound and lighting were great and Shemekia Copeland was very personal with us.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Viola D.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1526860800000,
        "ReviewContent": "We had a great time listening to some free bluegrass with the little one. Friendly folks, fun music.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Pablo D.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1524268800000,
        "ReviewContent": "The sound (acoustics) in this venue are the best I have heard in the S F Bay Area. I was here last Tuesday for the Jazz Search West competition.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Thomas E.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1523836800000,
        "ReviewContent": "I loved the fact that it is a small venue. Word to the wise. You will buy tickets online like any normal person, then you will get to the venue early to get a great seat because it is first come first serve. You will line up   outside like a tool until they open the doors an hour early. You finally get through the door, run to the front...and there you see ...that is why you lost three stars all the front row seats have reserved for..\"The privileged.\"That is why you lost three stars. Who are these people. The second row was taken also by reserved signs. Now you are left with seats you could have had if you just showed up like a pedestrian. Then right when the show starts...(As you waited like a nice normal person for the show to begin...) The \"reserved\" privilege walks in an interrupts you and everyone else in the house, because \"they\" apparently just show up in the nick of time with their coffee and beer. They seem oblivious to the  patron around them. You do the right thing and ge online and buy tickets. That was your first mistake. It seems the venue has some friends that they hook up. I should try to get to know people at the Freight and Salvage so I can get VIP treatment also.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Flim S.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1520899200000,
        "ReviewContent": "I have not had the privilege of attending a show here yet, but I wanted to compliment the staff on my recent interaction with them. I had purchased tickets for a show I wanted to see so badly. It was a bucket list show I was surprising my mom with. We had always wanted to see Rita Coolidge. Well the morning of the show my family member passed away. They worked with me so the tickets would not be a complete loss. The gentleman who helped me was exactly that, a gentleman. I wish I could remember his name but my mind was not real clear that day. He even gave me condolences. I know that doesn't sound like much, but it is my experience these days that people are just not very thoughtful anymore. So I do not take it for granted. I will definitely be supporting this business with a heart, when I'm feeling more up to it. I'm a musician and I've heard many good reviews from many of my fellow music lovers, in the business. Can't wait to go myself. #frieghtandsalvagecafe #goodpeople",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Myra K.\", \"AuthorLocation\": \"Santa Rosa, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1520380800000,
        "ReviewContent": "I am SO embarrassed to admit that I've only just recently been to a show at the Freight & Salvage...and spent a decent amount of my life in the East Bay. Sigh. I hope to go back soon, with my sweetie and maybe my son....or perhaps my sister. We had a fun time seeing the Squirrel Nut Zippers and the opening band was great too. Awesome horns especially. Nice intimate setup, good sound, a snack bar and very reasonably priced tickets I thought. No dance floor, but aisle dancing is permitted if that's your thing. We showed up when the doors opened per a friend's advice but it would have been fine to get there a bit later. We lucked into Milvia Street parking (free on Sunday) and being able to get into Angeline's without a reservation for pre show dinner a short walk away. Perfect 'Nawlins' themed evening.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Linda M.\", \"AuthorLocation\": \"Pleasant Hill, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1520208000000,
        "ReviewContent": "Saw my first concert there a few weeks back- had an enjoyable evening there. The venue is small and intimate, but somehow the sound system didn't translate that well to my ears. I bet the sound is alot better if there's a full band involved. I will go back again as the upcoming slate of quality musicians  is top-notch. Venue is extremely easy to get to from BART station. Catch a bite to eat downtown in one of the many great restaurants nearby while you're there and to a full night out of it-  Enjoy!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Ty T.\", \"AuthorLocation\": \"Novato, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1514851200000,
        "ReviewContent": "Saw Vienna Teng here.  She was amazing but the venue is really spacious and they serve coffee and alcoholic beverages for their shows.  Great variety of music shows, from blue grass to Mozart to folk.  Definately a favorite venue in the east bay.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Trinh T.\", \"AuthorLocation\": \"Hercules, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1514505600000,
        "ReviewContent": "Vienna Teng put on a stellar performance at the Freight and Salvage Coffeehouse. It was disappointing the drink service crew found it necessary to stock the fridge with glass bottles during the second set. WTF? Put the music first before side work.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Judson C.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1510876800000,
        "ReviewContent": "First time here: saw the incomparable Asleep at the Wheel. While I've enjoyed the band in smaller honky-tonk venues that fit their style better, I was impressed by the comfort and style of this medium sized theater-type venue. Clean, comfortable and spacious (from the lobby to the aisles to the seating): great sight lines and acoustics. The bar service was efficient, friendly and very reasonably priced. Will call pick up and entry was also super friendly and warm. Restrooms clean (women's room much larger than men's: resulting in line equity, something I've never seen before)!  The show started on the dot, was fantastic and smoothly if simply produced.  The only negative: some sound  problems with mikes on a couple of instruments.  Great area-lots of food options. Reasonable parking just north off Berkeley Ave. Look forward to returning.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Rick J.\", \"AuthorLocation\": \"Lafayette, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1510704000000,
        "ReviewContent": "I visited the Freight & Salvage Coffeehouse for the first time tonight and this is the place that I've been looking for. Unpretentious musical talent in a setting that is both small and intimate but also big enough to give me the anonymity I desire so I won't get singled out to be serenaded by the singer (ha!). I just love live music and this venue didn't disappoint.I enjoyed the vocal stylings and music of Molly Holm & Her Fab Band. There isn't a bad seat in the joint. The sound is great and you can view the band from any seat with near to no obstruction (unless the person in front of you plays basketball for Cal or something).I really look forward to years of visiting this place. I can see that volunteers help during tickets/admissions. The costs to see a show is so minimal and totally worth it.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Viyada S.\", \"AuthorLocation\": \"East Bay, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1510444800000,
        "ReviewContent": "The Freight and Salvage is a non-profit entertainment venue. I do not think there us a bad seat in the house. I have sat in the front row directly in front of the stage (Trout Fishing In America); stood against the back wall (great place to dance to Sam Bush Band); and most places in between. The seats are comfortable. The sight lines to the stage are clear and unobstructed. The sound system is excellent. There is a snack bar where they sell some of the best brownies, cookies, and drinks.  Often, after the show, the musicians come out to the lobby to talk to fans, sign autographs, and sell a bit of merchandise. Many shows sell out. Buy tickets early and often. There are plenty of good places to eat within blocks of the venue. Nice parking garage a block south and about half a block east to a BART Station.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Gregory S.\", \"AuthorLocation\": \"Redmond, OR\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1507075200000,
        "ReviewContent": "I have been supporting Freight & Salvage off & on for about a year. This review is way over due. ...This is an intimate world class venue that does everything right!!They have a wide variety of different types of events.  I personally have seen Blues musicians  (Ray Charles Experience with Chris Cain), harmonica blow outs, International Piano Festivals, Cuban Salsa Band,Irma Thomas, The Blind Boys if Alabama & Presentation Hall Jazz group, etc....all within the last few months. Acoustics are great,  seating is comfortable,  venue is always clean (Huge plus on the bathrooms ), no bad seats in the house, snack bar isn't that robust, but it's good enough to get through  the evening.  Nice, relaxing, semi-reasonably priced venue. Great Experience! !Now special note of the staff: Exceptional!  Small crew, of extremely dedicated exceptional staff. I recently had need to avail myself of their ADA ...what impressed me most....was the courtesy call inquiring about any preparations needed to ensure a successful experience. I don't know if they are always able to reach out personally,  but it brought tears of gratitude nevertheless.  This is a truly exceptional venue being run by exceptional people! Thank you,  thank you, thank you for another memorable experience. Warm regardsSharine",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Sharine d.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1503187200000,
        "ReviewContent": "This is a great venue to listen to music.  I have been here several times and each time is wonderful.  Acoustics are great and no bad seat in the house.   The other nice thing is you can see legends of music here.   This is a non profit place.  Come and support it! I am so",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Stan P.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1502064000000,
        "ReviewContent": "The good - Small venue, good acoustics, really reasonable ticket prices, comfortable seats, excellent show (The Subdudes). The bad - LED chandeliers for house lights. When turned up full they gave us a headache.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Steve L.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1501372800000,
        "ReviewContent": "My friends and I saw our first show at Freight & Salvage this past Wednesday to see a performance by Allen Stone. I had never heard of the venue, and after looking it up on Yelp, I knew it would be a nice and intimate show. The night of the concert, my boyfriend and I were running late due to traffic coming across the Bay Bridge. Luckily, we were able to call in and transfer the tickets easily to my friend's name so we didn't have to wait in a line when we arrived. We went in at around 7:40pm and were able to find seats just behind the sound booth. Like other patrons have said, there is no bad seat in the house. Allen Stone's show was almost 3 hours including a 15-20 minute intermission, so we definitely felt like we got our money's worth. The sound was great and even more amazing to me was that almost no one used their phone to record during the set. Way to be present and enjoy the music, folks! The venue had 2 bars with wine and beer and there was a table for artist merch just outside of the auditorium. Security was lax and we got in with no problems. Do arrive early to circle around for some street parking or better yet, hop on BART and walk over. We ended up parking in a lot for about $5 for 2 hours.We hope to see another show at Freight & Salvage soon!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Camille B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1501113600000,
        "ReviewContent": "I basically grew up at the freight, and boy can I tell you I was lucky. Its a community dedicated to bringing awareness to and keeping alive an eclectic mixture of different kinds of music, all equally important! A wonderful, inclusive place with a great staff, sound system and environment. Can't beat that!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Aya G.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1499558400000,
        "ReviewContent": "Every time I visit Freight and Salvage I am reminded what a fantastic place for a show. Great music, wonderful staff, fun eats and drinks.  While some may reminisce for the old F&S, and it was a wonderful little place, the acoustics and opportunities for more fans to see a show makes the new hall my favorite local joint for music.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Ken C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1495152000000,
        "ReviewContent": "Just saw (and heard) Marcia Ball here. Amazing acoustics! There really are no bad seats. You can see and hear from anywhere in the room. I plan to return often. Great venue!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Linda O.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1495065600000,
        "ReviewContent": "Great venue,my first time there 5/15 to see Marty Stuart.Awsome show! Friendly staff (volunteers) so helpful.Came all the way on Bart from So.SF and can't wait to return.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jennifer F.\", \"AuthorLocation\": \"South San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1493596800000,
        "ReviewContent": "I won't lie, I've only been here one time a few months back. Not because I only want to, but because I've been busy and went to a plethora of other shows within the last few months. The Freight & Salvage Coffeehouse is as good as it gets: Friendly staff, nice hospitality from the other visitors, good location if you're taking BART, and from what I know, the shows don't end super late so you can always make it back on time. The type of music that I notice that performs here the most is mostly singer/songwriter and/or folk with a tad of the real country stuff. If you're here, you know you're in good hands, and you can always choose to grab a bite before the show if you choose to. I'll be back soon.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"John S.\", \"AuthorLocation\": \"Vacaville, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1490227200000,
        "ReviewContent": "I've seen many wonderful concerts here. The location is convenient, the theater is clean. So delighted that the seats are comfortable (yay for no constraining arms) and it has the most generous legroom around. They have a snack bar - I've only had the bubbly water - but you could get a cookie here too. Great venue. Signing up for their mailing list.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Marco M.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1483142400000,
        "ReviewContent": "Interesting that so many people talk about liking/loving The Freight without mentioning that it has the greatest sound of any small(ish) venue in the Bay Are!  All the other great things other positive reviewers have said are true, but the important thing about it (after all we're talking about listening to  music) is the amazing sound. Thank you Meyer Sound!  If you love SFJazz, know that The Freight has the same off-the-charts sound in a venue that's half the size, just as comfortable and intimate, and offers a much more diverse selection of music.  For me, The Freight is the Berkeley Arts District's greatest gift to the Bay Area.  Support The Freight and enrich your life in 2017!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Sally P.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1481846400000,
        "ReviewContent": "Really great venue! So glad I discovered it when I bought tickets to a Jon McLaughlin concert here. Very intimate setting.  Affordable shows. Advance general admission tickets for Jon McLaughlin were just $17 ($20 at the door, I believe). Hardwood floors, wood panel walls, chandelier style lights hanging from the ceiling. Quite lovely. The space isn't huge which I really like because it makes for more intimate performances.Would be interested in returning to check out some other performances! And also to try out their \"concessions.\" There's a bar that sells some alcohol, coffee, water, not sure what else. The performance I went to included an intermission.Probably hard to find street parking around here, as it is in downtown Berkeley. But it's SUPER close to Bart so I would recommend taking public transportation here if at all possible. Lots of restaurants nearby all within walking distance if you want to grab a bite to eat or a drink before your show.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Josephine F.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1473206400000,
        "ReviewContent": "This is probably one of my favorite intimate, classy and BEAUTIFULLY structured small music venues in the Bay Area. That could be in part because it hosts plays and local charity events as part of the community, but this place is just lovely.I went here a few months ago to see American singer-songwriter/bluegrass aficionada Sarah Jarosz perform, and... Let me tell you a story. Sunday night. Left late. Decided to skip on the opener. Since tickets were sold out, I went in for Standing Room only. No ticket bystander was at the box office. I heard the musician playing overheard over the front-of-house speakers. I thought to myself, \"Oh my gosh! I'm missing it! Is this how I'm going to experience this show? Outside the venue as I happily listen to her perform over the speakers?!\" Luckily I was able to ring the buzzer and the lady came to me and let me go in and enjoy the rest of the show.Might I add, there is not one single bad seat or view in the entire room. The stage is centered downward as the audience seating angles upward all around the venue. The music and acoustics are GORGEOUS. You can hear every little sound, as I would like to think this place makes for a great live recording venue as well.They usually house American bluegrass singers and songwriters and local music groups, which makes it more of a community-driven all-American venue.Transportation is EASY as you just walk a block or two from the Downtown Berkeley BART station. Parking can be a little difficult as it is downtown, but there are little spots and alleys all around (and Berkeley makes for such a great and easy walk-around).I absolutely fell in love with this venue and would love to go again. Although they house more musicians that I am unfamiliar with in the Americana song branch, I would definitely come again... Book fair? Readings? Speakers? Local choirs? If something catches my attention, I'm there.  The venue itself is gorgeous, classy and clean and serves its musicians and audience right.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Rachel Ann C.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1472601600000,
        "ReviewContent": "I never go out on a date 'till I've read the idiot things my potential match-up has written on Yelp.  1 star, as my BF couldn't park in front on Friday.....the cat jumped up and spilled my pink martini......I never ate there but I heard they had bad vibes........not like the porridge my mother used to feed me. Perhaps I should have a blog of Yelp Idiots, but I'm sure Yelp (they pocketed $550million last year) would sue me (or perhaps buy the blog and sell to comedy central)Well as there was no where else to write this, I thought I could add it to one of my favorite places.   The variety of music to be heard from excellent classical Ben Simon & the SF Chamber Orchestra redux once a month to bluegrass headliners in a wonderful spot.  Do go there.  Take Bart (on the corner).",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"amnnor n.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1466121600000,
        "ReviewContent": "I love this place. It's small enough that almost all of the seats are good and even when the place is sold out you can still move around. The chairs are also spaced apart so you're not knocking elbows with the person next to you and are comfortable to sit in. They have a snack bar with alcoholic and non-alcoholic drinks as well as things to munch on, and (very important) clean bathrooms.The sound system in this place is great and they always have something going on.  I recommend keeping an eye on their calendar,  you never know who's going to show up.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Sean S.\", \"AuthorLocation\": \"San Ramon, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1463184000000,
        "ReviewContent": "Spent time with my baby nephew to see this play that is non-profit.  It was the piggy and the elephant kind of show.  It was a nice outing. Adequate seatings and good layout.Great location with parking lot right next door.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Tiffany D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1462838400000,
        "ReviewContent": "Yeah, definitely one of the best small music venues around.  The sound is great, seating wonderful, visibility fantastic, and everyone is friendly and accommodating.  Although I live in Folsom, I frequently drive down for the evening to see shows that don't come to the Sacramento area (and some that do).  I recently saw Sierra Hull and David Grisman back to back on a Friday/Saturday night, and it was awesome.   They even have beverages and pastry, and I've never failed to find street parking within a couple of blocks.  And there are plenty of restaurants and bars close by.  What not to love!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Marc B.\", \"AuthorLocation\": \"Roseville, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1462320000000,
        "ReviewContent": "Awesome venue!  Having fun at \"The Moth\" open mic. Great storytelling. Friendly crowd, friendly staff.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Rebecca B.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1461283200000,
        "ReviewContent": "***200th Yelp Review*** (sheds a tear of joy)For me, there is no better performance to write about than the night I learned how to dance swing.While cruising in downtown Berkeley, I often passed by the outside of this performance venue and wondered why a place advertising itself as a coffeehouse looked so much like a theater. I chalked it up to the fact that Berkeley's buildings can be rather eclectic. On one July evening, I decided to check this place out during a performance by a New Orleans-based band called Tuba Skinny. The interior is much larger than the exterior would make it seem (similar to a certain phonebooth). First I walked through the spacious lobby where tickets were collected and merchandise tables (that only accepted cash) were being set up. While looking for a bathroom on the second floor, I couldn't help but admire the colorful decor and the sheer number of flyers for events that have been hosted here in the past. The auditorium was something else entirely. As mentioned in several other reviews, it's a large and wood paneled space with many rows of seats and a bar serving rather pricey refreshments in the back. This performance was open seating, so I decided to hop up front. Interestingly enough, there was a large blank space between the front row and the stage, and a small crowd of people waiting on both sides (which I assumed was the standing room only space). The musicians entered, set up a myriad of instruments, and began to play some of the most toe tapping and melancholy New Orleans jazz I have ever heard. And the people waiting on the sides swarmed onto the dance floor in a beautifully chaotic mix of swing dance styles. I was totally caught off guard by the two performances happening simultaneously, as the band comfortably shared the spotlight with the dancers. Most of the audience watched silently in the background (clapping at the end of each song of course), but occasionally the people sitting next to me got up to try their moves out. The music and the dancing in front of the stage mixed to create a completely immersive performance experience unlike anything I had ever seen before. In short, it was cray and in a good way.I couldn't help but jump up and try to dance myself, but confession time: I didn't know how to swing dance. An old gentleman next to me tried to teach me some of the moves, but after a bit I decided it was best if I just watched, and sat down sheepishly. But once I got back to school I began taking social dance lessons and am now at a more proficient level, so I hope if/when I return to Berkeley, I'll be able to tear up the dance floor with the best of them.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Emily Y.\", \"AuthorLocation\": \"Saratoga, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1460160000000,
        "ReviewContent": "I go here often to see The Moth (and sometimes to perform in it), and this is one of my favorite venues in Berkeley. Spacious and well lit, not a bad seat in the house, plenty of standing room, great sound and great air temperature. Parking can be tough but there's a garage right next to the theater, or take BART to Downtown Berkeley.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Julie S.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1446336000000,
        "ReviewContent": "Such a nice venue ! The staff & volunteers were all certainly welcoming . They even let me in a bit before the doors opened for the show --- to use the bathroom ! I may as well mention , said bathroom was up to date and very clean !  The parking garage was only a few doors down & reasonably priced. ($5 flat for the evening )   We liked the comfortable padded chairs and moveable seating ! It let the venue create a dance floor for the headlining band, Rusted Root . Cuz you gotta shake your booty to \" the Root \"   The whole vibe was \" community playhouse/theatre \" more than \"concert venue\". It made things seem a little more \"upscale\". As did the beer & wine selection . They had local microbrews , ciders&A varied selection of wines --- much more than the usual \" red? Or white ?\" Also nice snacks of nuts or pretzels.The bartenders were all friendly & paying by card was easy with their modern touchscreen payment system --- that let us save our cash to buy a T-shirt from the band !",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Michelle T.\", \"AuthorLocation\": \"Palm Springs, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1443052800000,
        "ReviewContent": "Thank you so much, F&S!  We've had the best times at your place. The bands you find are awesome! The deserts are some of the best around - lemon tart was good enough to kill for. Good cold beers. Great sound. Great acoustics. Such a great vibe. Love your staff - very chill and super nice. Thanks again! See you soon.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"jonny s.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1441584000000,
        "ReviewContent": "This is a fantastic venue! Really easy to get to using BART/so much good food nearby, comfortable seats that are tiered so you can see from every angle, pretty good acoustics, a pretty good number of bathrooms, good drinks and snacks available, friendly staff, and all sorts of great events - a really diverse lineup of great acts/performers/even classes. I wish I still lived in the Bay Area so I could go allllll the time! I will be back as often as I can.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Shannon L.\", \"AuthorLocation\": \"Reno, NV\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1438214400000,
        "ReviewContent": "Comfortable seating, brilliant yearly calendar, and a little wine and snack bar to visit during intermission. I've only been once, but already have tickets for another show there. The best place for world, folk, Americana, etc in east bay!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Kate M.\", \"AuthorLocation\": \"Wheaton, IL\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1437609600000,
        "ReviewContent": "great sound, relaxing and well set up, crap parking, but that's just downtown Berkeley.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Rob L.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1434931200000,
        "ReviewContent": "Went to see the fabulous Bob Schneider and had a fabulous time. Nice place. Friendly staff, good wine and beer selection, comfortable seats and a good sound system. Parking abounded on the night we were there and there is easy BART access. Found a street space although there are several garages and lots in the area. It was a great evening and I'll be back on Friday as well! Be careful of the Yelp reviews. This is a sweet, new facility. Most of the meh reviews are a few years old and are for the less sweet, old place.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Brian B.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1434844800000,
        "ReviewContent": "Robin Flower and Libby McLaren were fabulous last night at the amazing Freight and Salvage. They are skillful musicians and wonderfully humorous and entertaining. Don't miss their brand of Celtic folk and roll next time they are at the Freight!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Kathy D.\", \"AuthorLocation\": \"Castro Valley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1433462400000,
        "ReviewContent": "Love the space!!  Attended a Moth StorySlam here the other night and got premium seating tickets which didn't seem necessary b/c I think all the seats in the space probably have a decent view of the stage.  They have a coffee bar and a wine / beer / cider bar as well that has light snacks (pretzels, nuts).  There was a taco truck outside and some patrons came in with burritos or tacos so that's at least a food option.  There is a garage next door for accessible parking and lots of places to eat and explore in Berkeley.Hope to be back for another show in the near future!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Kathleen W.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1432684800000,
        "ReviewContent": "I've been tithe old Freight and here, the new Freight and it's a wonderful venue. Not a bad seat in the house.  The sound system is great.There is convenient parking near by and the Downtown Berkeley BART station is around the corner.The restaurants in the area are plentiful.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Rob F.\", \"AuthorLocation\": \"Burlingame, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1432425600000,
        "ReviewContent": "I recently attended a fundraising event here, and this venue is awesome! Good space for a classy and cool event, and their staff members are very professional. The foyer is a spacious, perfect for a pre-program reception. There is a bar on one side of the foyer, which normally has coffee and snacks but this time served wine and sangria. The main theater space is beautiful. The stage is breathtaking, there is plenty of seating, and the seats are comfortable. The AV booth is smack-dab in the middle of the whole room, which is a great comfort for event planners. AV and lighting were excellently executed, great job to the Freight & Salvage team. Seamless event. I would love to come back here for another event or just to hang out on a regular day!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Stefanie C.\", \"AuthorLocation\": \"Denver, CO\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1431561600000,
        "ReviewContent": "What a cool venue! I caught a show last night (Grant Lee Phillips and Steve Poltz) and was impressed with the beautiful ambiance and the rich acoustics of Freight & Salvage. What is great about this spot is that it's a venue that is dedicated to the performance/performer. The crowd is a mix of students and older folk alike. There isn't a loud bar to disrupt the artist. You go there for the music! Bravo! There is a bar in the back ($6 beer/ $8 wine / $3 assorted snacks + desserts), and their ipad payment system makes it easy to pay with a card. I will be back!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Leonie S.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1430092800000,
        "ReviewContent": "Such a wonderful venue. I've seen my favorite folk artist here a few times. Love the atmosphere and wood paneling. Great, spacious room. The seats all have good views. Love sipping a coffee or a beer during a show. Great location.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Adrienne R.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1429315200000,
        "ReviewContent": "Wonderful warm acoustics; Meyers Sound, of course.Great seats, wide and good legroom.Excellent sightlines, well-designed floor rake. Friendly staff, appreciative and intelligent audiences.Easy-on-the-wallet ticket prices, and clean, efficient online ticket sales interface.Best of all, superb diversity in the artist bookings.Take BART or bus, or park in garage next door. Bask in analog, people!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Mutant O.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1427932800000,
        "ReviewContent": "Very cool venue for a work conference. I did not try the food or drinks.The good: Nice warm wood paneling and tiered seating. The ceiling was high and created an open atmosphere. It was a little dark, but just added to the ambience.The meh: As a presenter, I couldn't read my slides on the screen from the podium. Not sure if this is a venue specific problem due to the stage size, or if it can be easily remedied by moving the podium.Pro tip: For all day parking on a weekday, the nearly adjacent parking lot offers an early bird special ($10 all day).",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Sue V.\", \"AuthorLocation\": \"Elk Grove, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1427587200000,
        "ReviewContent": "Very nice and welcoming venue - great staff - saw Mary Fahl last night and was very impressed.  Nice place - nice people - lovely music - not much more you could ask for..",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Tom B.\", \"AuthorLocation\": \"Sun City, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1424476800000,
        "ReviewContent": "Freight & Salvage Coffeehouse is a fantastic music venue. The acoustics are perfect. The lighting sets a comfortable mood. One doesn't sit in the dark during the concert.Every seat does indeed have a great view of the stage, but front row seats, be they in front, to the left or right of the stage, can't be beat. It's a bit like sitting with the artist in their living room as they perform just for you. Less than a block from BART, Freight & Salvage is so easy to get to. The folks here are so nice and you can tell that music is their passion.I always watch the calendar and try to get here as often as I can.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Scott N.\", \"AuthorLocation\": \"Cincinnati, OH\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1422144000000,
        "ReviewContent": "I went to Freight and Salvage to see the Cheap Suit Serenaders (and Casey MacGill) not too long ago. I guess the best way to describe this place is \"fun.\" It doesn't feel like some sort of stuffy venue -- rather, you can chat with the crew during intermission or grab some beer/wine/a cookie. I'm sure being a non-profit helps with that tremendously.However, the seats could definitely use some work -- after sitting down for a few hours, I ached something fierce.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Casey S.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1417305600000,
        "ReviewContent": "My partner and I love to go to concerts at the Freight!  Even with their newer, more upscale location, we still feel it is an intimate venue to see traditional, and not so traditional music.  Always with it's quintessential Berkeley vibe, it is one of a kind and meant to be supported and cherished!  There's really not a bad seat in the house and they have a nice little refreshment area if you need something during intermission.  We have seen some awesome folk talent, Irish bands, bluegrass and alternative bands here and look forward every month to see what talent they have sourced.  It makes for a great night out for couples and there are a lot of good dinner spots nearby.  Check them out!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Liz H.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1405382400000,
        "ReviewContent": "I really liked this venue! The sound was great and all of the seats had a great view of the stage. The lighting was great. You could see the musicians really well and it wasn't too dark when the concert was in intermission. I really liked how close this location is to the BART station as well, very convenient for someone like me who lives across the bay. I came here for a House Jacks concert. Hopefully, I'll be able to see them again when they come back here. If not, I will definitely be coming back for other shows.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Breniel L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1401667200000,
        "ReviewContent": "we recently came for a show with 42 high school students-- we loved it! what a great venue, awesome sound, and super affordable opportunity to hear some great live music!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"kelsey c.\", \"AuthorLocation\": \"Santa Barbara, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1400112000000,
        "ReviewContent": "What a spectacular venue! Excellent views and sound no matter where you sit. They book an amazing variety of acts - singer/songwriters, bluegrass, Django-esque jazz, folkies, old-time music, etc. I've seen 8-10 full shows there and never been disappointed. I've also seen parts of many other shows on the way into or out of music classes. It's incredible how many great acts you've never heard of! So don't be afraid to just catch a show on a free evening.Also highly recommend are the music classes - great instructors, friendly low-pressure environment and very reasonable pricing. Pete Madsen's guitar classes are particularly good.[NOTE: New venue on Addison opened 8/27/09. Reviews from before then do not apply to this location.]",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Tom S.\", \"AuthorLocation\": \"Orinda, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1400025600000,
        "ReviewContent": "Ditched by my sleepy crew, I decided to check out Berkeley and see if I could scare up some entertainment for the evening.  I wandered by the Freight and Salvage and noticed a crowd waiting to get into a show. Even though it was sold out I got in SRO and even managed to find a seat. Enjoyed an amazing Nell Robinson show. Great venue with lots of history and well curated entertainment offerings.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jeremy R.\", \"AuthorLocation\": \"Dillon Beach, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1399507200000,
        "ReviewContent": "Wow, just, wow. I totally judge a business by its customer service, and Freight & Salvage went over and beyond for me! I purchased concert tickets 13 months before the date of the event, and at the last minute had to soar 3,000+ miles away to care for an ailing family member.I hopped on their website, but the return policy made the forecast of a return look pretty dismal. So, I tried to sell the tickets, but no go. I send them my apologies and offered to take credit for a future event, but they searched up my details and in an instant handed me a return and well wishes.Tickled pink I was! They could have stuck to their guns, but they helped me out and I will forever love them. I hope to be home soon and keep a look out for an event to carry me through their doors.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Ro R.\", \"AuthorLocation\": \"Montreal, Canada\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1395532800000,
        "ReviewContent": "Another classy find in downtown Berkeley! I came here for a Valentine's Day event which featured AYCE/AYCD oysters, chocolate, and champagne with a performance by the local Bay Area bluegrass group, Supermule. If you ever want an out-of-the-box night out, I suggest coming here!I love the way the auditorium is set up--the seats are slightly elevated so you will get a great view no matter where you end up sitting. The acoustics were amazing and you can still hear the music out in the lobby. And there are tables in between the seats so you can bring food and drinks in. What's even better than enjoying a live performance? Watching it with a plate of oysters and a flute of champagne in hand (or on table). They also have a small wine bar outside in the lobby area.If you want to check out local Bay Area performances in a more intimate setting, I would definitely make my way out to the Freight & Salvage Coffehouse in Berkeley.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Bonnie Z.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1393372800000,
        "ReviewContent": "This is one of the best venues for acoustic music in the bay area, if not the best. Only thing they are missing is a dance floor. Good music makes you want to dance. And I wish they had tables instead of theatre seating. But the vibes are good, nice wood décor, and the staff is friendly. Good sound system. Reasonable prices for concerts and drinks. $5 parking next door and street parking too. And they are a non-profit organization that supports traditional music, another reason why you should go there. They have classes and workshops here too, check them out...",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Ron W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1391040000000,
        "ReviewContent": "Great first night here of Music and ( green jasmine tea for me). I don't think theres a bad seat in the house, and the sound was fantastic. We had purchased tickets and had them mailed ahead of time, so we walked in a sold out show (The Milk Carton Kids-Amazing!) after a short wait in line. Got a isle seat 3 rows back, so shorty here could see perfectly! Again acoustics were spot on, everyone that we came in contact with at Freight & Salvage was super friendly. Loved the reasonably priced refreshments, got a cup of pretzels for a buck! What a magical night for this first timer.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Susan D.\", \"AuthorLocation\": \"Danville, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1390953600000,
        "ReviewContent": "What a great auditorium!  Every seat has a clear view of the stage.  The room feels surprisingly intimate for a 200 seat space.Good room acoustics augmented by a hi-fi quality sound system, stage and auditorium lighting is easy on the eyes, the seats are comfortable, and there's a snack bar with beer & wine.I saw the Milk Carton Kids last night.  It was one of the best concerts I've ever heard.  And I've been to 1,000's of concerts since 1959 from dives that sat 20 patrons to the greatest symphony halls on 5 continents.Freight and Salvage, Yeah!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Tom S.\", \"AuthorLocation\": \"Blue Oaks, Roseville, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1390867200000,
        "ReviewContent": "Next door parking structure for $5 a night during an event night.50% discounted price if 30 yrs old or younger, so take advantage of your youth!Spacious seating, hardly a bad seat in the house.  If you're open minded about the music you listen to and not a top 40 or under ground music snob or seek getting high off of edm wearing neon pleather, then this is a neat venue to stop by and get a bit cultured.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Mike K.\", \"AuthorLocation\": \"Orange County, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1390348800000,
        "ReviewContent": "This is got to be the worst open mic in the bay area!! They only have room for 30 acts for open mic and people come and stand in line way before it opens. But I think the people who run the event have preferential treatment for their friends, which seemed like a lot of them. So it's probably like 15 slots to the early birds. The system is flawed. The acts were all terrible the night I went with no diversity in the music. You're not going to catch the next rising star at this open mic because they make it so that promising young acts would never want to go here. YOU PAY for the open mic and then they say you might be able to play if someone doesn't show up. It looks like a bunch of old hippy folks run the event and just love putting their preferred acts on. It's a shame that a great venue would never capture the next great thing. For someone who loves music this was a painful event I do not want to relive.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Ed D.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1388448000000,
        "ReviewContent": "Checked out the Freight for the first time last night for the Big Fat Year End Comedy Kiss Off. Show was excellent and we were pretty impressed with the Freight too. Seats not plush but definitely comfortable enough. Great visibility of the performers. Nice little snack bar. Parking flat $5 next door. Came home and bought tix to 2 more music shows. Gem of a nonprofit space for all kinds of performances and music classes too.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Cydney B.\", \"AuthorLocation\": \"Vancouver, WA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1383177600000,
        "ReviewContent": "I took group ukulele lessons there and had a blast. The teacher was funny and had us playing a song by the end of our first class! Super great value for the money.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Lauren M.\", \"AuthorLocation\": \"Bay Area\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1382745600000,
        "ReviewContent": "Beautiful concert venue! Not sure why they kept the coffee house part in the name; it's really just a small-medium concert hall. I guess they do serve coffee, tea, beer, and wine.They bands they host are excellent, and the staff/volunteers are very friendly and passionate about music. We had the privilege of seeing Ruth Moody and then stayed around for 15-20 min talking with the people from the box office and buying tickets for other events. They were kind enough to recommend 3-5 shows from their list of 60+ bands, they also even took the time to play some samples of music for us and told us what would sell out. That's dedication!I should also comment on the seats. Really, really comfortable with side tables every 3-4 spots to hold drinks. There is plenty of legroom and space between seats so you don't feel to close to your neighbours, but can choose to lean against your significant other should you choose too.The only thing that holds this back from being a 5 star venue is lack of beer selection, and the lack of anything on draft. I would love to see draft beer here from a local micro brew.Oh and another tip: buy tickets in person. They are cheaper (no $1.50-$2.00 surcharge and ANYONE UNDER 25 GETS 50% OFF ALL EVENTS!!!)Can't wait to come back in a couple weeks to see The Milk Carton Boys!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Chris S.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1380153600000,
        "ReviewContent": "Great open friendly venue.  Fantastic acoustics.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Drew M.\", \"AuthorLocation\": \"Felton, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1375920000000,
        "ReviewContent": "Great music venue.  Freight and salvage has been around since the 70s (i think) and are entirely non profit.  Even though their non profit the musicians and performers still get paid well.  Te venue itself is immaculate, very clean, lots of stadium style seating, and great sound quality.They serve coffee some small snack and wine.  Tickets range from $15-40 depending on who's playing.Adjacent parking garage is a $5 flat rate after 5pm so parking isn't an issue.Definitely worth checking out any night if the week for some great and often eclectic music",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"John S.\", \"AuthorLocation\": \"Ingleside Heights, San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1374019200000,
        "ReviewContent": "Great sound. Not a bad seat in the house. Just 2 blocks from Berkeley BART. No alcohol, though. I look forward to seeing more shows in the future.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Daniel S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1372291200000,
        "ReviewContent": "I never went to the old venue, but the space is top notch (or, as Melissa Ferrick--the artist I saw at Freight and Salvage--would say, \"tawp nawch.\")Comfortable and spacious seating, an amazing sound system and set of acoustics--the room just sounds warm and welcoming. I also appreciated their wine/beer offering, as well as coffee and snacks. None of the concessions felt overpriced, and the volunteers working the counters were sweeties.Will definitely be back!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Allison S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1364774400000,
        "ReviewContent": "This is a great small showroom with good sound. All seats have a good view of the stage.    We saw Crystal Bowersox live.  It was a fun night.  It is close to Bart.  Its not a 5 star as I liked the chairs, but not as comfortable as some music halls.Overall, its a nice place to go.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Samantha K.\", \"AuthorLocation\": \"Palo Alto, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1364342400000,
        "ReviewContent": "What an absolutely GREAT place to see a show. Beautiful spot in Berkeley, great acoustics, and a great collection of \"regular\" live acts to check out.Although they are a bit cheeky charging $6 for a bottle of beer they pull out of a cooler in the foyer...!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Gary E.\", \"AuthorLocation\": \"Petaluma, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1359417600000,
        "ReviewContent": "A first rate venue to catch some live music. I took my mother and some friends to see Vienna Teng over the holidays. Was a bit nervous since my mother can't walk very far and one of my friends is in a wheelchair. They were very attentive, had a reserved disability spot for us. There isn't a bad seat in the house, it isn't that big, perhaps 600 seats? I love that they give you a very generous amount of legroom. There is a coffee and snack bar, and a wine bar, reasonably priced. A great show by Vienna and kudos to the staff at F&S. I thank you.Also, a couple of blocks from the Berkeley BART Station, another plus when you live in the South Bay.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"David K.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1358812800000,
        "ReviewContent": "Just a great venue.  Acoustics are really good, sightlines are really good, food at the snack bar is good, vibe is friendly, lots of good acts w/great musicians.  I just saw the UnderCover Presents version of Joni Mitchell's Blue with Kitka, Beth Custer, Kelly McFarling and others, and before that I saw Peter Apfelbaum with Josh Jones.  Great stuff.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Peter A.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1354406400000,
        "ReviewContent": "House Jacks in the house! Did you know gangnam style can be done a cappella? Turns out it can, and it was actually good. This was my first time at F&S and I was diggin' the venue--super nice to have a flat rate parking garage on the same block. I was there at an extreme groupie (not really, but it felt that way) shooting some b-roll for future House Jack promo videos.The venue is nice. The outside makes it look big, but once you're in, it feels much more intimate. It's a fairly casual vibe and a good time all around.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Lauren J.\", \"AuthorLocation\": \"Portland, OR\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1353974400000,
        "ReviewContent": "Got my daily dosage of culture recently here. WHAT A GEM!I live near the theater and often see it crowded at night and thought we would check it out! It's mostly an older people/senior crowd, BUT THAT'S EVEN MORE AWESOME!!There's a 50% discount if you're under 25 which I AM SO TAKING ADVANTAGE OF!! For us poor college students, a 50% discount is enough for me to treat myself to some good nontradtional music and MEET NEW PEOPLE. Every is SO SO nice here!! I feel like everyone knows each other and its sort of like a family!We were def the only college students there, but enjoyed every moment of it!!!! Oh, not to mention the sound is AWESOME. FUN FUN FUN.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Ashley M.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1346716800000,
        "ReviewContent": "Me and my friends try it out this place. I so love the show they had that day with folk music going on that day which I love folk music along with one of my friends. Especially the guy name Max Newton. His whole show along with his crews was so colorful, beautiful and very creative. I so into that. Next time I'm gonna check that place out and see what kind of music they gonna play. Even buy something off of them too. Just had a great time everyone.....",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Erika B.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1345680000000,
        "ReviewContent": "The Fiddling Repertoire, and Beginning Fiddle classes taught by Erik Hoffman at the Freight are terrific and very affordable.  Erik is knowledgeable in and covers a wide range of fiddle music, including Old-time, Irish, Scottish, Scandinavian, French, etc and is happy to tailor courses to the interests of his students.  He also includes a fair amount of music theory and teaches students various bowing patterns and embellishments.I'm told that the other music classes (banjo, guitar, singing, etc) offered at the freight are equally well-loved.http://www.thefreight.org/classes-freight",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"lc m.\", \"AuthorLocation\": \"Chicago, IL\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1343779200000,
        "ReviewContent": "Hi, I think everyone should give the Freight 5 stars.  What they have accomplished for folk /blues/bluegrass/traditional music is quite remarkable:  a beautifully designed hall that seats 400 to 450, there isn't a seat with a bad view or bad sound, and a sound system that is about as good as it can get.  What other cities have this kind of a venue for alternative music?  I love the place.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Agi B.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1335139200000,
        "ReviewContent": "What a lovely little venue! The acoustics were great! I loved the intimacy of the room and the seats were designed so there isn't a bad spot in the house. The stage is very small but that's what makes it great. The reason I am giving it minus one star is because the first half of one of the shows was completely not balanced. The audio team didn't get their act together till after we left (my friend has a hearing problem so it bothered him too much). Also I was not very impressed with what was on the stage (though I heard they got better after we left). Oh well! Try again",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Ezequiel R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1335052800000,
        "ReviewContent": "I just realized that I've been negligent and not updated my review of Freight & Salvage since they've moved to the gorgeous new venue.  What a stunning job they've done -- translating the relaxed, comfortable vibes of the old digs into this incredible new space.  Acoustics are stellar -- they sound engineers are spot-on.  And such an amazing line-up of performances, with something for every musical taste.  Plus, they offer classes for an amazing array of music, including Uke (yay!), guitar, harp, flute, harmony singing, and more.  The coffee house portion is nice -- you can get hot tea and coffee, some nice sweet and savory treats, and wine and beer.  The staff and volunteers are always friendly, helpful and accommodating.  Parking garage right next door makes for an easy, seamless evening out.  I just wish there were more good restaurants in easy walking distance.  Seems like a sushi place on the corner would be ideal!  But within a 5-block radius, you can find some nice places for a bite to eat before the show -- my favorite recommendation would be Angeline's.  Tip:  Especially if you're getting tix for several shows, it is worth it to stop by and purchase them on-site.  The online service charges are steep!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Bevy M.\", \"AuthorLocation\": \"Castro Valley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1334448000000,
        "ReviewContent": "open mic  night was def one of those berkeley experiences. it lasted for about 3 hours.. way longer than i had imagined. some of the performances do blow your mind away and if you wait around until the end, they give you a free ticket for one of their regular shows. definitely worth checking out!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Joyce B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1333929600000,
        "ReviewContent": "Location: Easy to find and attractive facade.Ambience: Intimate and seating is stratregically placed, allowing for a cluster-free traffic jam at the entry-way. *The smell of coffee brewing while watching a live performance, definetly adds to the experience of coming here*Performance: I attended Parisa Vaaleh's performance on Easter Sunday and was pleasantly surprised by the turn-out. The ensemble didn't have me walking out thrilled, but Parisa's voice definetly had me sitting through the entire show.Prices: A little OVER the top if you ask me. I think I paid $26 and some odd change at the door??? As a member of the audience, the odd ticked pricing had me wondering, how closely they were watching every penny. Now I'm sure ticket pricing will vary with performances, this one was just ODD.Overall, I don't have anything against the place and will surely come back.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"O.s. M.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1332460800000,
        "ReviewContent": "I went to Freight and Salvage for the first time some months back to hear Klezmania. The venue is astonishingly good, but ...- sloppy procedure at the door with three different ticket taking individuals so you get bounced from one line to the next until you discover the correct line;- speaker volume better suited to a rock concert than a Klezmer group;- and morons in the audience who think it perfectly acceptable to be checking their cell phones and using them with glaring LED screens to take pictures. These shortcomings could be easily corrected by the management if they so chose to.Other than that the concert was joyful.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Blake M.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1331683200000,
        "ReviewContent": "We came for a Vienna Teng concert here. Wow. The acoustics of this place are amazing. The venue is lined with salvaged wood planks that apparently work magic on sound. Vienna's voice came across so crisp. And I have to say, the planks just plain look cool. The venue has an intimate feel so that every seat feels like a good seat. That is, unless you get there late and sit on a stool. You can get cider, coffee, hot chocolate, alcohol, and baked goods from the bar. Mmmm, cider.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Wendy H.\", \"AuthorLocation\": \"New York, NY\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1329868800000,
        "ReviewContent": "Several months ago, I decided to part ways with a musical group and strike out solo in an effort to develop as a musician.  When I sought advice from a mentor (who is a Grammy Nominated Artist) she said 'go to the freight open mic and start playing it whenever you can'.  I practically grew up going to the freight for my favorite live folk shows, so I figured I could give it a shot and see how I felt about it.  I now go to every one.  I am very fond of this venue.  The acoustics are fabulous and the history of the organization is honorable.  Along with my attendance of the open mic, I now attend more shows there and have been happy do discover many new and talented acts, most of whom I would not be able to see in any other locations.  The sheer variety of performances being held at the Freight demand that all music lovers take time to peruse the calendar and pick something to attend.  If nothing else, come to and open mic. Maybe you'll see the next big thing!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jim S.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1328054400000,
        "ReviewContent": "This venue is fantastic!! The design is perfect--I love the back lit wood paneling, reclaimed from their old building.  It's intimate, and there's lots of comfy seating.  I only wish there was a dance floor.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Lynn M.\", \"AuthorLocation\": \"Mountain View, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1326499200000,
        "ReviewContent": "I think the Freight is great. They give space to beautiful acoustic music in a comfortable, spacious setting. I liked all of the staff that I encountered-- good humored and engaging, even if it just involved selling me a tea. I really recommend that you hear some music here if you want to get a good taste of Berkeley at its best.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Lara W.\", \"AuthorLocation\": \"Stanford, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1325635200000,
        "ReviewContent": "Our first time at the Freight and Salvage, let alone Berkeley.  The bf took me to see my favorite singer/songwriter Vienna Teng.  She's from the area so she performs sort of regularly around the area, I hear.  Her show was phenomenal and they let you drink and eat the concessions they sell.  What a fantastic and intimate space.  If Vienna ever comes back, I'll be there.  She even stayed around after the show to sign autographs and speak to her fans.  She's a gem, as is this place!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Rochelle P.\", \"AuthorLocation\": \"Canoga Park, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1319414400000,
        "ReviewContent": "For my first time at Freight & Salvage Coffeehouse for a show, we went to the 1st Annual Hawaiian Music Festival with musicians and singers like: Dennis Kamakahi, Kawika Kahiapo, Weldon Kekauoha, Waipuna, Patrick Landeza, LT Smooth, Keale, Mahealani Uchiyama, Steven Inglis and Faith Ako - it SO rocked!!  I had never been to the previous location of F&S, but I love that this location is so easily accessible by BART.  Please note, all show planners need to be mindful that the nearby parking garage closes at midnight (at least it was supposed to that Friday), and the LAST BART train leaves at 12:30 AM.  I had to miss part of Dennis Kamakahi's performance because 1) it was getting really late and I could not keep my eyes open and 2) because I did not want to miss the last train back to San Francisco - or else we would've had to get a room somewhere in Berkeley, potential nightmare!  The coffee bar was open throughout the show, so that was nice to get some drinks and snacks, and you could munch away in the auditorium during the show too.  The seats were real comfortable - looooved that.  And the sound was GREAT!!  Can't complain.  I would come back to see another show, and I would recommend this place to see and hear great live music.  Mahalo!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Maile N.\", \"AuthorLocation\": \"Honolulu, HI\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1319328000000,
        "ReviewContent": "Freight and Salvage is a really nice intimate venue.  It's great to be able to see artist up close without having huge loudspeakers blaring.  People were even able to get up and dance.  My first experience here was really great and I look forward to seeing other unique performances here.  They offer all kinds of drinks from tea, coffee, beer to ginger beer, but make sure to bring some cash.  Overall a very nice experience here.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"anthony t.\", \"AuthorLocation\": \"Emeryville, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1311465600000,
        "ReviewContent": "The acoustics and comfort level are both so much better at the new location!I still have the same gripes about the staff, though.  I find them to be pretentious and annoying.  I feel that if you don't fit into a certain demographic (Berkeley folkie), they can be rude and look down upon you.  But VAST improvement.  Vast!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Karen R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1311120000000,
        "ReviewContent": "I have diverse taste in music and go to 6 or 8 shows a month, many more than most folks my age. I live in Berkeley. I seldom go here. Why?THIS PLACE IS SO EXPENSIVE THEY EVEN CHARGE FOR OPEN MIC NIGHT! That said, glad someone is still doing this kind of music. WISH I COULD AFFORD TO GO MORE.Also wish they'd include more interesting, innovative..weirder stuff (Sean Smith, Glenn Jones) but perhaps such would be too modern for the steady string of hippie oligarchy patrons (the eco-elite as another reviewer said) who can afford this spot.Admittedly, some of the high cost is due to the venue's choice not to sell alcohol, but I have put on many shows in my day and made the same choice without charging $18 for local bands. The whole situation perplexes me. They are obviously not greedy, and for the most part have a great vibe and a good reputation with artists, as well as the all-important good sound. WHY MUST YOU COST SO MUCH THAT IT BARS SOME PATRONS?Kw/K",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Kathy W.\", \"AuthorLocation\": \"Athens, GA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1310774400000,
        "ReviewContent": "Finally got to see the new digs when we went to see the Ditty Bops. Much nicer than the old digs.  Every seat has an excellent view. Now the reasons for only 3 stars. #1. Although this is probably not the Freight's fault, we we quite disapointed that the Ditty Bops' second set was extremely short, perhaps 4 or 5 songs at the most. They then deigned to give their highly appreciative audience only one encore, after which they walked off without even so much as a fare thee well. Granted they seemed tired from their daytime hike in SF, but still, come on ladies. #2.  Despite what some of the other commentors have to say here, the seats in the new theater are horrendously uncomfortable. For one, they have no armrests, forcing one to fold one's arms across one's chest for the entire show, or otherwide risking put one's arms (hands) somewhere where they shouldn't be. Secondly, the backrests are at the wrong angle, putting so much strain on the lower back that after a few songs I was ready to leave (only the great music kept me in my seat).  So watch out. If you have any back problems, find another venue; you will hate these seats.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Chaim S.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1309305600000,
        "ReviewContent": "One of my favorite places to go. A hidden gem.You can find cheap, great shows by talented musicians. The audience is always cool, calm, and respectful.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jessica H.\", \"AuthorLocation\": \"Santa Cruz, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1307923200000,
        "ReviewContent": "My review is based on the Music class \"de la Cuna a la Luna\" I attend on Thursdays. It is led by Jorge and is a Spanish immersion class in which he exposes the children to all kinds of musical instruments and songs from latin culture. I am a musician myself and educator myself, and I give this class two thumbs up! It is great for the music, stimulation, as well as the Spanish-speaking environment. (Jorge is bilingual so no worries if you aren't fluent!) It is also well-priced. The only negatives would be I do have to work at finding a parking spot before class. Be sure to give a little time for that. 2nd, I have a hard time getting them to answer the phone when I call with a question. You are better off emailing.It is a fantastic facility for classes- lots of clean, well-lit rooms. The bathrooms are easy to access and clean, too. (That's important with kiddos!)The lady who greets you at the entrance to the building is really sweet and friendly, too.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Christina D.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1303689600000,
        "ReviewContent": "Great concept. Big, clean comfy space. Good coffee. Wholesome fun in every way. Loved the House Jacks!!!!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Ralph K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1299801600000,
        "ReviewContent": "Great acoustics/sound. Smallish, still new interior which has comfortable padded chairs.Not as vibrant as it could be and the clientale tends to be ages 50+.They should try to entice and win over the younger crowd more with a more balanced calendar of more youth oriented acts.I'm not saying older isn't great but I want more balance of folk.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"May S.\", \"AuthorLocation\": \"San Leandro, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1295308800000,
        "ReviewContent": "I went to the West Coast Songwriter competition at the Freight last night.  It was great!  the sound quality was beautiful and I love the lighting.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Michael S.\", \"AuthorLocation\": \"Portland, OR\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1292112000000,
        "ReviewContent": "What a great music venue! So relaxed and open, feels like you're among family. The diversity and uniqueness of music shows is quite impressive. From bluegrass to classical and everything in between... there is certainly something here for everyone to enjoy and discover.  Check out their calendar: http://www.thefreight.org/eventCan't wait to return, get comfy, and experience some sounds I've never heard ...",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Rosie M.\", \"AuthorLocation\": \"East Bay, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1289520000000,
        "ReviewContent": "This is a great venue to see a band.  I saw Girlyman there and it felt like we were almost touching them.  They serve no booze, so be warned.Can't wait to go see Girlyman there again!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Kristin G.\", \"AuthorLocation\": \"Reston, VA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1287532800000,
        "ReviewContent": "I really enjoyed the performances that were held at this place. I performed my very first open mic at this venue and the acoustics are absolutely fantastic. Coming back just to be in a wonderful hall of  sound. Look forward to performing an original next. Thank you to my dear friend jane l. who encouraged me and helped me muster enough courage to do this! O, and this place has good hot cider, but $2 for a small cup.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Matthew K.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1284681600000,
        "ReviewContent": "Great venue for a concert. Small enough to be very intimate even when filled to capacity, yet big enough to feel like you're at a real concert. I love that they provide a stage for acts that don't normally get the attention from other venues. This is a great place.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Shane G.\", \"AuthorLocation\": \"Mountain View, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1282953600000,
        "ReviewContent": "THIS IS MY FAVORITE PLACE TO GO TO FOR LIVE MUSIC IN BERKELEY. as if that said everything. I saw my dear friend at open mic, and I was ROCKED. yes by her.. but the ACOUSTICS let you swim and MELT in talent.. it is AWESOME. the family-esque feel creates a super open safe space for artists and a breeding ground for community. the pricing is awesome. go to an open mic stay til the end, and FREE TICKETS to shows.. I saw and discovered my NEW FAVORITE there- Joy Kills Sorrow. Just when you think music is breathing its last breathe.. you find a revival of sounds and hidden gems at this place. I heart you. so sad I didn't find you sooner my dear freight.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"christina h.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1282694400000,
        "ReviewContent": "beautiful space, cozy atmosphere, great acoustics, friendly staff.  performed at their open mic for the first time last night and the crowd was mostly older mostly white so i felt a little out of place but they were all very sweet and encouraging.  no booze which has its upsides (no drunken tomfoolery) and its downsides (no drunken tomfoolery).  but it makes for some good clean fun and attracts people who are genuinely there to enjoy the music.  i was a little turned off by the $4.50 - 5.50 cover for the open mic but they give you a free ticket at the end of the night to any show of your choice in the following weeks which more than makes up for it.  i'll be back for sure.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jane L.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1280707200000,
        "ReviewContent": "Saw Dar Williams here on 8/1.  My husband is a huge fan and took me along for the ride.  We're from LA, and have been to quite a few acoustic music venues all over the country, so we have some context by which to judge.Positives:- Decent, not awesome, sound.  Vocals mixed too low.  Didn't knock my socks off like the acoustics at Old Town School in Chicago or McCabes in LA. But I am nitpicking; it was solid.- Good crowd.  What's the definition of a good crowd?  They shut the f*** up when the artist is playing.- Great sight lines.  Not a bad seat in the house. The chairs are  comfortable, too.- Close to BART.  It's a block and a half away from the downtown Berkeley station.  Whoever said it was a trek from the BART through a sketchy neighborhood ought to visit Detroit or Baltimore and get a reality check.Negatives:- A coffeehouse should have good coffee.- Leave the babies at home.  Why why do parents insist on bringing noisy babies to concerts.  I love kids, but it's annoying to pay $60.00 for tickets and listen to baby noise. Next time it happens I am going to ask for my money back.  It's selfish for those parents to (1) bring their kids out late at night. The concert ended at 11:00.  Those parents should be ashamed of themselves.  Kids need to be sleeping in their beds and (2) it's rude to the other patrons sitting around them.  Enough already!- No bar.  It's nice to enjoy great music with a beer or glass of vino. Note to management: put the bar in the lobby, not in the performance hall.  And cut off sales when the artist plays.If you like folk / americana music this is a really nice venue and the people who run it have a commitment to the artists and and fans.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Bunnie T.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1277769600000,
        "ReviewContent": "Freight & Salvage is one of my very favorite live music venues in the Bay Area. It's an accessible and comfortable space and they bring in a number of \"big\" artists in the folk and bluegrass scene. Rhonda Vincent, Girlyman, Dar Williams... It's very easy to get a good seat at most concerts and, in fact, there isn't really any bad seating. I will say that I miss the homey feel of the old Freight & Salvage - as if we were congregating in someone's old barn for a concert where the musicians and audience practically talked to each other. Maybe they need a little more creative lighting. I don't know. But it's still a great deal and their programming is just great.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Susan S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1271808000000,
        "ReviewContent": "Fun place to go for open mic.  Comfortable seats, easy access, free if you're with someone singing or playing (we were, yay Ed!), and good acoustics.  No alcohol but the coffee was good......",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jan C.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1270944000000,
        "ReviewContent": "We were in the Bay Area to see the Giants' opening home game and decided to catch Robbie Fulks at the Freight and Salvage in Berkeley.  Fulks is damned good.  Think Hank Williams' vocals, Doc Watson's flatpicking, Todd Snider's humorous/serious songwriting, and David Letterman's ironic, biting commentary between songs.I liked the Freight & Salvage as a music venue -- great sound and intimate seating. Warning: They don't serve alcohol.  (For a real treat, sneak in a flask of hooch, spike your coffee or peppermint tea right in front of everyone, and watch the judging commence.) The audience at Freight & Salvage reminded us of the public radio hosts of the Saturday Night Live skit called \"The Delicious Dish.\"  \"Good times.\"\"Yeah......good times.\"   The kind of audience that appreciates it when a group of Puritan Connecticut Yankees like The Weavers turns a darkly ominous song like Leadbelly's \"Goodnight, Irene\" -- which is about sexual obsession evoked by jailbait, with suicide and murder as potential side-dishes -- into a lullaby.  Replace \"I'll get you in my dreams\" with \"I'll see you in my dreams.\"  Good times......good times.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Buzz F.\", \"AuthorLocation\": \"Redding, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1268784000000,
        "ReviewContent": "The best place in the entire SF Bay area to see live music!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"NorCal D.\", \"AuthorLocation\": \"La Jolla, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1265500800000,
        "ReviewContent": "Okay, for starters I never thought I would go see americana/ folk bands, but we had a great time!  We went to see Dr. K's Home Grown Roots Revue series: Misner & Smith, Three At Last, Family Lines.  No, we aren't aging hippies (power to the peaceful), though one of our group is a country fan, the rest of us came up on punk and hardcore.  Nevertheless, we had so much fun here and will definitely be back.  Reasonably priced at about $14, comfortable seating, pretty good acoustics, clean, friendly, good decor.  At first I have to admit I was a bit skeptical about a music venue sans alcohol, but we had a blast anyways!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Maria Z.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1265068800000,
        "ReviewContent": "Oh how fun!  More than community theater.  Less than super high budget performances. Serves coffee, tea, cookies (vegan ones too!), hot cocoa, and the like along with your performance which makes you feel very cozy.The chairs are VERY comfortable and clean, and the whole place is classy modern with an environmentally friendly twist.I went with my family to see \"Dr. K's Home Grown Roots Revue series: Misner & Smith, Three At Last, Family Lines-harmony-rich americana/folk music\"  The premise of the show is that if you like one band, you'll like them all.  I found this to be very true.  By far my favorite group was Misner & Smith (http://www.reverbnation.com/misnerandsmith)Their CD is in my car that plays over and over until I get to my destination.  They have 2 albums and I have the first.  The Dr. K Show was a great place for all the groups to showcase their music and the audience was really receptive and supportive and in general it was a lot of fun.  Tickets were really reasonable for the high quality of experience, $14.50 pre-sale, $15 at the door.  We had no trouble getting tickets at the door.  Only draw back (as is normal for Berkeley) is parking, but there are a few lots near by and I think it is worth the extra $5 to not be hunting for Downtown Berkeley street parking.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Susan C.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1263513600000,
        "ReviewContent": "Ok. So.  This one will tip my street cred because I write positive reviews for some places that others disdain, but I do not mind.Freight and Salvage is a coffee house that has enjoyed 3 locations since its inception in 1968.  It is now directly across the street from Berkeley Rep just a block or so from Shattuck Downtown Berkeley Bart.The new setting is classy, but it still retains a warmish feeling inside, with comfort and a great staff.There is a young woman with short hair who was worth the price of our tickets to see Glen Phillips and Grant Lee Phillips last evening, for she is one of the front staffers and more talented on stage than many performers in this wonderful world.  Funny and good timing in her delivery of the description how she loves that the new carpet doesn't surround her with a burst of dust when she goes to the microphone.  I loved her description of the upcoming events and the show had not even begun.  The bar serves a limited menu but home made cookies and brownies, beverages.  We were very very pleased that halfway through the show it was mentioned that people should not be videtotaping.  We had one woman just in front of us who almost taped Glen's entire show.  We hoped her battery would die but alas, she has some sort of future digital device that keeps on giving....The restrooms are in two locations, plenty for everyone.Everything is convenient and clean and the staff extremely knowledgeable and helpful.  I highly recommend this venue as a newly done coffee house that with its warmth and the enthusiasm of the returning fans, makes up for not being a small typical coffee house spot.  The doors were opened well before 7, they allowed people to choose seats for the 8pm show, and I have already invited others to join me for some shows. Bear with me as I have never been to F&S nor have I heard the two artists in the show, having been living overseas for years in the 80s and 90s.  My dear cousins turned me on to both of them, who were amazing performers, and of course I have fallen in love with their music and turned to my iTunes post haste.The intimacy came in here, not related to the newness of the new digs, but to the design which was so well crafted to have a closeness for the audience and the performer for interactions.  There is a comic component to the Phillips/Phillips performers that was rendered very very effective because the people are up close.One comment I would make is that it appeared some very young people behind us were not at all reprimanded for disrupting the program.  All of Berkeley was outside for them but they chose to stay and no one approached them because we were all so interested in seeing the show.Walking to Bart from my place at Lake Merritt and from Bart in Berkeley to the theatres represents a whole new way to spend my money and I surely will.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Ellen O.\", \"AuthorLocation\": \"Las Vegas, NV\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1258243200000,
        "ReviewContent": "There aren't too many places like this around, a smallish venue that serves coffee/tea and has really good live music.The Freight's new digs kind of takes it out of the \"smallish\" category, but that's easily forgotten.  Its new arrangement, in theatre-style seating, however, means that if you bring coffee back, you have nowhere to put it, unless you're sitting right next to one of the rare tables.Oh, another note:  they say on their website that they open doors at 7pm.  They don't.   Also, their sound system, while brand-spanking new and totally up-to-date, seems temperamental.  I could tell that the onstage monitors weren't working well (if there were any), because the pianist had a hard time following the guitarist.  I imagine they'll work those issues out.I suspect every seat is great, and for live entertainment, I found it fairly cheap.  I noticed, however, that it wasn't sold out, and because of all the new seats, I suspect they rarely sell out.  They somehow need to find a way to get butts in the seats.The chairs, by the way, are a far cry from what they had before:  they're padded and wide enough for even the larger butts.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Linda B.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1256342400000,
        "ReviewContent": "We went on a Friday to see Chris Smithers, with Tim Erikson as the opening act. The new hall looks modern, although the reclaimed boards stuck on the side walls try in vain to give a rustic feel. The seats were very comfortable. We arrived way early and sat in the front row. The sold out show was fine. Surprisingly, I liked the opening act a lot more than Mr. Smithers.The crowd is mostly aging white Berkeley, with Birkenstocks and grey pony tails. The were polite and restrained in their response to the music, tapping their feet, but no dancing. I get the feeling they would ask you to leave if you did that. The line for the coffee bar was too long, so I can't comment on the quality there.  The acoustics were good (I listened a while from the back) throughout the hall. If you like the artists, this is an ok place to see them. You will be surrounded by old hippies.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"brian b.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1253059200000,
        "ReviewContent": "My trio came out for the first open mic hosted at the new location. This is by far the nicest open mic venue to play at. Hands down the nicest stage I've played on. The people are nice. Acts are a good variety mostly acoustic and a lot of original material. Some better than others. Suzanne was a nice host and moved things along very well. Would have been a 5-star if it weren't for the following. Lighting - Too bright on stage you can't see your audience. Sound - Great equipment. I'm sure they'll learn how to use it. There was no or little monitor mix on stage yet they have 4 or 5 monitors. This made it hard to hear ourselves esp our vocalist and we had an electric bass which couldn't be heard at all on stage. Bass players bring your own amp or you won't hear your part.Only two inputs for instruments but there were plenty of mics on stage. Don't move 'em around though. They don't seem to like that. You have to pay to get in which is fine esp since it is a first class stage. The coffee and snacks are a little pricy they could consider lowering those items since people are already paying to get in. I'm not much of an open mic fan but this place has the potential to be one hell of a place to get some original talent exposed. They could bring a good draw but just need to work on the stage sound a bit. The sound from the audience's perspective was fine.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Kevin B.\", \"AuthorLocation\": \"Livermore, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1236643200000,
        "ReviewContent": "Ok.  I know this post is a bit much, but it's one of those I just have to share.I love all kinds of live music, from folk to blues to thievery.  And I appreciate musicians who continue to play music because they love it.  Maybe my friend and I went on an off night (a Friday?).   And maybe we had suddenly slipped into a parallel universe.  But oh my GOD!  I don't appreciate being charged a cover to sit on folding chairs, with no bar, to watch hippie dudes playing out of tune guitars singing off key the most terrible rendition of songs they seemingly wrote while stoned - at age 12. The freakiest part?  The entire crowd (ahem - crowd of 30 people) was nodding along and slapping their knees and getting into it.  It was the first time in my life I thought I was on candid camera... that the joke was on us... and this was all a ruse. Once I realized that it wasn't, I was seconds away from (again, another first in my life) the loudest and most inappropriate outburst of laughter in the middle of somene's performance.  The feeling of my body convulsing in uncontrollable laughter began to take over my system, but I was torn between that and the rudeness of getting up *in the middle* of his performance and being just as obvious.So I leaned into my friend's shoulder and commenced what I've coined the \"snaugh\" - which is a sneeze, a cough, and a violent laugh all mashed together.  I was horrified.  I couldn't stop.  I was crying.  I was helpless.  By the time the song was over, I was hysterical, in the craziest sense of the word, and we barely made it outside before I fell to the ground in a display of entirely involuntary and uncontrollable fits of hyperventilating laughter and diaphragm spasm, and near asphyxiation. My rational mind was awed by my inability to take over the controls of my own physical system, and to this day I have not had an experience remotely close - and I doubt I ever will.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"J. S.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1236556800000,
        "ReviewContent": "Can't believe I've never been here before.  Went to see a former employer play with his new band.  A great time to get together with old colleagues and catch up and see someone you knew in another context, perform and do it well!  The whole vibe of the place is great.  Easy going, happy, positive.  I like that it's a non profit also. It's reasonably clean, funky seating, but a great place.  Nice people!!!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Ron T.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1234742400000,
        "ReviewContent": "The Freight and Salvage rocks.  They are a small local and independent music and coffee house.  They support community and independent arts. I've seen several shows there - the acoustics are fantastic and the ambiance is sweet - there are white holiday lights strewn about the interior of the barn-like room.  It's simple and charming.  I hope they maintain the charm at the new location - they will be relocating closer to downtown Berkeley this fall.  There is a delicious coffee bar for snacks and cocoa, coffee, tea or cider.  It's street parking only so can be a bit tricky; take transit, bike, or ride-share if you can.  And enjoy the show.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Anj M.\", \"AuthorLocation\": \"San Luis Obispo, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1229126400000,
        "ReviewContent": "Typical Berkeley...hippy and local! You enter through ply board doors to a room filled with thrift store torn diner seats. Went to see Kenny White (a political musician) and had a great time.  It's a great location to see local artists, poetry readings and just music.  Would go again.VEggie Friendly: Yes- They have pastries, finger snacks and a coffee bar.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"ashley l.\", \"AuthorLocation\": \"Stockton, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1214697600000,
        "ReviewContent": "This is my favorite place to see live music these days.  I like to tag along with my husband to see the best open mic talent that you can find in the East Bay, usually on a Tuesday night. Great coffee and delicious cookies and brownies brought to you by Zoe's Cookies. Yum! Lots of different types of music to find here and people seem completely respectful of that talent. Maybe it also helps that they don't serve alcohol! Ha Ha",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Christina G.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1214697600000,
        "ReviewContent": "The open mic here in my opinion is the best. I have been to a shit load of them up and down CA and by fare you meet the nicest people who actually listens to you. I go to shows when I can at this place they usually ave great guys working to sound.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Mike R.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1213833600000,
        "ReviewContent": "I saw The Animators and Vienna Teng here. Honestly, I have no idea how I managed to find this place with my friend. It was when I didn't know the area well yet, and my friend and I took bart from Fremont, got off Ashby, and managed to wander through the darkest creepiest neighborhood to find this place. We were also stopped by a group of about 8 teenage boys (who were all taller than us); although we were older than them (we were 19 at the time), it was still a bit scary just because it was at night, we had no idea where we were, and we were merely tiny little Asian girls.I remember this place being super small and informal. The set up was just a bunch of chairs in rows. Very cramped space.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Angela H.\", \"AuthorLocation\": \"Canberra, Australia\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1212192000000,
        "ReviewContent": "Every single time I go to the freight I love the music and I am thankful there is a venue right here in Berkeley for music that would normally not have a huge audience.I am hopeful that when construction is done on the new location and the Freight moves further towards campus on Addison they will be able to maintain their rustic feel and access to bands who may have smaller draws.  At the same time I fear that the larger & more expensive venue will change the atmosphere and force the Freight to focus on bands with larger audiences.  This would be unfortunate, but we shall see.The concern notwithstanding, it will be nice to have better seats.  :-)",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jonathan D.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1209427200000,
        "ReviewContent": "It almost doesn't matter what show you pick to attend, you will see and hear a good show in an intimate atmosphere. There will be some humor involved, and some electric guitar may even be heard.But, don't fear the banjo.  Really- get beyond that.The seating is not the most comfortable for my 6' 2\" frame, but there is always an intermission, so I survive.  Country boys can survive.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"John L.\", \"AuthorLocation\": \"Columbus, OH\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1208736000000,
        "ReviewContent": "Years ago my father was the MC on open mic night at the freight. Sopping wet wit, a great stylized fingerpicking blues/bluegrass and an old beatup looking guild guitar that reverberated out 35 years of music every time you thumped it. He fit the freight just about perfect.Berkeley houses a lot of great folk/blues/bluegrass/etc talent and the freight is one of the places they gather (performers also come from far and wide). So the music is really top notch. One more side note... my dad used to collect up a bunch of the brownies and cookies at the end of the night, head on over to Flints BBQ and trade a bunch of them for a robs/links plate. Then he would ramble home and find me still awake, at which point we would share a BBQ and Brownies. Obviously nostalgia probably clouds the hell out of my judgment on the brownies, but those dry little light brown nuggets taste like ambrosia somewhere in the depths of my mind - especially dipped in hot sauce.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Zeke S.\", \"AuthorLocation\": \"Santa Clara, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1208044800000,
        "ReviewContent": "This is a great place to see live music.  Very small, great snack bar, wonderful sound.  I am always entertained when I go here.  Love the line up.  I love taking my son to the shows here.  The audience is very welcoming to kids.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Jen W.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1206230400000,
        "ReviewContent": "It was my wife's b-day last night, so I surprised her by taking her to The Freight to hear some bluegrass.  Doors open at 7:30 and there was a decent line down the street for advance ticket holders. Nell Robinson and the Red Levels has a good Berkeley following, and they packed the house.  Their mandolin player can pick with the best of them. The occupancy maximum is about 240, and they exceeded it, I think. Folding chairs are pretty uncomfortable, but there are a few that are padded, which the cheesy patrons swipe and re-arrange before the show.  I assume the new venue in downtown Berkeley will be more comfortable..that's the only complaint anyone could make.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Tim C.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1203379200000,
        "ReviewContent": "Freight & Salvage is definitely one of those \"Only in Berkeley\" type venues - a non-profit, community based coffee house that also happens to host some amazing live music. The acoustics are awesome, the coffee...not so much.  If you are the type of person that must drink while at a show you might want to look elsewhere - this is a dry venue and as much as I like to drink (ok, I LOVE to drink) it was refreshing to see a sold out house there to enjoy the music instead of shouting out \"FREEBIRD!!!\" drunkenly every five minutes.While I don't see myself becoming a regular here (after all, it is across the bridge) I wouldn't hesitate to return to Freight & Salvage to catch one of my favorite artists.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"phil h.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1203379200000,
        "ReviewContent": "This is a small, intimate venue with no bad seats in the house... there are even some random tables scattered here and there for putting your coffee, herbal tea, hot apple cider, and sweets down on... You should know this place is dry (as in no booz), so something to keep in mind. GREAT place to see music you love.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"beth l.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1202774400000,
        "ReviewContent": "I love this place.  It makes me sad that they're moving to another location.   It's a great space.  It reminds me of some of the performance spaces in downtown Manhattan.  I saw a big band concert here this past Saturday and loved it.  First time seeing a big band concert,  I learned quite a bit of history that night, and the music was great.  It's an intimate space so there's no bad seating.  We sat in the second row, the seats were comfortable, we even had a table nearby for our drinks.  They sell coffee, teas (herbal and caffeinated), cookies, etc.  I found everyone very helpful and friendly.  it was a lot of fun and a great evening.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Magdalena ..\", \"AuthorLocation\": \"Boulder, CO\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1188172800000,
        "ReviewContent": "If I had to choose between seeing Cold Play on a jumbo tron in an ice hockey 'pavilion' or seeing Dan Bern at a coffee house and asking Dan from the front row, 'Dan, play God Said No' and then have him smile and say  'No' and getting a laugh from the crowd... hmmm which would I choose?I don't know, that's a tough one.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Michael R.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1184976000000,
        "ReviewContent": "Beautiful!! I had the pleasure and honor of playing here last night, opening for Blame Sally (an amazing local band whom I adore). I had heard this place is legendary, with amazing sound and history to match. It surpassed my greatest expectations - gorgeous sound system, and a warm, cozy vibe. It isn't really what I'd call a coffeehouse in the traditional sense, but it does have a coffeehouse atmosphere, despite it's large size. It seats 250 people, and it seems everyone has a great view of the stage. Gorgeous venue, both for the performer and for the listener.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Robin G.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1182297600000,
        "ReviewContent": "They do have a monopoly on a lot of great acts, but if the act you're hoping to see is playing anyplace else, go there instead.  No alcohol. Uncomfortable seating. No space for dancing! They over-sell their shows. I've seen little old ladies forced to jockey for standing room in the back of the \"theater.\" There's also a long line to get in before the show starts. Able-bodied audience members only, please! And - it's not a coffeehouse! When is it EVER open except for when people are performing?  People go here for the great performers, but I don't understand the genuine affection a lot of people hold for this place.UPDATE:And now they're taking over the downtown Berkeley Capoeira studio, which was a thriving, all-day, all-ages community center. Like downtown Berkeley needs yet another place that targets white, boomer clientele. I'm disgusted with the City of Berkeley for letting the capoeira studio go.  Well, the good news is that the Freight and Salvage will be allowing alcohol at their shows, but supposedly only at intermission. Fortunately there are bars all over the neighborhood.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Beetle B.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1182297600000,
        "ReviewContent": "I've just been to open-mic night - it was friendly, down-to-earth, disorganized, had some hippy crap but also some decent stuff....  It's exactly what I'd expected from a non-profit coffeehouse in Berkeley.  (Comes completes with begging crackheads outside after the show.)  I'll definitely go back to the open-mic - and if you stay til the end, you get free tickets to shows.Wayyy better than fancy, tightly-run venues in SF, in my opinion.  :)",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Beth B.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1181088000000,
        "ReviewContent": "i love the freight!  it feels like a home, a musical home away from home, to me.  i give them four stars because they regularly feature musicians that i really want to go see, folks that don't turn up at other places and who i love-- Patty Larkin (witty modern folk/rock), Mike Marshall and Hamilton de Holanda (mandolin masters), Chris Smither (acoustic blues), Mary Gauthier (singer/songwriter of spare songs that quietly break you heart.)folks there are warm and welcoming, and the sound is pretty darn good.they are just affordable enough for me to keep going back: $15 to $30 for an open seating ticket.  they are just accessible enough, too-- no steps, and with rows of armless chairs that can be moved around to maximize seating room.  that said, those chairs aren't very comfortable and need an upgrade!they cheerfully sell bottled water and soda, cookies, snacks and coffee/tea.  there's also water available for free in cups, which i appreciate.sometimes there's an uptight \"eco-elite\" crowd in the audience, who push all my buttons and make me cranky.  management not responsible, i'm sure!i look forward to seeing their new digs when they move.  i hope it's even more accessible and a more comfortable venue.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Holly H.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1181088000000,
        "ReviewContent": "My girlfriend takes me here for shows on a semi-regular basis, for which I feel pretty lucky. It's unique among music venues in the bay area, for sure. Where the hell else can you see Chris Smither AND mandolin master Hamilton de Holanda? And while rubbing shoulders with the Berkeley's eco-elite, no less. That's the downside. The crowd varies from show to show, sometimes it's fine and sometimes I feel slightly uncomfortable surrounded by all the thin healthy white people. Your  mileage may vary.The seating is about 75% armless, movable chairs. Which is especially nice if you're on the wider end of the spectrum. You can be pretty comfy there, fat or thin. If you want to sit anywhere close to the front. you need to get there seriously early and line up ouside. I recommend bringing a chair for this activity. Perhaps your submissive can take the chairs back to the car after you've gone in to get the good seats. If you show up later, you will definitely be sitting in the back. Which is pretty ok, as long as you're not on the part of the floor that slants backward.  Yeah, the space could use some work, but they're moving soon to a new location, I hear. Fat friendly rating: 4 stars.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Max A.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1179619200000,
        "ReviewContent": "This is a great coffee house. Acoustics aren't top top notch, but what the heck, it's a coffee house! I saw Ellis Paul and Antje Duvekot here, and their vocals blew me away, who needs Bose?The space is very homey. Unpretentious. Good, mellow crowd. And spacious, not like Postcrypt (bonus points to those who know what I'm talking about!)",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Kevin K.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1178409600000,
        "ReviewContent": "One of the last best places to make a true connection with the people who create our musical history, both past and future.  This is my home away from home, I always feel like I'm heading across the Bay to my other living room to get cozy with the people whose music I have loved or grown up with or just discovered or haven't heard yet.  Where else can you wait on line for the bathroom with the All-Ireland Championship fiddler (Liz Carroll), or shoot the shit with Ramblin' Jack Elliot while he changes his socks, or have conversations with any of the performers while they're on stage 6 feet away from you, right in the middle of a set?  Only at the Freight.  And to top it off, the tea's organic, the vegan cookies are the size of your head, and you can dance in the aisle by yourself if you feel like it (well, ok, it IS Berkeley, you can pretty much do that anywhere, but it really is cool with everyone here).  I love it here, it is truely home-sweet-musical-home.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"gypsy v.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1161907200000,
        "ReviewContent": "Great history.  Good acoustics.  Good booking.  And yes, a decent sound system, but I was at a good show Thursday night with a 13 piece band that was seriously flawed for me because the manager of the Freight and Salvage had gone and hired an incompetent sound guy.  How can you hire a sound guy who doesn't know what he's doing (and shows up 1 1/2 hours late for sound check, from what I heard from the musicians) for a 13 piece band?  That makes no sense, unless you just don't give a crap about the bands that you book.  I'd like to give 1 star for this, but again, this place does book some great acts, and hopefully the manager has better sense than to ruin good bands' shows by hiring terrible sound guys on a regular basis...",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Dirk D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1159056000000,
        "ReviewContent": "Great ecclectic set of talented artists, friendly crew, fine sound system.  Okay, so it doesn't have a very intimate feel (I agree with the \"barn\" description of another poster), and the chairs feel like, well, folding chairs.  And yeah, there's no alcohol sold but, sheesh people, must y'all drink *every time* you go out?  Have a coffee or juice fer cryin' out loud and just enjoy a natural mellow without the booze and whine, eh? ;)Other stuff:  easy parking, reasonable ticket prices, not far from the freeway if I remember correctly and not too hard to get to via public transit.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Adam L.\", \"AuthorLocation\": \"Mountain View, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1158451200000,
        "ReviewContent": "This place has history for me and my family.  My dad is the beacon of Bluegrass in our family.  He brought my sister and I to many performances at the Freight.  My sister actually met her husband at the Freight.  He was playing guitar for Frank Wakefield at the time and now they are married with 2 kids.  I took my husband on our first date to the Freight to see one of my favorite Bluegrass bands: Dry Branch Fire Squad.  First dates need alcohol and knowing that the Freight only serves coffee, we hit Lanesplitters pizza right around the corner first and had some excellent pizza and just the right amount of beer.  It obviously all worked out for us.  I even volunteered for them for awhile and got to hear some wonderful folk music for free and give back a little to a place that had given my family so much over the years.  You can't beat it!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Tracy A.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1153699200000,
        "ReviewContent": "Five Stars - for sticking to their vision since 1968. From the website:\r \"The Freight & Salvage Coffee House is a nonprofit community arts organization dedicated to promoting public awareness and understanding of traditional music -- music that is rooted in and expressive of the great variety of regional, ethnic, and social cultures of peoples throughout the world. \"\r While it looks like somebody's converted garage and the seating is not great, the sound system is excellent and the range and type of performers are (literally) all over the map.\r (Note - They're moving to a location near or next to the Berkeley Rep. theatre.)",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Nancy W.\", \"AuthorLocation\": \"Tacoma, WA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1152057600000,
        "ReviewContent": "I heard about Freight & Salvage when saw a friend's Mizrahi band play there. It's a great venue for hearing music you may never have heard of before. They are planning to move closer to downtown (near the theaters on Addison) so keep your eyes open for that.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Arun C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1146787200000,
        "ReviewContent": "Ok look. I was in a bad mood when I got here because I had been on what might be one of my most spectacularly bad dates ever (he lived with his sister who worked for Haven Humane Society & he told me that the only humor in their house involved animal euthenasia jokes, NO I AM NOT MAKING THAT UP PEOPLE!) I told him I had forgotten that it was my friends Birthday and hightailed it outta there.And ended up here. Where there was no alcohol to ease my worldly pain. Ok, why don't you people serve alcohol here? What are the alcoholics supposed to do? I'm not saying I'm an alcoholic, and I'm not saying that I can't enjoy music without it....but on this particular occassion I couldn't (on account of the crazy animal hater date)The music (Kiki Smith) was good, very innovative. Not really a fan of the folding chairs, but I like the barn atmosphere. That's really the most accurate description. Like you're at a concert in a barn. Because you are. And they don't serve alcohol. So it's like you're at a concert with the amish.Yeah, it's like that.Sorry. I was in a bad mood. I support the local music scene, I swear.I support it more when they serve alcohol there though.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Elissa D.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1146268800000,
        "ReviewContent": "The Freight and Salvage is a very low-key place to see acoustic music.  It's BYOB---well, they don't sell alcohol and probably don't want you bringing in your own, but I have great memories of sneaking in a nalgene full of wine (one of the clear ones... we didn't really think it through) and proceeding to get crazy.  There's something just a little too staid and grown-up about their sit-down folky shows.  I gotta give props to those individuals who don't care (or don't seem to realize?) that they are at a seated show, and dance up and down the aisles on acid or whatever.  That's what I would do if I had the balls.\r P.S.---Why is Yelp telling me that I might also consider the Bamboo Hut?  I can't think of anything else further from the Freight and Salvage...",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Emma K.\", \"AuthorLocation\": \"Bozeman, MT\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1145232000000,
        "ReviewContent": "Why didn't I know about this place in time to catch Willy Porter? Willy, please tell me you will return, not just to the Bay Area, but to Freight and Salvage. Because this place rocks! And folks. And blueses. OK, now I'm just making up words. But they deserve it. You can't help but feel at home here. It's like your friend set up a stage in his barn (if you happen to have a friend who has a barn.) The sound quality is fabulous. I wish they had espresso drinks but I suppose that horrible milk-steaming sound would distract from the great music.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Maya S.\", \"AuthorLocation\": \"Denver, CO\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1140307200000,
        "ReviewContent": "The Freight and Salvage is the #1 Bay Area stop on the Folk Music and bluegrass circuit. The performers on this circuit are rarely household names, but some world class songwriters and pickers turn up regularly. Loudon Wainright, Cheryl Wheeler, Eliza Gilkyson, Tracy Grammer, Ralph Stanley, David Grisman, Mike Marshall are pretty well known in the folk world. And some outsanding lesser knowns like Harry Manx, Vance Gilbert and Claudia Russell have performed some really great shows there.Open mics a couple of times a month draw the local singer-songwriter crowd and give them a place to get their feet wet on a professional stage.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Bruce K.\", \"AuthorLocation\": \"Point Richmond, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1126224000000,
        "ReviewContent": "Truly a local (national?) treasure. Down home, no frills attraction for some of the best folk, bluegrass, and other distincly American genre musicians. Obviously the artists love playing there and that joy is shared by the audience. Most times the artists will hang out afterwards to sign CDs and share a cup of tea or the like. Have seen many great concerts there and would recommend it to like minded music lovers everywhere!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Eric P.\", \"AuthorLocation\": \"Hollywood Hills West, Los Angeles, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    },
    {
        "ReviewDate": 1119916800000,
        "ReviewContent": "All acoustic music, for about $20 and a place to sit down. What could possibly be better? One of my favorite music venues.  They are dry (no booze), so only get to listen to the music...",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Freight & Salvage Coffeehouse\", \"AuthorName\": \"Joe K.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Freight & Salvage",
        "venue_id": 19
    }
]