[
    {
        "ReviewDate": 1712361600000,
        "ReviewContent": "I've lived my Albany all my life and never went in here. It's a fun little venue. Good vibes. And on top of that, they had my favorite rum. Couldn't ask for more.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Frank D.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1707523200000,
        "ReviewContent": "Love this place! I have seen so many shows here, across a wide range of genres. The bartenders and staff are always friendly. This place is a treasure! If Albany is an oasis, the Ivy Room is its Casbah!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Scott M.\", \"AuthorLocation\": \"Santa Rosa, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1701820800000,
        "ReviewContent": "Always good live music, used to live nearby but it wasn't my go to bar, no pool tables but a good music venue",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Chris S.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1701734400000,
        "ReviewContent": "Dive bar with good bands. I hear Green Day often plays here. Saw steely  dead here. The sight lines are awful so there are 2  TV's. If you get in early you can see the band live but a seat at bar or in the back is not enjoyable. The single bartender with his butt off",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Robert F.\", \"AuthorLocation\": \"San Ramon, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1692576000000,
        "ReviewContent": "Wonderful place with the kindest owners - so grateful to have a friendly live music venue like this in our area!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Jonathan G.\", \"AuthorLocation\": \"West Berkeley, Berkeley, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1691798400000,
        "ReviewContent": "What a lovely place to see a band.  Great sightlines, good sound, reasonably priced drinks, plentiful street parking.  We'll be back!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Jeff D.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1689033600000,
        "ReviewContent": "Woman owned / queer positive space. Excellent staff and an all around welcoming and inclusive venue.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Shaun O.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1686355200000,
        "ReviewContent": "Cancelled show an hour before doors open. Thanks, glad we got that baby sitter. Not going to be back. Only found out because I randomly checked website.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Mike B.\", \"AuthorLocation\": \"Napa, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1683331200000,
        "ReviewContent": "The Ivy Room is an awesome live music venue! We've seen a variety of local bands here and it's always a blast. They have a great selection of beers on tap and a few mixed drinks on the menu. I highly recommend the Poison Ivy - it's a cucumber concoction that tastes amazing. My husband raves about the fact they have Death and Taxes on tap too. Definitely bring earplugs because the music can get loud. If you forget yours, they have some foam earplugs for sale at the bar.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Michele O.\", \"AuthorLocation\": \"Martinez, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1682812800000,
        "ReviewContent": "Since one of my bf's best friends was visiting us from out of town, we took the chance to check out the Ivy Room to kick off our night out together. I've heard great things about this bar for several months now, and actually checking it out exceeded all of my expectations.Ivy Room is THE community dive bar in Albany, hosting a rotation of local artists almost daily-- on nights with performances, the bouncer collects a small cover fee. We happened upon Credit Electric during this time, a bay area dream pop/indie band. All adult ages welcome.The bar area's compact, crammed full of folks ordering drinks, pushing back and forth from the second room. REALLY need to elbow your way in to get any bartenders' attention-- but once you're there, the staff are incredibly kind and quick to get you what you need. We picked up a few beers and hurried over to the stage to avoid getting trampled. Fortunately, the stage area was relatively spacious-- ample back area for folks to stand, with a strip of seating against the wall. As the band was setting up, the three of us took the chance to check out their photo booth in the back to commemorate our first visit here :-)During the performance, sound quality was surprisingly good. We could hear the vocals and instruments with minimal distortion and interference from the crowd, all throughout the room. Even the crowds were friendly, seemed to mind their own business (no creeps). We didn't expect to, but we stayed until the end of the set before heading off to the next bar.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Emmeline W.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1682467200000,
        "ReviewContent": "Have been to the Ivy Room many times over the years but this may have been my first time going there when they had a band. Great band and plenty of room to dance! Tammy's Camaro was the band.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Mike P.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1678665600000,
        "ReviewContent": "Check out the webite for show dates but there is music here most days. When you walk in, there's the bar. Then you round the corner to see the stage. The reason I mention this is that you can have a conversation with someone at the bar without the music pounding you so you can't hear who you are talking with",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Brian S.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1678579200000,
        "ReviewContent": "This is up there on the list of dive bars. Sound system is good enough for live music and the bartenders are super friendly. Easy to park, safe neighborhood ....great crowd. This is too cool for city people. East Bay to the bone.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"T M.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1678492800000,
        "ReviewContent": "Great experience for my first visit attending Black Sabbitch concert. The staff went above and beyond to accommodate my Handicap needs with a reserved table. Would recommend if you want a cool place to hang out for live music that this place is a must for locals and tourists.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"E H.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1676505600000,
        "ReviewContent": "Laid back crowd, good bartenders, diverse. No problems, live music that does not suck.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Victor L.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1671580800000,
        "ReviewContent": "This spot in Albany boasts of nightly music with local bands. They have tickets that you can buy ahead of time or at the door. For a measly $10 you can see 3-4 good local bands and support local thriving artists. What I like most about this place was this feeling of community with bands, all of them supported each other and some even shared the same artists. It was truly something I hadn't seen before with bands pumping each other up. Each band was diversely different but the music was always entertaining. Th service is also great with the bouncer being welcoming and the bar service being quick. There isn't a crazy rush to the bar or stage like most places with everyone resourcing personal space. Parking is street and easily available. This institution is great for an evening of music.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Smrithika A.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1665187200000,
        "ReviewContent": "I have been coming to the Ivy Room for a few years now. It is truly one of the best music venues in the bay area. The owners are wonderful people and the space is perfect - small venue so you can enjoy the bands up close and personal.They have a really nice bar. The bartenders are always great. Last night I let the bartender choose my whiskey and she picked a winner. Drink was delicious and not overly priced.Parking is usually relatively easy especially compared to San Francisco. Crowd is eclectic and always a bit different depending on the band, but always friendly and warm. I think a lot of neighborhood people go there. I'm so happy that they have managed to survive Covid. I know it was touch and go there for a little bit and I encourage people to go there and see live music. It's so worth it.!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Lisa F.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1651795200000,
        "ReviewContent": "Saw a few bands here over the years. Recently saw H.R. from Bad Brains. Was such a great show. I love how they get such cool acts to come through. I stopped drinking, but I remember they have great, fresh beer and rotating taps. The water I had this time around was good. The doorman was cool too...guy with a septum piercing. He looks familiar.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"J R.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1646956800000,
        "ReviewContent": "COMPLETELY lost me on the literal dumbest \"covid protocol\" ever. Put a mask on to order a drink... from the other side of the bar? Hello??, You follow when they say put it on but not when they say its cool to take it off? You ask for vax card but thats no good ONLY when you're ordering?? Mind bending idiocracy and hysteria. Making my brain hurt just reliving this junk. Science is NOT Virtue signaling. But clearly not science or data based at Ivy Room. What a joke. A bad one too. SMH... Also, while I'm here just a nice little word of caution... You might want to look on the side of the mask box you're handing out for people who will acquiesce... Those crap masks don't protect against viruses... and I'm not into power trips so... yeah. NO. Way to make your customers feel like you're being weird and for making everyone (whether they will admit it or not) uncomfortable. As someone who goes out a LOT, this gets the dumb award of covid for complete nonsense and paranoia. WEEKS after mandates have been dropped like a bad habit. Goodbye forever. I'm sure the feeling is mutual so no worries. I spent a lot of $ last night 10 doors down from there and had a great time. Door guys are cool and always have been. I'll miss this place (honestly). But there are just too many things to uncouple with this BS.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"A. H.\", \"AuthorLocation\": \"Benicia, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1644451200000,
        "ReviewContent": "Used to be great. Not so much now. Hard to be a business I suppose. But wtf I was supporting local bands and my beer disappeared. Nothing they can do they said. Bye.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Ben R.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1642550400000,
        "ReviewContent": "Love the Ivy Room so much been going there for years but they need to take a major chill pill on the Covid Protocols!Every other place in the bay area & beyond you have your mask on at the door , when ordering from the bar & waiting online for the bathroom etc ... but then you can take off your mask while you sit with your friends, drink your beer & dance. But at IvyRoom they want you to drink with one hand & put your mask on off in between sips with the other. It doesn't matter if you're in your own area with your friend.  They  literally scream at you & threaten to throw you out over this. I don't know what it is that made them decide they want to be stricter than every other place & really hope they cool it before people  stop showing up there.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Bob S.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1640995200000,
        "ReviewContent": "Came to see a fun cover band.  We had recently been to Nashville which based their Covid policies on science , not mass hysteria.   It was great to have fun in a free state .  Thousands having fun with no incident.We want to support the small businesses , but this place makes it hard.  Jerk at the door doesn't say Welcome , thanks for supporting us.  He says if I see you without a mask I'll throw you out.  The CDC says the masks are 18% effective but I wear one to be  polite because people have freaked themselves out. We get inside and it's freezing from the ice cold air pumped in .   The band is yelling mask propaganda: thanks for wearing your mask ! Sing along with your mask on!   It was so cold , we didn't want to drink anything .   Figured it was worth losing the  $60 cover just to leave.   We've been to a bunch of shows and concerts , to support local venues and arts which are struggling.   This is the first that just completely sucked.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Chris S.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1635206400000,
        "ReviewContent": "This place is really awesome. The music is different every weekend but if you like to party and enjoy the moment you will find each track as a different experience.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Ignacio C.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1635120000000,
        "ReviewContent": "Great local night club! Good music and owners seem really nice. Albany's best place to dance!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Hummingbird P.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1632182400000,
        "ReviewContent": "One and done. I'm never coming back to this place. The venue is falling apart. The bands were complaining about the monitors crapping out. There's no hot water in the bathroom, either.Bouncers do periodic mask patrol duties for those actively drinking, which is fully within the letter of the law, especially since we're all vaxxed. The merch guy is cool though. That dude can go maskless all night.Now before you label me a dirty Republican, consider this. It works against the bar. It means I drink way slower, which means less money for the bar and less tips for the bartender. It also means that the bartender screws up orders because he thinks I said Racer when I said Trumer.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Jim S.\", \"AuthorLocation\": \"St. Petersburg, FL\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1629936000000,
        "ReviewContent": "I have mixed feelings about this place. I've been a regular here for wellover 15 years & seen it go through several owners & layouts. On one hand the most recent owners have certainly stepped it up. They've successfully turned this from a lil neighborhood dive bar & live music joint to a place where members of Greenday do surprise concerts & established bands bring a hundred or more people to stand & watch em play. But that's partially not always a great thing.  They ripped out all the seating, got rid of the pool table, raised the price of drinks, limited their operating hours, & no longer host some of my favorite smaller local acts that they used to.So part of me is really happy I get to see major acts here in my neighborhood but part of me is bummed that  if I wanna meet some friends for drinks & chill during happy hour on the low key I gotta go across town.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Jon S.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1583107200000,
        "ReviewContent": "My GF and I were there on a Sunday night when there were 3 bands playing, and the music was incredibly interesting and solidly good! As were the cocktails, btw. But there were maybe only around 15-20 people in attendance which seemed tragic given the quality of the entertainment. What the heck is wrong with locals around here? If more of us don't support small, local  music venues like this they'll cease to exist. So please get your butts out of the house and wiggle it on the Ivy Room dance floor instead, people!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Hugh G. R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1581724800000,
        "ReviewContent": "I've driven past Ivy Room's red glowing neon sign often, and I've jokingly told my girlfriend that it is an exclusive bar that only admits Ivy League students in (hence the name). She fell for it, but I broke the illusion when one of my friends invited me to listen to his friend's band play at the Ivy Room.Got there at night, parked streetside, and went in. Had a bit of snafu at the door because I misheard how much the cover to get in was. Paid in cash and was on my merry way. The Ivy Room is bigger than I thought it was from the outside, but it's still a small and cozy space. Bar occupies the right side, and the stage is on the left side. A wall with openings divides the two spaces. Ambiance was good at night. I liked the way the stage was illuminated. it's cozy here at the Ivy Room, but if there are a lot of people listening to the same band it can be hard watching from the back. Had a lavender-lime (I think) mocktail here. Tasted great but it tasted more lime than lavender and was pricey for the amount given. Worth a visit!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Stan S.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1576454400000,
        "ReviewContent": "I haven't been here in years since a Yelp Holiday Elite Event a few years ago back in December 2014.  Now I see that they have a small stage in front and a friend and I came here to see our friend and his band and there were 3 other groups playing, Maracutu Pacifico, Ritmos Tropicosmos and our friend's band, Namorados Da Lua!  I loved all three as they started with Maracutu Pacifico with their drumming, Ritmos Tropicosmos with cumbia music and Namorados Da Lua with the Brazilian jazz and reggae rhythms!  We had a great time!  I had a beer which was good and reasonable though I cannot remember the name now!  They have a listing of 7-9 beers to choose from.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Karen W.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1569369600000,
        "ReviewContent": "I love the talent, layout and vibe of this room. But the bartender, who looks like a bad Elvis Costello with worse hair, was so utterly rude to me that I may never return. It's sad, as many of my friends play there frequently, so they will be out $. Your bartenders are not holier than thou. Please talk to them about customer kindness.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"T G.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1562803200000,
        "ReviewContent": "I never get to see my name in lights.  Coming to a rock show at the Ivy Room is the closest I'm going to get I guess.We came in one night to see a few rock bands play a live show.  The room is small.  You get real up close and personal with the performers.  And its loud as hell. Bring your ear plugs.The bar is fast even with a packed house.  There was an awesome hot dog truck serving it up outside too.They seem to have a lot of live music preformed here.  All of which are all different genres.  We had a great time.  I bought a cute tank top too.  Way to represent the Bay Area local music scene and having a unique name.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Ivy S.\", \"AuthorLocation\": \"Martinez, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1557100800000,
        "ReviewContent": "Recently got to check out Ivy Room for the first time - how did I not know about / visit this place before? Well, I guess that's because it's in Albany...Nonetheless, it's a rad, old school Bay Area bar and actually pretty conveniently located (both by bus and the El Cerritos Plaza BART station). Got to check a show out here recently and it was a super fun environment. Stage was very intimate, but the room fit a surprisingly good amount of people. And, the bartenders were doing their due diligence to keep everyone from going thirsty.Speaking of which, beer selection is nothing special, but they were at least very local-centric and the varieties they had were drinkable. Certainly more of a neighborhood bar, but don't be afraid to make the trek. You'll be glad you did.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Jon T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1555891200000,
        "ReviewContent": "I attended a show on 4/20/19-- being on the inside of the music line-up and knowing the promotor who put it together, I suspected I would be witnessing a total train-wreck-- But the staff at the Ivy Room (the bar tender and music techs) were freaking amazing and saved the evening for their customers.  This was a four band line-up and these bands were top notch local acts like The Incubators and San Geronimo. The bands brought it and then some.  The music was dialed in perfectly for by the sound engineers on staff.  The beverages were great and the prices were very reasonable. I hope to see more North Bay bands play the Ivy Room.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Dean K.\", \"AuthorLocation\": \"Petaluma, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1554940800000,
        "ReviewContent": "I was thinking what would be worthy of my 4,600th Yelp review milestone, and by sheer coincidence, I've come back here after an absence of 4,600 years. OK, it hasn't been that long, but I was knee-high to a man and gave me a piece of mamma daddy never had...when I was last here. Oh Philadelphia Freedom, shine on me. Anyway I distinctly remember more of a tiki vibe back then and a pina colada in my hand. I think it even had a tiny, folding pink paper parasol in it.Now all these years later, Jamie W. and I are back for St. Paddy's Day to see how the Ivy Room was holding up. Very well if you ask me. It definitely feels more like a comfortable neighborhood bar than I remember from my youth, but of course I've become more comfortable and neighborhoody in my advanced years so maybe Ivy and I have been aging at the same rate. This time we avoided anything fruity or tropical and went straight for a couple of $5 Drake's Hefeweizens in plastic cups, of course (photo: http://bit.ly/2Z9HadJ).We watched, listened and danced a wee bit of a jig to a ten-piece Pogues-inspired bar band aptly named The Bogues (video: http://bit.ly/2ZajBBe). 'Twas a grand time we had even if there was no place to sit. In fact, we liked our experience so much we came back a couple of weeks later to see Fleetwood Macrame, a tribute band to, you guessed it, Fleetwood Mac with the lead singer and guitarist evoking Stevie Nicks quite accurately with her shawl-draped moves (video: http://bit.ly/2Z9HfOz). Oh yes, Ivy Room, I'm back.DRINKS - 3 stars...the pina coladas are fades memories but the Hefeweizens hit the spotMUSIC - 4.5 stars...what we came in forAMBIANCE - 4 stars...laid back and chilllSERVICE - 4 stars...the bartender moved fastTOTAL - 4 stars...definitely a homecoming for meRELATED - Looking for dining options on Solano Avenue? Here's a collection of places I've tried and reviewed: http://bit.ly/2HvcTQH",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Ed U.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1553385600000,
        "ReviewContent": "Got to LOVE the Ivy Room :) !!This is a bar we go for a drink every now and then, and once we were thinking of holding a friends party, the Ivy Room felt like the perfect place :) !So, we had the party last week and it was amazing !!! The place is really cool, and could easily accommodate all our guests (about a 100 of us), the bar and bar tenders were amazing!! The sound system was perfect and the two DJ's we had got us all fired-up !! Thank you Ivy Room team !!Get ready for our party next year ;) ...",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Gabi T.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1552003200000,
        "ReviewContent": "Cozy venue to hear local bands.   There's usually a cheap cover at the door.   This place is an easy night out.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Michelle R.\", \"AuthorLocation\": \"Emeryville, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1551225600000,
        "ReviewContent": "An awesome place to catch some drinks and see some wonderful underground tunes from all backgrounds. Love it.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"N K.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1550448000000,
        "ReviewContent": "My boyfriend and I stopped into the Ivy Room a couple of weeks back, when Erik was bartending. It was our first visit, and Erik told us all about their music scene, open mic, and even comedy nights. He was really friendly and informative and we totally are excited to go back and check out some live bands here.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Amy S.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1546560000000,
        "ReviewContent": "Great place with good music right on SP. They have live music, dj sets's and they also do privet events.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Yossi B.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1546473600000,
        "ReviewContent": "I came to the Ivy Room to see an American Steel show and didn't know what to expect other than it was small. But small is good in this case. It's wasn't too crowded but it was still intimate. They have screens above the bar so you can see the stage, which reminds me of the Uptown, and it's something I've always liked (makes it feel like you're getting in on the action, even if you're not right up front). I liked the overall vibe of the place, though I thought the drinks were expensive (though I've been living in Berlin for a long time, so maybe I just forgot how expensive crappy beer is in the states), and it seems like the backstage doesn't really exist. I also could have done with more bathrooms, but it is what it is. I'd come back here again if a band I liked was playing, but don't know that it would be a hangout spot for any other reason. Oh, and the door guy (who memorized the willcall) was pretty cool.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Natalye R.\", \"AuthorLocation\": \"Berlin, Germany\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1544140800000,
        "ReviewContent": "Bonnie is an excellent bartender and the vibe is neighborhood bar . The bar features at least 9 beers on draft with 2 for 1 happy hour specials, Del Real tamales, and unique live entertainment.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Alex M.\", \"AuthorLocation\": \"Champaign, IL\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1542585600000,
        "ReviewContent": "I haven't been here since the ownership change a couple years ago. Ronaldo was charismatic, funny, and took extra care to make sure everyone was happy with their beverages. However, this place has gone downhill since. Any changes in decor are minimal, though I do like the improvements to the venue area. The bartender had a surly attitude like we were doing him a disservice by entering the bar. Which, normally I would understand as we all have bad days and I'm industry myself so am usually very forgiving. Sadly we were treated so horrible that I just can't rationalize it. The mixed drinks were dull at best and the beer lines taste like they haven't been cleaned in ages. Definitely skip this bar and go to any other bar in the area.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Rusty S.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1541808000000,
        "ReviewContent": "Historic old bar. Great decor. Live music stage. Good beer on tap. Great vibes. Nazis not welcome!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Patrick S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1539907200000,
        "ReviewContent": "This place is ok. But they have NO green room... and no merch space. Meh.  MEH I SAID MEH!!! What do you mean \"this review is \"too short \"? I said what I said.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Merch C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1534204800000,
        "ReviewContent": "My friend really likes this place and always insists we go when I come over to visit her. They do get some really good shows sometimes so credit to them for that. There's some pretty awkward open mic/comedy nights too, lol!The minus-points come on the bar situation. The garnishes are usually stale, drinks watered down, draft beer is stale and/or infected. After MANY disappointments on the drink side of things I'll usually get something bottled or canned that I already know how it tastes. Bartenders are always really snappy too, even when they don't seem slammed. I'm pretty patient when it comes to that stuff too, but I really just don't like the way I see them treat other customers. It's a shame that they can't step up the bar game, and it's just like a bar at a venue like the Fox or something. Yikes.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Will J.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1530576000000,
        "ReviewContent": "Great spot for live music in the East Bay. It's definitely what makes this a destination spot for me.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Simone W.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1530230400000,
        "ReviewContent": "What an awesome club! Went to a packed show and had a blast! The scary looking door guy was suprisingly friendly and the bar staff was too! Seems like there are always good shows there so ill definitely be coming back :)",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Memento M.\", \"AuthorLocation\": \"Milpitas, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1530144000000,
        "ReviewContent": "Great little bar with some rad bands! I've been here a handful of times, and enjoyed myself. Plenty of street parking, the drinks are good, clean restrooms, pinball and a pool table. Good times seemed to be had by all.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Deanna C.\", \"AuthorLocation\": \"Petaluma, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1529539200000,
        "ReviewContent": "Don't come for anything close to a passable drink. Just got served a flat G&T with a lime that looks like it got stolen from a drink that died 2 days ago. All browned up on the edges. Disgusting. The Tuesday night jam isn't as good than I remembered it...  --moving on!Update: The bartender came back after serving me a seriously watered down Jameson's on the rocks as a replacement for the G&T and said she'd serve my girlfriend but not me; somehow me pointing out how bad the drink was my fault. Wow. Then she said I had to leave. Ridiculous thin-skinned millennial. Pouty-faced incompetence with zero responsibility.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Gunther R.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1522972800000,
        "ReviewContent": "I love this place. They have really incredible bands that play, my favorite has been the Mitch Polzack and Big Sandy Show. They have a fantastic beer selection, I always can find a delicious and juicy IPA to sip on while I boogie out on the dance floor. The stage just recently was raised quite a bit so even from the bar you can see what's happening onstage. The bar itself is dimly lit giving it a soulful, cozy vibe, the bartenders are awesome and the bathrooms are clean.... one of the best spots around.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Dez W.\", \"AuthorLocation\": \"Martinez, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1522108800000,
        "ReviewContent": "The stage for music at this bar is pretty neat, but I've gotta say that the staff here is RUDE AS FUCK. I came here twice in one week and the first night, I was upset about something, was sitting alone at a booth silently crying, and at first one of the ladies working there asked if I was okay. I told her not really, but nothing anybody could do about it. But then minutes later, she came back and said: \"if the liquor control board comes in here, are you going to be a problem?\" ...a problem? I'm going to be a problem for crying because I was so upset at the way I was treated at this bar? I wasn't even drunk. I don't drink at all. I just came for the show. I wasn't causing a scene, I had a completely competent conversation with her, and nothing in my actions implied that I would be \"a problem\".After this, I walked out even more upset and sat outside in the cold to wait for my friends so I \"wouldn't be a problem\" and get kicked out FOR SITTING ALONE IN A CORNER MINDING MY OWN BUSINESS.The next night my friends dragged me here again and there were no more than 10 people in the whole bar, and BOTH BARTENDERS WERE SHORT AND RUDE AGAIN. When I politely asked for a drink, the bartender practically threw my change at me without saying a word. When my friend asked for change for the pinball machine she barked back: \"WAIT A MINUTE\". Everybody I was with all agreed that the staff were NOT NICE.Sorry Ivy Room, don't care how cool your venue is, if your staff treats people that way, you're gonna lose your customers. Try an attitude adjustment.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Sasha B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1521331200000,
        "ReviewContent": "Possibly my favorite small venue in the bay area. Great vibe, good music, fun bar area, comfortable bar stools and chairs (something that has become more and more important over the years), and easy street parking. Also, no creepy dudes. I can't think of a way this place could be any better.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Kari E.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1519516800000,
        "ReviewContent": "This is a wonderful old bar that provides live music.  A great neighborhood to get a bite to eat and see mice music",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Rob F.\", \"AuthorLocation\": \"Burlingame, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1517875200000,
        "ReviewContent": "SO MUCH FUN!!!! Great eclectic East bay crowd that dances--super fun with a local vibe!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Julie C.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1510876800000,
        "ReviewContent": "awesome experiences!! good vibes and awesome entertainments. I went here during halloween and it was amazing! drinks are cheap and fast even tho it was a crowded day!  good place to chill",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Talla S.\", \"AuthorLocation\": \"San Pablo, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1510617600000,
        "ReviewContent": "This is a nice little venue. Saw a buddies band play here and had a good time. The space is roomy but intimate. It definitely feels like a rock bar but doesn't feel super divey. The bathroom is definitely nicer than most show venues. There is a pool table which is a plus. They have cheap drinks and have a pretty decent whiskey shot and beer combo. There are two pinball machines in the front and it's walking distance to Club Mallard and Hotsy Totsy!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Eric M.\", \"AuthorLocation\": \"Downtown, Sacramento, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1506902400000,
        "ReviewContent": "This was cool spot for a drink. We weren't that into the music but the people there seem to like it. We told the guy collecting door fees that we only wanted to get a quick drink and we were not charged! I never would of paid $10 bucks to listen to that music FYI lol I would go again if a cooler band was there",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Player L.\", \"AuthorLocation\": \"San Mateo, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1505174400000,
        "ReviewContent": "This is the Boom Boom Room of the East Bay! Killer spot for killer live music acts!On Tuesday there was a happy hour- 2 for 1 drinks - awesome. The bartender/owner was one of the best human beings I have ever interacted with in my entire life. That is not hyperbole that is Summer. She is just naturally an amazing person",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Tyson S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1503705600000,
        "ReviewContent": "I didn't know what to expect. Was greeted at the front door by a very friendly host, collecting the cover charge of $10. He told us the cover would only be $5 as there was only one group left to play. All seats and booths were occupied so we sat at the bar. The bartender made a mean Bombay Sapphire Martini, well mixed and just cold enough. By better half doesn't do cocktails so he asked for a red wine and was offered two choices. He doesn't remember which he chose but said that it was good enough, that he wasn't expecting great wines here. I found the crowd very friendly and inclusive. We had a great time, with great conversations, tasty cocktails and good music. Probably will return, if we lived closer, we probably would go more often.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Corey H.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1499472000000,
        "ReviewContent": "Really ridiculously rude doorman, at least he was consistent as in rude to each and every patron. We will avoid in future.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Erin R.\", \"AuthorLocation\": \"Moraga, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1498089600000,
        "ReviewContent": "Great neighborhood bar and small venue for local bands.  Came here to see Midnight Social - what a great show that was.  The stage is adequate for a band of 6-7 people or so, and they have a variety of types of music.  The night we were there they cleared away ALL of the smaller tables and chairs so it was pretty much SRO with the exception of the seating directly at the bar.  Drinks are reasonably priced, bartenders are friendly and on their toes so you don't have to wait long.  We were there earlier than we meant to be and ended up bringing in some take out food from one of the many nearby restaurants.  That made the wait palatable.  (See what I did there).Check their calendar on the website and come on out to support our local musicians!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Jerry P.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1490227200000,
        "ReviewContent": "I have gone to the Ivy Room at random time and every time it's been hospitable and easy to get comfortable to visit with friends. It's a great set up for live band, happy hour pool and dates. I'm grateful to have an easy going, classy neighborhood hang out!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Capt. Zorah R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1490054400000,
        "ReviewContent": "This has really turned into a great queer women's space on Sunday nights. I've been here a few different Sundays. The music is always fantastic. Awesome djs, fun dancing and the crowd is friendly. Will definitely be coming back often.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"S S.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1489104000000,
        "ReviewContent": "This place is amazing! We have been there over a dozen times since Halloween '16 and EVERY SINGLE TIME the music has been perfect. Everything from good blues rock 'n roll to soulful reggae. Bartenders are all rad down to earth folks who know how to make a drink. I am a beer and shot guy, but my girlfriend loves the \"poison ivy\" cocktail. Love this place and we always feel at home.Adam H.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Adam H.\", \"AuthorLocation\": \"Boise, ID\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1487548800000,
        "ReviewContent": "Went to the Drag King show on a Thursday night. We were early, yeah, we are a lot older and thought the show would start on time. It was over an hour late. That was not the problem. The problem is one of us went up to the bar and was ignored for a full ten minutes, while other patrons (younger, cuter maybe) came up to the bar and were served. There were a lot of older people in the bar that night, even many gray hairs like ours. But - two people washing glasses and chatting behind the bar, plus one bartender chatting up other guests  = getting ignored for ten minutes? And still only were served, when we asked a third time? FAIL. Never going back here. I know middle-aged women are invisible but ... Geez. Your whole point is to serve drinks.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Chalk K.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1487289600000,
        "ReviewContent": "I absolutely love this place! I had to give this place stars across the board because one, the bartenders are awesome and two, I feel so lucky to have such a cool, intimate spot to get good drinks and see great shows! Oh! And the decor... super cool! Just went to see Ghost-Note and the sound was incredible!It's like the little venue that could AND did! It's unbelievable how this place rocks the house considering what it was before. Love love love this place!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Nikki T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1486512000000,
        "ReviewContent": "We stopped here a couple of days ago. It was A great experience. The ambiance was perfect. I really liked the lighting. The bar tenders wereVery sociable. Will go back soon!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"William G.\", \"AuthorLocation\": \"Newhall, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1486512000000,
        "ReviewContent": "This place was so fun . The band playing was outstanding and the Bar staff were really nice .i can't wait to go again soon. Thanks",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Kathy G.\", \"AuthorLocation\": \"Valencia, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1485907200000,
        "ReviewContent": "I have been here several times now, and do not plan on going back again.  The atmosphere is dark and a bit sad, and the bartenders are not particularly friendly.  I was there once to see some live music, which is fun, but the sound was not good (my three other friends agreed).  Live music aside, there are so many better choices locally.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Charles W.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1485734400000,
        "ReviewContent": "Get over the dive bar exterior and interior. It's just old. In their defense I must say they keep it clean. Between an incredible staff, a crazy well stocked bar, and the best venue for local music in the area, they own it. I love it here. I was really surprised. Not like bars with garage bands. They get seriously incredible musicians that are known. For New Years Eve, my sweetie took me to see \"Rupa and the April Fishes.\" Bought their music. Thought the inside is totally dated, the place gets jammed by music lovers. I mean SRO. What a hoot. With the right band fill up on food on the way and save your drinking for there.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Thomas B.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1483747200000,
        "ReviewContent": "Glad this bar is in Albany but one thing- at least twice now we've been at the bar on 3rd round n the band starts to set up so the door guy goes around to people already planted and asks \"are you staying for the band because if so it a $15 -$20 cover\". We were not staying for the band but we would've stayed to drink more had he not done that. It's the bars responsibility to have a door guy at the door when they want a cover paid. So start him an hour earlier! Just found it as soliciting and tacky not to mention insulting.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Maxine D.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1480118400000,
        "ReviewContent": "This is pretty cool bar/music venue to drink at or see a show, they do charge a cover to enter the vicinity and also have some overpriced beers and cocktails, but the atmosphere is well worth the cost. I like that all their bartenders are both friendly and knowledgeable about both popular drink options and more obscure shot and beer mixers like \"Snake Bites\" & \"Candy Apples\". Also, they have a good variety of shows that go on here, they regulary host everything from bluegrass to sexy burlesque shows.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Joseph A.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1478304000000,
        "ReviewContent": "This place has had a change of ownership over the past couple decades and I think the new owners got it right. Live music on Fridays and great bartenders like Karlee. Good spot for an after dinner date or a small group soiree.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Czarina W.\", \"AuthorLocation\": \"Hercules, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1478217600000,
        "ReviewContent": "This is the best spot ever. Had my birthday party there this winter right after they opened and people are still talking about how much fun they had. What a great music venue as well as local bar with great owners and bartenders and beautiful decor. Thank goodness for this place!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Meredith S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1471564800000,
        "ReviewContent": "Even though we suck at playing pool...at least there's a pool table for us to play (only one here and a pinball machine, only coins)! Not to mention the awesome live band that comes on later on the night so if you're looking for a good time out, more laxed night with live music, and cheap drinks this is the spot! They have happy hour here till 7pm where drafts are buy 1 get 1 freeeee! It definitely has more of a saloon lounge feel and not too many people around 7pm. The age around here seems to be alot more older, say around 40s, but still a great time with awesome bartenders around!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Jia Qi F.\", \"AuthorLocation\": \"East Bay, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1468713600000,
        "ReviewContent": "Best place to have a good time. Tip the bartender and make their day. Because when you are there they will make yours. The drinks are delicious and Sunday's are free Louisiana dishes between 3-8.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Chelsey W.\", \"AuthorLocation\": \"Fairfield, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1467417600000,
        "ReviewContent": "I dropped by the Ivy Room after brunch with my husband one morning looking for some Sunday drank. It was about 11am so there was only one other patron other than us. There was a jukebox against the wall, and a little stage too which made me assume that they have live music sometimes.Anywho, I was craving a Bloody Mary and the bartender made a kick ass concoction. It was a habanero bloody Maria with tequila that he had made with habaneros himself. It was really good and it goes to show what lots of experience can do. Sooooo goooood!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Lili T.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1465516800000,
        "ReviewContent": "The Ivy Room is better than ever. The bar is inviting and functional. The staff friendly and professional. I had a great time there for the first time in over a decade. Great job!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Julia E.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1463788800000,
        "ReviewContent": "Very nice place with excellent music, atmosphere, pleasant people and good artists. I just visited the Western Skyline night and I really enjoyed it.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Paul V.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1459209600000,
        "ReviewContent": "Had a great time in this bar/venue with live music!! The owners are great people with great personality to boot.  Not to mention their other bartenders that work that bar.  Such a wonderful experience and they are surrounded by a sweet town with charm and color....love it there.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Lawn F.\", \"AuthorLocation\": \"Los Altos, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1458172800000,
        "ReviewContent": "I love this venue! Ivy Room is back and better than ever. Great sound system and yummy bevvies.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Gretchen Z.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1458172800000,
        "ReviewContent": "New fabulous owners Summer and Loni!Bringing Music back to AlbanyGreat atmosphere! Great stage! And seating area! Pool table!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"SR W.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1457654400000,
        "ReviewContent": "Awesome spot under new management with awesome live music and fun bar crew! Great bar seats with locals and opening up to cozy room to dance or chill. And right here in Albany, walked to a number of other places close by for great food.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Benjammin F.\", \"AuthorLocation\": \"Palo Alto, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1454284800000,
        "ReviewContent": "Such an amazing spot owned by two stellar women! This venue provides wonderful live music, strong drinks, and plenty of seating. There are also three TV's to catch up on sports, a kick ass jukebox, and a brand new pool table! Love coming to this bar to hang out and catch up with friends.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Meredith J.\", \"AuthorLocation\": \"Cotati, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1451606400000,
        "ReviewContent": "My best friend and I spent part of our new years eve here and we had the best time! Great service & drinks, live music and pool! We'll definitely be back :)",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Rachael G.\", \"AuthorLocation\": \"Danville, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1451174400000,
        "ReviewContent": "The interior has been renovated and looks great. The music selection was good too. However, their specialty drink menu disappeared! That was my sole reason for coming here. They had the best specialty cocktails anywhere. Their flaming margaritas were the best.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Marty P.\", \"AuthorLocation\": \"Pleasant Hill, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1450569600000,
        "ReviewContent": "Went down here after eating some hot ass curry at the indian place next door. Really I wouldn't have kept up on or really known if my friend Karlee hadn't promoted it on her FB.. Ive been a fan of Karlee for like 9 years now. She pours heavy shots, is nice to look at and keeps the place dialed in line. She has been  working around drunks a long time. Her friend and owner of this place is called Summer, Im sure Ive crossed paths with her once in a while in San Francisco.. But honestly San Francisco too rowdy for me these days..nowadays I just like to go kick back and this seems like a good place to do it. I hear a kitchen may be coming. That could be good.  or it could be bad.. you never know lmao.. same story with live music. could be cool if its a laid back act with a laid back vibe, but if not, bah humbug.. Also, they dont have Bud Light or Pitchers. Bad times. they did have PBR which got the job done. Also they have quite an extensive line of booze. If they dont have it, you dont want it.  Go check it out. You'll be glad you did.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Morris D.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1450483200000,
        "ReviewContent": "Chill, cozy, clean, and beautiful space. Friendly owner who seems to have even more plans in the works for this spot. And, cool, friendly barmaid... Hope she starts working there more.Love the cozy window seats and booths. There's one pool table, two flatscreens, nice CD jukebox, and a stage for live bands. With all of that going on, this place maintains such a warm, relaxing atmosphere. Can't wait to see some live music here, soon!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Kara B.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1450483200000,
        "ReviewContent": "Great to see the Ivy Room back, and the new owners did the place right.I've stopped here a couple of times since they opened and I was greeted warmly by the friendly bartenders / owners Lani and Summer. I'm impressed by the remodel, where everything from the soft lighting at just the right level to the cozy leather booths and classy CD jukebox make you feel right at home. Somehow the place feels much more spacious than it ever did.This place now feels like an authentic small blues/jazz club complete with cocktail tables, a stage, professional sonic treatment blended into the decor, a layout that flows nicely between bar and stage areas, and of course the pool table.They had a band playing on the packed opening night - a prohibition jazz trio with some serious chops that bodes well for the quality level of the music they will bring here.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Spiral M.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    },
    {
        "ReviewDate": 1450396800000,
        "ReviewContent": "The renovation of this San Pablo Ave. legendary bar came out amazing.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Ivy Room\", \"AuthorName\": \"Brian Z.\", \"AuthorLocation\": \"Aptos, CA\"}",
        "VenueName": "Ivy Room",
        "venue_id": 18
    }
]