[
    {
        "ReviewDate": 1704067200000,
        "ReviewContent": "Visited recently with some of my girls, with two of us being there for the first time. Appreciate that it's lowkey and in the El Cerrito Plaza, so that means plenty of parking because of the lots. The bar itself is at the front and a bit tight compared to the back room where live karaoke occurs and plenty of seating exists. I like the vibe, but be aware that ventilation could improve. The crowds here echo a hometown feel, so you'll find people who are present for a good song and a chill night. Drank the mai tai and White Russian here; they come in big glasses and they come strong! Drinks are a good deal and you'll be getting your money's worth!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Danielle M.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1691971200000,
        "ReviewContent": "The drinks are strong and reasonably priced. The staff is welcoming and nice. We had a great time singing karaoke for my friend's wedding after-party. While not in a typical place for a bar, this bar is top notch, and I can't wait to come back.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Adam K.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1709164800000,
        "ReviewContent": "Omg, the older woman bartender is sooooooo unwelcoming. My friend and I had a drink and left. It's a weird little place with a culty (not in a good way) vibe and not welcoming to new comers.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Kevin K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1698451200000,
        "ReviewContent": "Typically neighborhood bar.  No food served.  Basic fun place. Ppl come here to watch the games, have a great time, and live their life.  I'm not too impressed but it will work while I wait for a friend. I'm early for the Halloween Party",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Leroy W.\", \"AuthorLocation\": \"Washington, DC\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1697932800000,
        "ReviewContent": "A nice place for karaoke, great drinks, and a good place for a get together! Bar service is amazing.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Angela Y.\", \"AuthorLocation\": \"Fairfield, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1681603200000,
        "ReviewContent": "Authentic dive-bar without the hepatitis.Old-scool ambience but clean.  Fair prices.  Hey Yelp- requiring 85 characters is a pain.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Sean O.\", \"AuthorLocation\": \"Toronto, Canada\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1566691200000,
        "ReviewContent": "Oh wow, this vintage watering hole is a major throwback deep into the last century when men in gray flannel suits and matching porkpie hats patronized their neighborhood bars to share their troubles with the bartender. If you saw any sitcom back between the Eisenhower and Reagan years, there was always a scene in a bar like this where the misunderstood husband plots with his best friend on how to get back at his wife for carelessly overspending their household budget. Jamie W. and I discovered this spot quite by accident after shopping at Trader Joe's.I have to admit I was intrigued by the retro sign and the fact that you can't see anything inside until you enter the side door where of course, the bouncer checks for your ID. Inside it was like something out of that sitcom with regulars talking over each other just a little too loudly as they were downing various well drinks. Jamie W. and I fit right in by ordering $8 Makers Marks and Ginger (photo: http://bit.ly/2L65uXH). They have a back room with red paisley wallpaper and quite an elaborate karaoke set-up. We have yet to make it for karaoke but give us time...and enough Makers Marks and Gingers. Mel-o-Dee...oh wait, I get it now.DRINKS - 4 stars...not watered down, thank goodness AMBIANCE - 4 stars...mid-century throwback, love itSERVICE - 3 stars...not sure I'd share my troubles with him but certainly friendly enough TOTAL - 4 stars...drop the micRELATED - Looking for libations? Here's a collection of places I've tried and reviewed: http://bit.ly/2YJ1IbU",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Ed U.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1688774400000,
        "ReviewContent": "Great place to hang out, staff and owner are very attentive.  Regular customers are inclusive of new bees.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Marc G.\", \"AuthorLocation\": \"Pinole, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1666569600000,
        "ReviewContent": "honestly a quality place to sing the people are friendlythe place is no frillsno coveropen Wednesday to Sunday",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Monica S.\", \"AuthorLocation\": \"Davis, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1502668800000,
        "ReviewContent": "Just sing me a mel-o-dee why don't you?! Because if YOU don't sing it... you'll regret hearing me \"try\" to. Belting my lungs out anywhere other than the shower should be strictly prohibited. But when I get to feelin' myself at Mel-o-dee, I just can't control it. Four cocktails in on a Thursday night here, and you might get the pleasure of seeing me singing and dancing on top of the bar! Okay... I'm exaggerating. However, I can't deny that this place is such a fun time. Located next to Trader Joe's in the El Cerrito Plaza shopping center, Mel-o-dee serves up some really strong cocktails while providing a wonderful spot to sing along to your favorite tunes. It's the oldest bar in El Cerrito and is still going strong for so many reasons! For one, the bartenders make the drinks here really strong. You won't need too much liquid courage to get you singing when you come here. To top it off, their drinks are super cheap! Cheap drinks that are still strong and tasty? Yep, I'm a fan of that! The employee turnover here is really low.  Some of those bartenders have probably been working there since before I was born! Now, that's what I call dedication. The venue itself is pretty comfortable. You first enter through the bar area which is long and wide with a counter that's also located on the opposite side for additional seating. The lounge area is pretty spacious. There are usually tables out in the middle of the floor and cozy booths which usually fill up by the end of the night. This place also has tons of TV's and tends to get quite packed during sports games. The best nights to come out are either on Thursday or Saturday nights because of... you guessed it: KARAOKE! To be frank; I've never been the biggest fan of karaoke. However, I absolutely love the karaoke nights here! My friends and I used to frequent this spot at least once a month on Thursdays to have a karaoke night. But lemme tell you the REAL reason why we kept coming back here... to watch the regulars sing. It's the most entertaining thing ever! If you've ever felt too shy to get up and sing karaoke, just watch the people who do it here every Thursday. That should be enough encouragement for you to get your butt up there on ANY day! And when I say entertaining, I mean hilarious. I gotta keep it real... most of you folk' do NOT know how to sing! Half of the time, I feel I'm watching America Idol audition rejects. But damn, it is just soooo funny! If these people can come here and sing like this every Thursday, then damnit... I can do it too! It's like a comical musical... best thing everrrr! Not everyone who sings here is bad. Some of them have vocals... I'm just saying that most of them don't. And that's okay, because everyone gets a big laugh out of it. I love getting up there and making a fool of myself... sometimes! The list of song choices here are endless! I've found songs on here that I didn't even know could be used for karaoke! They have a super diverse selection of songs of all different genres and times. If you're looking to have a fun night of karaoke, I would without a doubt recommend Mel-o-dee! Even if you aren't into singing yourself, this place is super entertaining and a great way to spend time with friends.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Shayla B.\", \"AuthorLocation\": \"East Bay, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1635379200000,
        "ReviewContent": "I LOVE THIS BAR! I go for karaoke with DeeCee and have a BLAST every time. It's intimate but bustling at the same time. Great drinks, great people, and the regulars are always welcoming. I love bringing people here for a fun night of singing and relaxing.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Mary H.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1597881600000,
        "ReviewContent": "I'm so glad that it's open still during the outbreak and and they serve my girl favorite cocktails and sadly they don't do no delivery with a  little spills still a feel  you drink",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Daniel J.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1595548800000,
        "ReviewContent": "I'm praying that Mel-O-Dee lounge will survive Covid because it is hands-down the BEST karaoke bar ever! And, I am about to move into a house that is within walking distance. I can't think of a better way to celebrate the end of this pandemic than a night at Mel-O-Dee Lounge. If there is a gofundme or anything to keep this amazing local business alive, please post it here!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Vanessa W.\", \"AuthorLocation\": \"Palo Alto, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1582588800000,
        "ReviewContent": "Yesterday was my birthday and I walked over to this spot with a mutual acquaintance having been at The Crown celebrating. I went directly to the restroom and when I approached the bar, I was immediately told that we needed to leave. I assumed my friend had developed a reputation at this place that I wasn't aware of. So I left without objection. Once outside, I proceeded to order a Lyft when my phone died. So I returned to the bar, thinking someone could help. When I returned, the door was locked with about 20 people inside. So I knocked on the door. My friend also knocked to try to help me. The bartender opened the door and immediately was screaming \"you're not coming in!\" over and over. I couldn't even explain. He slammed the door in my face and said he was calling the cops. I'm so glad he did because finally someone was able to help me. The police called me a cab and charged my phone while we waited. The bartender at Melodee put my safety at risk and acted with complete unprofessionalism. It's terrible because I'm new the the area and have developed friendships with people who visit regularly, but I won't return unless this bartender is removed.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Erica M.\", \"AuthorLocation\": \"Roseville, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1582156800000,
        "ReviewContent": "I would give it a zero if I could.  This place is a dump and its old , the owner needs to do some updating.  The bathrooms are nasty",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Ron J.\", \"AuthorLocation\": \"San Pablo, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1579305600000,
        "ReviewContent": "Friday 1/17/2020 my mom stepdad and friend attended mel-o-dees I arrived 1st alone when I got there I ordered my friend and myself a margarita and opened a TAB I was by myself as I mentioned so my friend arrived and then my mom and stepdad arrived and they opened a tab so my mom bought us drinks as well. The drinks were good coming from the same BARTENDER that made mines when I arrived so time went by I ordered 2 more drinks on my mom and STEPDAD tab they were made by the same BARTENDER they were good and later I went to order my mom and myself 1 on my tab and the other BARTENDER made them so I gave my mom her drink and she was conversing with an old school friend and I went and set with my friend and I sipped my drink it was sour and as I turned looking for my mom she was at the bar asking for her drink to be fixed and was turned down disrespected and some. So I went over there asking can the other BARTENDER just remake them the glasses were still full the other BARTENDER stated we will have to charge you for new drinks I said ma'am they are still full she began to be sarcastic and make a scene saying they want the other good BARTENDER apparently shes better than me so I just asked for a refund on the last 2 drinks which were both full glasses and she began to ignore me so my song came up to sing I left and this stranger white guy brought me my card I was confused so when I went and asked them why would you close out my tab with a stranger a guy I never met in my life and I stood here asking to close it nicely for 10mins and as soon as I go to sing you give a total stranger my card I don't have no receipt no nothing then she states well he paid for your tab I said I don't know him I didn't ask him to pay for my tab where is my receipt because she then states that she did charge me for the 1st drinks and he paid for the other drinks she didn't give me no receipt I called the police they were racist as was the security at the bar I will be taking this to court as bad as identity theft is in the world today they couldn't even apologize about giving my card to a total stranger which happen to be a white man they thinking just because I'm a black woman I'm supposed to be ok with this stranger paying for my drinks and getting my credit card no I'm furious and disturbed that they thought I would be happy I can pay for my own drinks and futher more my husband who wasn't present wouldn't appreciate me taking money from another man who is a stranger I will never go back here but best believe I will be suing them.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Tamara D.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1574035200000,
        "ReviewContent": "I love it...Different kinds of crowd's & so far the bartenders are nice. Great booze selection....It's in a shopping plaza.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jennifer C.\", \"AuthorLocation\": \"Santa Rosa, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1570665600000,
        "ReviewContent": "10-4-2019...9:15p.m.First timer... Mel-O-Dee Cocktails is a must go to for Karaoke...I had a blast...Now imma bit shy when it comes to doing karaoke but this place is hella kool...The regulars here can get down and aren't shy as me...plenty of songs to choose from ya diggg...Drinks are decent...Karaoke is great...Come on in and have a blast...Gotta work on my karaoke skills...lolMost definitely will be back",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jesse C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1568332800000,
        "ReviewContent": "So stinkin' fun. They have a full bar, and a huge book of songs. They don't have any recent songs from the last... I would say several years, but they will absolutely have something for everyone. Their little stage is great as well. DJ is behind you in their little booth.The best part? Everyone is welcoming and kind, the customers love to cheer you on and will also compliment you after your song.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Maggie C.\", \"AuthorLocation\": \"Kansas City, MO\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1566691200000,
        "ReviewContent": "Oh wow, this vintage watering hole is a major throwback deep into the last century when men in gray flannel suits and matching porkpie hats patronized their neighborhood bars to share their troubles with the bartender. If you saw any sitcom back between the Eisenhower and Reagan years, there was always a scene in a bar like this where the misunderstood husband plots with his best friend on how to get back at his wife for carelessly overspending their household budget. Jamie W. and I discovered this spot quite by accident after shopping at Trader Joe's.I have to admit I was intrigued by the retro sign and the fact that you can't see anything inside until you enter the side door where of course, the bouncer checks for your ID. Inside it was like something out of that sitcom with regulars talking over each other just a little too loudly as they were downing various well drinks. Jamie W. and I fit right in by ordering $8 Makers Marks and Ginger (photo: http://bit.ly/2L65uXH). They have a back room with red paisley wallpaper and quite an elaborate karaoke set-up. We have yet to make it for karaoke but give us time...and enough Makers Marks and Gingers. Mel-o-Dee...oh wait, I get it now.DRINKS - 4 stars...not watered down, thank goodness AMBIANCE - 4 stars...mid-century throwback, love itSERVICE - 3 stars...not sure I'd share my troubles with him but certainly friendly enough TOTAL - 4 stars...drop the micRELATED - Looking for libations? Here's a collection of places I've tried and reviewed: http://bit.ly/2YJ1IbU",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Ed U.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1566604800000,
        "ReviewContent": "Fun, eclectic bunch of patrons but their karaoke equipment is the worst I've ever seen or heard. They seriously need to upgrade!",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Hugh G. R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1565568000000,
        "ReviewContent": "Love this place. Nice environment and staff. Great drinks and friendly folks. Worth stopping by for a drink.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jay D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1546732800000,
        "ReviewContent": "The jewel of el Cerrito plaza.... great place to sing and enjoy spirits.I encourage visitors to go!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Roy Anthony P.\", \"AuthorLocation\": \"Manhattan, NY\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1541376000000,
        "ReviewContent": "We did a 3 ladies birthday party here from 6:30 to 8:30 and then stayed for a while. So much fun! The DJ makes it awesome and Ralph was so helpful. We had food catered and everyone bought their drinks. My friends said this was their best party ever.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Anna H.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1526601600000,
        "ReviewContent": "Stumbled on the  Mel-O-Dee as an extension of a friends birthday party, telling us we have to go to this place it's little gem. Whoa who knew nestled between the Trader Joes and a Chinese restaurant is the  nondescript front if the place, walk in side and YES red velvet wallpaper, great lighting really nice folks and some of the best karaoke singers ever. Many of the folks are regulars but everything is comfortable. The kareoke DJ did the best version Melanie's \" Brand New Key\" and runs the show perfectly. I'm coming back as there are few jewels like this around.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Kevin R.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1526342400000,
        "ReviewContent": "no place better to get faded cheap on a friday night and act a fool on the karaoke machine in front of a hundred strangers.  seriously....  ; )~",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Randy D.\", \"AuthorLocation\": \"Cincinnati, OH\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1521504000000,
        "ReviewContent": "This is a great place to ho with pals and coworkers to sing karaoke and have a beer. Some if the singers are amazing and it is a ton of fun. The only reason I didn't guve the full 5 stars is that the wine selection is nit very good. Aside from that, it is grand!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Brenda K.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1514160000000,
        "ReviewContent": "If you don't like Mel-O-Dee we can't be friends.Mel-O-Dee is a divey lounge-slash-karaoke bar in a strip mall off of San Pablo in El Cerrito.The drink prices are reasonable, the bar staff is friendly and puts up with a sometimes rowdy crowd pretty well.I've only been here on Friday nights during karaoke time. It's public karaoke in a room that holds about twenty people - there's a bar area that also holds about twenty or so.The crowd is a mix of regulars, former high school musical dorks, and just normal folks that want to sing Torn really loudly, dammit.The crowd will get up and dance when someone hits a good number, which also takes some of the attention off the singer (pro-tip if you want to sing but perhaps not too public ally).I've heard rumors of some amazing late-night Tibetan dance circles happening here... ask around, I haven't been here late enough (yet!).",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Bill H.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1512518400000,
        "ReviewContent": "One of my favorite local karaoke spots. Ralph, the owner is so nice! It gets pretty busy on weekends. Karaoke Wednesday-Saturday! And there are hotdogs on Wednesdays! I don't drink but it seems like everything is incredibly reasonably priced. This place has been here forever, come by.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Elana J.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1507334400000,
        "ReviewContent": "Mel-O-Dee is a great venue for people wanting to have a fun time throwing back a couple of drinks and belting out a few tunes. If you have an open mind, don't mind a being a bit crowded, this place is tons of fun.  I was introduced to this place over 5 years ago, and I have since become a regular.Pros:    Large song selection.  This is one of the original KJs that had bought the long song sets back in the day.  They have many songs other people cannot get anymore.    Friendly staff.  Always aim to please    Friendly regulars. Mel-O-Dee has allot of Karaoke OGs.      Cheap drinks. Fun drink specials. Strong but not too strong.  Nothing super fancy, but for $7 a drink or $4 a beer, you are getting more than what you paid for, poured correctly, and well balanced.    You can submit a new song every time you sing, so if you get there early, you will end up singing allot. (People who come in late grumble about how others got to sing multiple songs, but it's their fault for coming in late.)    Hole-in-the-wall old-style décor that is campy, fun, and comfortable: Crushed red velvet wall paper, saloon doors to the restrooms, old style pleather lounge seats, etc.    They do party reservations.    Popular place, so allot of good singers.  Some do not sing so great, but they put their heart into it, so its always fun.  Others are spectacular and will make your jaw drop.    If the song queue is closed, which happens from time to time, wait it out.  Towards the end, especially on weekdays, people start bailing early.  IF enough people bail on their songs, you can then (Politely) ask the KJ if you might be able to squeeze a song in. (Don't forget to tip!)Cons:    Sound system turned up too LOUD.  Easily compensated by ear protection, or a bit of cocktail napkin.    Small venue that gets crowded quickly.  If someone has a party going on, be prepared to have to squeeze though people and only get to sing once or twice.    If you get there late, especially on the weekend, the song queue can get filled for the night. (This is understandable, as there allot of people who come here).    Limited seating. On a crowded night, be prepared to stand.Overall the cons are minor, and are easily overcome.  This is a REALLY fun place for Karaoke... unless you are a self-entitled priss or wannabe baller who likes bling and status more than fun... then you best move on to the expensive, overpriced, private room karaoke parlors with over-priced, watered down drinks with fancy colors, fancy glass, & fancy garnishes (I mean, as long as they look fancy, you don't mind their quality, right? Dumb-ass.)Now about the few bad reviews for this place...I actually took the time to read through all the one star and two star reviews for this place, which are very few, and I can honestly say that almost all of the bad reviews were fluffed up bull by unreasonable people wanting more than they did not deserve for less than they should pay, were people who were jerks who had a personal problem, or happened to hit the place on that once in a blue moon off-night.Let's face facts... there is only 1 Karaoke system set-up at this venue. If you come after 12:00 on a weekend, hand the KJ a first full of songs, don't tip, act like a jerk, and are already a bit drunk... you probably won't get to sing.ALSO: Anyone who complains that any karaoke venue doesn't have the songs you like, or not enough of the newest songs, they need to understand that US laws with licensing and copy write for songs and lyrics have a ton of red tape. New songs are extremely difficult to make and acquire in the US.  Sound Choice (now Phoenix Entertainment Partners) have been suing people who have moved their songs from CD to digital format, left and right, causing allot of road blocks for KJs to legally use the songs they have already purchased.  The songs online for sale and download from the UK are mostly not legal to use at all (let alone commercially) in the USA.  SO CUT THE KJs SOME SLACK, PLEASE!!!!https://www.digitalmusicnews.com/2013/07/12/karaoke/ https://www.imaginelaw.com/top-myths-about-karaoke-cd-g-users-legal-rights.html",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Paul H.\", \"AuthorLocation\": \"Pinole, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1502755200000,
        "ReviewContent": "When the Tibetan community shows up, it is a party house with jamming music.  It is a hit or miss when the Tibetan community shows up.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"David Y.\", \"AuthorLocation\": \"Washington, DC\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1502668800000,
        "ReviewContent": "Just sing me a mel-o-dee why don't you?! Because if YOU don't sing it... you'll regret hearing me \"try\" to. Belting my lungs out anywhere other than the shower should be strictly prohibited. But when I get to feelin' myself at Mel-o-dee, I just can't control it. Four cocktails in on a Thursday night here, and you might get the pleasure of seeing me singing and dancing on top of the bar! Okay... I'm exaggerating. However, I can't deny that this place is such a fun time. Located next to Trader Joe's in the El Cerrito Plaza shopping center, Mel-o-dee serves up some really strong cocktails while providing a wonderful spot to sing along to your favorite tunes. It's the oldest bar in El Cerrito and is still going strong for so many reasons! For one, the bartenders make the drinks here really strong. You won't need too much liquid courage to get you singing when you come here. To top it off, their drinks are super cheap! Cheap drinks that are still strong and tasty? Yep, I'm a fan of that! The employee turnover here is really low.  Some of those bartenders have probably been working there since before I was born! Now, that's what I call dedication. The venue itself is pretty comfortable. You first enter through the bar area which is long and wide with a counter that's also located on the opposite side for additional seating. The lounge area is pretty spacious. There are usually tables out in the middle of the floor and cozy booths which usually fill up by the end of the night. This place also has tons of TV's and tends to get quite packed during sports games. The best nights to come out are either on Thursday or Saturday nights because of... you guessed it: KARAOKE! To be frank; I've never been the biggest fan of karaoke. However, I absolutely love the karaoke nights here! My friends and I used to frequent this spot at least once a month on Thursdays to have a karaoke night. But lemme tell you the REAL reason why we kept coming back here... to watch the regulars sing. It's the most entertaining thing ever! If you've ever felt too shy to get up and sing karaoke, just watch the people who do it here every Thursday. That should be enough encouragement for you to get your butt up there on ANY day! And when I say entertaining, I mean hilarious. I gotta keep it real... most of you folk' do NOT know how to sing! Half of the time, I feel I'm watching America Idol audition rejects. But damn, it is just soooo funny! If these people can come here and sing like this every Thursday, then damnit... I can do it too! It's like a comical musical... best thing everrrr! Not everyone who sings here is bad. Some of them have vocals... I'm just saying that most of them don't. And that's okay, because everyone gets a big laugh out of it. I love getting up there and making a fool of myself... sometimes! The list of song choices here are endless! I've found songs on here that I didn't even know could be used for karaoke! They have a super diverse selection of songs of all different genres and times. If you're looking to have a fun night of karaoke, I would without a doubt recommend Mel-o-dee! Even if you aren't into singing yourself, this place is super entertaining and a great way to spend time with friends.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Shayla B.\", \"AuthorLocation\": \"East Bay, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1499212800000,
        "ReviewContent": "The regulars do not want you to sing karaoke if your voice isn't show-worthy.  Whenever a mediocre singer got up there and sang their heart out, no one would applaud.  That's just not very friendly :(  It would be a nice place if it weren't for the snobby regulars.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Sonora S.\", \"AuthorLocation\": \"MD, MD\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1498953600000,
        "ReviewContent": "Fun place.  Friendly people.  Fun times to be with friends.  Excellent bar.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"James M.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1498694400000,
        "ReviewContent": "Always have a knee slappin good time at Mel-O-Dee!! We love the eclectic crowds you never know who you will see in the place, and Karaoke fun like you wouldn't believe dancing and all!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Denine J.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1498348800000,
        "ReviewContent": "This bar is located in the El Cerrito Plaza, just past Trader Joe's.  It is definitely a dive bar with it's regulars.  The clientele spans a wide range of ages and ethnicities.  I'd say the age range is from late 20s to 65+.  We went there because we heard they had karaoke on Friday nights starting at 9pm.  When we first entered the bar it was about 6pm and we felt quite unwelcomed.  The bartender was asking pointed questions basically trying to ask what were we doing there, he made us feel like we didn't belong there.  We stuck around though because we really wanted to be there for karaoke....we ordered drinks.  I asked for a hurricane and ended up with a yucky long island.  If you don't know how to make it then say it...don't just pawn off something else without asking!  After about three hours of waiting, karaoke started.  Now that was fun...everyone was respectful to each singer..old and young...good or bad. The three hours before were uncomfortable though and definitely left a bad impression.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"T F.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1480982400000,
        "ReviewContent": "Great staff, good prices for drinks, fun karaoke, and often free food. Can't go wrong at the Mel O Dee!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jerry C.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1479254400000,
        "ReviewContent": "I've been coming to this bar since 1968. Since I was 21 years old!!And Ralph has kept  a  great job to keep the old reputation goingFrom the Joe Demartini!The original! They're busy almost every night!Great people and great drinks!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"SR W.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1475193600000,
        "ReviewContent": "The patrons and owners just don't care to follow the no-smoking ordinance posted on each pillar outside. Not cool at all when I am with my small kids and just trying to hit Trader Joe's on a weekend morning. No matter the time, there is a group of smokers.Fun bar to enjoy on karaoke night, but they don't care about their community or the law.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Amy D.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1473897600000,
        "ReviewContent": "I was pretty hesitant about going to a karaoke bar in a strip mall, but Mel-O-Dee did not disappoint! First off, the drink prices are super reasonable... much cheaper than at some of the nearby bars on San Pablo Ave. I tried a few different cocktails and they were all good. The staff was super friendly and the karaoke was on point! It's a mix of regulars, people who are actually decent singers and then those who are just awful but don't care and have fun with it. The one thing I will say is that it's a bit of an older crowd (my friends and I are early/mid twenties and were the youngest ones there by far). But honestly, who cares? This place is great and I will definitely be back.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Lauren T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1472428800000,
        "ReviewContent": "The bartender ( I think she said her name is Margaret) she is so rude. We (my company) was trying to speak to a manager/ owner / event person etc. and Margaret said \"9a\" and just hung up while I was in the process of asking for someone else. Then we called back to speak to Owner and get the info. we needed. She said \"hold on\", came back and gave #, then I said\" may I have his naaaa?\" She said \"ok, bye bye\" and hung up on me again. Who gives a # and no name or info with it. She was so rude, we will not look at this spot for our office party anymore. The coworker that recommended it also said that the bartender can be a little slow & short with you at times. Guess they were right!",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Joe B.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1468368000000,
        "ReviewContent": "This place is great for a laid back evening of karaoke. Their selection of songs is insane! Two gigantic binders full of music! Any song you could ever imagine, they have it! They attract a large variety of people which I think adds a lot of integrity to the atmosphere. The bartenders are friendly and the drinks are good and well priced. I am definitely a fan (:",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jami E.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1468022400000,
        "ReviewContent": "This is such a chill place to go! The crowd is very dynamic. You see all sorts of ppl: dressed up, dressed down, pumped up, chilled, loud, quiet....it's a mix. What I love about it is the atmosphere. It's not like other places where you have ppl getting kicked out or fights starting. The ppl are friendly and the bartenders are sweethearts. The owner is a down-to-earth friendly guy who would check to make sure we were doing ok with drinks and whatnot. We went one weekend and lots of karoakers seem to be in the mood for 80s songs with some country thrown in there. Another time we went, most of the songs were slow ballads mixed with hip hop. Last time we went, there was a group of awesome singers who killed with their vocals. There was this Asian girl who gave Eminem a run for his $$$ They also have a dance floor to shake what ya mama gave ya, when the mood hits. This place can get packed on certain weekends so getting drinks may be a bit tricky.  So far, there was at least one birthday being celebrated there when we visited. I do recommend this spot if you are bored, in mood for some entertainment, want to show off some dance moves, crowd watch, meet new interesting ppl, fulfill your hidden dream of singing in front of a crowd, or just want to try something/some place new. Love the crowd, love the staff, love this hidden gem!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jacie F.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1466812800000,
        "ReviewContent": "This place is super accommodating we came for my friend's birthday party and they allowed us to bring in a cake and they are flexible with meeting ur needs. I ordered several drinks and requested to have different ingredients. The bartenders obliged me and still charged me the standard fee. This spot is like a dive bar and you can definitely tell that their are regular locals. The highlight of this spot is the karaoke. Some of the older cats will blow you away. They can sang! But surprise you with rap songs and love ballads. The crowed was diverse ( older, young, mixed races). Towards the end of the night we all danced hugged and shared the mic. Our singing wasn't that great but the community we created definitely was.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Shawneshia H.\", \"AuthorLocation\": \"Pittsburg, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1457740800000,
        "ReviewContent": "What a fun place! I met up with some friends here for karaoke. It's in a random shopping plaza so I wasn't sure what to expect at first. The crowd here is pretty diverse and everyone loves to sing and have a good time. The karaoke area isn't that big so go early if you want to grab a seat/table. The bartender we had wasn't that great though. The drinks we ordered weren't as strong as other reviews stated and my AMF was disgusting. Maybe it was an off night? I'll give it another chance.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Xue Vee Y.\", \"AuthorLocation\": \"West Covina, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1455062400000,
        "ReviewContent": "Love this place. The bartenders are great super friendly. We always have a blast here. My husband loves singing karaoke. We have always felt welcome.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Cindy P.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1452902400000,
        "ReviewContent": "Real drinks, real people and always attentive to the patrons.  If you have good vocal cords hit a karaoke night.  Sports are on multiple tvs for the big game.  And did I say real drinks.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Glen G.\", \"AuthorLocation\": \"Castro Valley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1446508800000,
        "ReviewContent": "I was going to put this off, writing this review, as I do most things, but this place deserved a prompt response.  Great karaoke vibe, people dancing to your song, and helping you with backing vocals if you need it - and I did.  This was my fourth time singing karaoke, and I appreciated the support from everybody - one dude said I nailed the song feel like makin' love.  The clientele and the workers all seem like one big team to make sure every one has a good time.   Bathrooms are really clean and empty every time I had to head that way - that;'s where I went to get psyched for my song - the bathroom lobby is behind the 'stage', so it kind of feels like you're backstage.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Thomas S.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1435795200000,
        "ReviewContent": "6/27/15  Wow will I never go back here.  The woman who checked IDs, total sweetheart.  But I went with a group of co-workers who love to karaoke, this was our first time trying this place.  They got there at 9 and put in song requests, I got there at 9:45 and an hour later they still hadn't gotten to sing one song between them.  Despite the KJ rudely informing my friend \"one song per person\", we watched the same 5 people go up over and over for 2 and a half hours.  After a while, it didn't feel like karaoke, it felt like \"In Concert\".  And then it felt like torture.  I don't mind if people aren't amazing singers but I really minded that it was a Saturday night, the place was packed full of people making requests to sing and the ONLY ones who got to (for way too long) were the same group.  I get it, they knew the KJ but come on, they don't even have this kind of favoritism in San Fran karaoke bars.  And how do you selectively exercise a \"one song per person\" rule?  Do you think we don't see the repeat performers?The ONLY good thing was that the drinks were dirt cheap.  But in an effort to not be slurring when they finally tried to go, my friends weren't drinking that hard.  I got so frustrated I just told the bartender to close our tab because we'd been there two and a half hours and were tired of waiting so we were just going to bail.  She was kind and went to talk to the KJ who then got super angry at 'being questioned'.  She promised 30 minutes more and my friends would be up so we actually stayed.  And were treated to him having a talk with the 5 mic hogs who proceeded to death glare at our side of the room for shutting down their private concert.  But give me a break.  It worked.  They still went up but there were new performers sandwiched between their repeats.  My friends got to sing and I got to get the hell out of there before dawn.  When you're having fun, you lose track of time.  I went with a group to Jaguar Karaoke in Oakland, private booths, total blast, we were there 4 hours and had no idea.  When you're being tortured, like we were at Mel-O-Dee's, time moves SLOW.  After, I told another friend about our experience and she had experienced a similar thing on another night there.  Her first and last trip too.  I get why the regulars go back, or the people too drunk to realize its the same people performing on repeat but everyone else?  RUN.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"M A.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1433548800000,
        "ReviewContent": "I really like this place. It's sort of off road so you can have to look for it a little bit but this place is always jammed with people, and they have karaoke five nights a week. So you should call for the times. But the place is always filled to the limit with happy people. Like with most karaoke bars is always a couple really really find talents but I would say so many people in here are such great singers. And the people that work here are very very nice and are hospitable and make you feel welcome. It is a full bar with a Jager cooler and it has a karaoke room in the back which is full functioning and very fun and definitely has a lot of regulars that come here to enjoy it. Definitely recommended.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Thomas B.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1432857600000,
        "ReviewContent": "Came from out of town 3 times - each timeThe guy who is DJing cuts people off by 10pm. Haven't had the chance to sing here once as the guy shuts it down too early bc of requests. Good place to sing, but get here early otherwise you'll spend the night watching a group of 20 singing together and take up all of the guy's time to \"DJ\"",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Scott B.\", \"AuthorLocation\": \"Arcadia, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1431734400000,
        "ReviewContent": "I have to admit, I was a little skeptical coming here. A friend of mine suggested it and so we decided to celebrate both our bdays last month. Bottom line, not enough places like this exist. Most karaoke places these days are in the Asian style, where you rent a private room for you and some friends. To me, that's not very fun. This is the kind of place that makes karaoke fun. You got people willing to dance and it's not too intimidating because everyone is just out to get loose and have a good time. Some reviews say that the song list is lacking but I thought the book had a great selection. There were some newer songs that people did (I remember hearing some Rihanna and Katy Perry) but honestly, nobody wants to hear new songs that most people don't know at a karaoke joint. The songs that got people moving and having a good time were 80s and 90s jams (arguably the best years for party jams anyway). The only downside really is that the place will put off most young folks. The bar area was full of a bunch of older guys but the back was more for the late 20s and 30s crowd, where the karaoke is. Also another minor note is that the singing area doesn't really have a monitor for sound, so it's kind of hard to hear yourself and the music when you're the one singing. But other than that, it's everything you could want in a karaoke place. So queue up a throwback jam and enjoy having fun with a chill crowd at Mel-o-dee.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Daniel B.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1430784000000,
        "ReviewContent": "The bomb!!  I have never done this.  After a few people I got the idea and dive right into it with Mondance from Van Morrison and the Love me Tender by the King.  I was going to go for a third one but before I knew it was after 1 a.m.!!! Had to leave... Oh well, next time!  Crowded but really friendly and great party people from all over the rainbow! I must go back soon.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Arturo G.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1430524800000,
        "ReviewContent": "On a very random Saturday night me and a friend came in here to find this place to be pretty cool. But not really my place or maybe I wasn't having enough to drink to enjoy. It has a very divey/karaoke bar feel because that's what it is. Lol And I told my friend next time we go we have to karaoke so until next time. It's a must try because it's in the middle of a shopping centre so it's not exactly what you expect. But it's a very casual place. Service was nice and other customers were friendly too!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Melissa T.\", \"AuthorLocation\": \"Contra Costa, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1429228800000,
        "ReviewContent": "Pretty awesome.  Went here with friends on a Thursday night.  Very cool crowd, real people, no hipsters, no \"bro-grammers\" just a nice mix of black and white folks, Asian and Latino folks, everyone seemingly \"normal\", just people who like to drink and sing.  No pretentious douchebags - a nice break from the San Francisco scene.  Decent sound system, although a tad loud, \"strident\", might hurt your ears if you get too close.  But the interface with the monitors and the KJ all worked well.They've got a nice dance floor, and people definitely got up to dance on more than one occasion.  If you pick a funky groove, you'll get the crowd moving.  Yes, it's a little weird that this bar that feels like it's transporting you back to the Eisenhower era is sandwiched in between Petco and Trader Joe's.  I don't know too many \"strip mall bars\", but we got over it quickly enough.  Plenty of parking, there's an advantage!  I would totally go back to this place.  It worked well, the people were cool, and we all had a good time.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"FoodDudeS F.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1427932800000,
        "ReviewContent": "It doesn't get more East Bay than Mel-o-dee! Generally, establishments that try to do too much wind up not doing anything at all. Not so, at Mel-o-dee. A symbiotic relationship occurs in this magical place: the affordable and generous drinks loosen you up to SANG your heart out. The people (usually a diverse crowd, age-wise too) respond as though you're the pied piper, and move onto the dance floor and get down. The temperature in the room rises; people need more drinks, and the night goes on and on and on. While the ambiance isn't the prettiest, the place is clean, and the staff are quick and polite.Bring some friends, get your drank, sanging, and groove on, at Mel-o-dee.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"David D.\", \"AuthorLocation\": \"New Haven, CT\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1422662400000,
        "ReviewContent": "Best local spot... \"where everyone knows your name\" or want a strong drink, friendly chat with the bartender and a laugh with  good friends!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Beck S.\", \"AuthorLocation\": \"Fremont, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1422057600000,
        "ReviewContent": "Awesome crowd! You have to check it out! Great folks that came over here. Delia runs the DJ and karaoke! Drinks are served strong. Private parties are welcome...small place by its by Trader Joes. Would never know its here. I would not sing here as compared to the singers here, I would be boo'd!! Lol",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Edna G.\", \"AuthorLocation\": \"East Bay, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1420243200000,
        "ReviewContent": "My friend, who is a hundred-year-old Chinese countryman in a 30-somethings body brought us here, because he used to love Mel-O-dee back in the day. It seems pretty cute at first, until I tried to sing some songs.... They don't use internet to play Karaoke, they literally bought all of the songs in their collection and only have those to choose from. They apparently haven't bought a new song since 1980 either. I wanted to sing super popular ratchet songs like Tinashe (2 on is so freaking good!!) or Paranoid by Ty$.. but they didn't have ANY new music!! it was incredible to discover.. Finally, I fell back on the old favorite, Alone by Heart.. and was so happy to be singing it, but i was cut off! and not because of my voice- which i wouldn't really blame them for. Their Karaoke version of alone is just a truncated, 2 minute quickie!! I was just getting into it, when the song just ended, without a warning. I thought there was a technical difficulty, and turned around to ask the DJ what happened. She said \"the song ended\". Astonished.... i left. Sorry, but Mel-o-dee really needs to step up their game before I ever go back.Also, the drinks are not special. They are your typical getting-drunk kinda drinks. So this place really has nothing to offer. The crowd on the other hand, was fantastic. I'm not sure why such fun people patronize this place.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jim H.\", \"AuthorLocation\": \"Davis, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1418947200000,
        "ReviewContent": "I'm a sucker for dive bars with the cocktail class sign on the exterior of the building. This place is a complete throw back. It's like they decorated in 1971 and said, \"It's perfect. Don't touch a thing\" and then didn't. We were in on a Friday and coming in at 7 PM, we got the last table and four chairs in the rear Karaoke room. It was mult-age, multi-cultural and multi-talent. There are clearly regulars who seem to come up over and over again (most of whom bring enthusiasm rather than vocal chops) while others turn in their slips and wait forever to get on. I like the sound system and the screens which tell you who's up next and who's up after that. The KJ really kept things moving. Someone else mentioned that the song selection is small but I thought it was great. As the night wore on, it got REALLY crowded and REALLY hot back there. One of the females in our group was accosted by a drunk guy and groped a bit and a guy (I couldn't tell if he was a bouncer or a regular guy) came up, asked my friend what happened and dealt with the situation quickly and without drama and the \"drunk uncle\" was bounced out of the joint. The Mel is in a shopping center and it's around the side and not well lit or signed so you may miss it the first time.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Brian B.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1414108800000,
        "ReviewContent": "Mel o Dee was by far the best karaoke bar I've been. Everyone that sang was really into it, and majority of people were super talented! I loved the vibes I got when I walked in, very friendly, and supportive. The drinks are cheap and the bartender is awesome. The location makes ms really happy, right next to trader joes. They have a huge variety of karaoke songs, and a lot of the customers are older and sing frank Sinatra type songs. It's so great! Definitely check it out if you like cheap drinks and rad karaoke!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Amy A.\", \"AuthorLocation\": \"Portland, OR\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1407801600000,
        "ReviewContent": "Karaoke dive bar, with some awesome wallpaper. I went here with a meetup group and had a great time. The beer kinda sucks, various dive bar offerings, but you can bring your own food. The place is hiding on the south side of a strip mall, and is handily close to Bart. Definitely worth checking out in El Cerrito.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Peter N.\", \"AuthorLocation\": \"Pittsburgh, PA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1399507200000,
        "ReviewContent": "One and only bar in town where you can relax and  have a good time .. Enjoy every one and get ready to boogieeeee.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Tsering L.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1391904000000,
        "ReviewContent": "I have been coming here for years! The drinks are cheap, the crowd is never the same (which makes it exciting every time you go in), and Ralph, the bartender and owner, is terrific and down to earth. I have been here with co-workers, family, and friends which means it's a place a lot of people can agree on. However, if you're not an open-minded fun go-getter, you may not enjoy it as much but this place really doesn't depend on people of that sort since it is usually packed to the front door. If you're in town, go by for some drinks and karaoke fun!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Faye P.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1388016000000,
        "ReviewContent": "So my Friend took me here  for a after work drink release and i loved there Mai tah's are the bomb .dot . we recently went there for Karoke and had so much fun i love this place its cheap with drinks and happy hour is cool. only thing is no food",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Elizabeth G.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1382659200000,
        "ReviewContent": "Words cannot describe how friendly, professional, and down to earth the entire staff is at Melodee. If you want to show family, friends, co-workers a really good time witha fun-filled evening...then Melodee's is the place! Drinks are very reasonable, thecrowd is very supportive of your song selection!  And you're just simply in for a great time! If you look at the bad reviews on this place, most of them have nothing to do with the service or good feeling you'll receive for just being there.....so enjoy! Fun awaits!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jess B.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1376870400000,
        "ReviewContent": "Love love love this place. Some of the nicest people here always a good time and great prices. Kareokee is fun and the fuzzy wallpaper from the 70's is super sick.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Tiffany C.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1366761600000,
        "ReviewContent": "I went to my friends birthday party last night at Melodee and had a great time! We sat in the booths in the back and sang karaoke all night with the help of many pitchers of beer. Nice vibe I'll be back. It was located in a weird spot in a shopping center.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Emily R.\", \"AuthorLocation\": \"Pleasant Hill, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1362268800000,
        "ReviewContent": "Great place to hang out with friends for drinks, karaoke, and a bit of dancing.  Dance floor is small, but cosy.  I would recommend this place to anyone with a small group.  Parking was great since it's within a mall.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Eileen C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1360022400000,
        "ReviewContent": "Went here on a friday night to scope the place out. Went there after work had a few beers on tap. They have a dry erase board with drink specials. The price was decent. It's a cozy little bar. I drove by and passed it a couple of times. I came mainly to check out the Karaoke scene after 9pm. While waiting, I was having some beers and watching sports on the tv. The bartender guy was friendly and was into sports. When 9pm came i stuck around to check out the karaoke scene. They had some pretty good singers, and a few people singing for fun. I would definitely come back to watch sports, drink and sing a few songs. I would definitely come with a group of friends.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Richard B. F.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1359590400000,
        "ReviewContent": "great spot for karaoke!!  they have an awesome selection of songs, a nifty dance floor where almost everyone is dancing and there is a different crowd that shows up every night.  i think on wednesdays, they even have hot dog night where they provide free hot dogs.this place is so much fun!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Amy L.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1355184000000,
        "ReviewContent": "OK, Yes the wallpaper is not a joke!  This place has become my favorite spot in El Cerrito.  The bartender Ralph is a very nice guy, but what I really like is the Asian duo that takes over Fridays after 9.  Wooohoo!  Karaoke DJ is the MAN.  He's got all the latest, and oldest songs.  BOTTOM LINE!  AWESOME PLACE, TIP THE BARTENDERS AND THE KARAOKE DUDE!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Eric D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1350950400000,
        "ReviewContent": "I'm not a karaoke singer but I love to dance (only to the right song). I do enjoy watching people sing. This place is hidden in El Cerrito Plaza by Trader Joe's. They have stiff drinks & the staff are friendly but the downside of it is that if you don't get there early enough, it gets super packed. From what I have seen, the song selections are pretty wide and I believe they have songs that you can ask the DJ that aren't listed in the many binders they have. They cater to birthday parties & can bring their own food. It's a good time especially when you've got a few drinks in your system. (I still don't get drunk enough to take the mic). One more thing, I love their wallpaper! It makes you feel like you've walked into a saloon back in western days when you have a double swinging doors leading you into the restrooms.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Candice J.\", \"AuthorLocation\": \"McDonough, GA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1350518400000,
        "ReviewContent": "This place is the BEST!I've lived in El Cerrito for 4-ish years now and have been to all the local bars, alot.  This is the best one.  Why?  Karaoke nights, good prices, great bartenders and a super cool crowd.  The crowd is extremely diverse: divers, locals, hipsters, young ppl, you name it.  And everyone, in my experience, is super chill and friendly.  I've met several people here and look forward to seeing them and chatting it up.Me and my friends usually head here after some late night bowling at Albany Bowl, after drink and taco at Hotsy Totsy or just straight here.  But this place is a must-go when we go out on the weekend.  This place can def qualify as a dive, but its so much better than that.  I will prob be there tomorrow night!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Andrew I.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1342828800000,
        "ReviewContent": "This was my 4th or 5th visit to the Mel-o-dee in the past couple years, and 2nd for karaoke night. It's a very ethnically and age-diverse crowd; the staff is friendly (not the KJ necessarily, though); and the singing crowd tolerates non-regulars. I always feel like the drinks should be a hair cheaper than they are, but it's fine. You can eat inside. It meets all my requirements for a local bar!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Amalia C.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1342396800000,
        "ReviewContent": "The bar itself is pretty cute. Nice wallpaper. Nice bartender. Drinks are reasonably priced, although on the high side given the strip mall location/vibe.Friday night scene is depressing as hell. People, who I assume are the regulars, not interacting with each other or anyone at all other than a few couples here and there. The regulars (I can only assume by the fact that they all went several times before I was called up) get up and sing with no effort or enthusiasm, and sound godawful. And I'm someone who likes bad karaoke, assuming people try at all.It was probably the worst singing I've ever heard in a karaoke bar, and that's saying something. One guy gets up and sings a song while slouching in a chair near the stage, after singing along loudly and from memory to nearly every song that came on. Another guy gets up and sounds like Wesley Willis but possibly even more tone deaf and unintelligible - is he completely wasted, or just a horrible singer? Another guy gets up and sings horrible late-90's early-00's white pop rock songs really loud, it is incredibly grating. I eventually hear that I'm going to get called soon, but I can't take anymore and get the hell out of there. Throughout everything the DJ/KJ/whatever doesn't adjust the sound at all. Vocals were way too loud, backing tracks were inaudible. Did I mention that the karaoke selection, despite having a gigantic binder, is very, very small? Occasionally the host sprays fake smoke into the room, and while paying my tab on the way out I notice my throat clenches up while I'm talking to the bartender, kind of like the feeling you get when you have laryngitis. Later, it feels like I've smoked a pack of cigarettes. This feeling doesn't go away until the next morning. Gross.If I were just here for drinks... Who am I kidding, it's in a strip mall. If I were just here for drinks I'd turn around as soon as I walked in the door and heard the awful singing and go to any of the other bars in the area. If you're looking for karaoke there are many other options with cheaper drinks, a better crowd, a better DJ, and in a better location. Avoid at all costs.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"YUP K.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1338076800000,
        "ReviewContent": "This place was PACKED on Friday when we went. First let me start with how it looked upon entry. Crushed velvet and gold swirly wall paper adorn the walls..they had me at crushed velvet. It's a little seedy but it's not obnoxious. There is Karaoke and a dance floor, but get your tickets first because otherwise forget about it.It's inbetween Trader Joe's and The Junket..which are two of my other favorite places in the plaza so it works out great.The drinks were reasonably priced and the people were an odd mix..Good place to people watch and look around . Friendly staff and nice bathrooms.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Samantha T.\", \"AuthorLocation\": \"Pinole, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1335916800000,
        "ReviewContent": "It's not much to look at, but they sure know how to karaoke!Pros: Awesome karaoke selectionAwesome-er karaoke DJNice little dance floor if the mood strikesComfortable seatingGREAT screen for onlookers and singers alike Super-friendly bar staffAnd the absolute coup - free hotdogs and fresh popcorn.  I mean, seriously?!Decent drink pricesCon:It's in a very strange shopping center/plaza...in the back.  If you don't know where you're going you may not find it.  But hey, if that's your biggest problem, you're doing pretty well!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Aja J.\", \"AuthorLocation\": \"Pittsburgh, PA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1334966400000,
        "ReviewContent": "We came here for the Karaoke, we left because of the people.Frankly, this place is a bit of a dump, and the patrons are not any better. We were accosted within 5 minutes of entering the door by a large, middle-aged woman. Apparently, there is some kind of unbeknownst to the rest of the world \"etiquette\" in this place that if you place a piece of tissue on top of your empty drink, you are \"saving\" that spot. She started yelling that she would get her son to meet us in the parking lot. Mind you, this was AFTER we explained to her that we didn't know of this 'rule' and offered to move. Friendly patrons? I think not.Moreover, we had driven from Alameda to come here, since apparently the patrons are \"friendly\" and the karaoke happening. The latter was not true either; we came around 11:30 PM on a Friday, and the place was at best 1/3 full; the karaoke consisted of a mike on a mini-stage in a corner of the back room or \"dance floor.\" The selection has to be one of the smallest I have ever seen for a self-pronounced karaoke establishment. Moreover, the crowd - apart from the large, angry lady - did not seem particularly excited. No one was singing along or paying any attention to the poor sod bleating out his song in the back.All in all,  we will not be coming back.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Elena T.\", \"AuthorLocation\": \"Washington, DC\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1333756800000,
        "ReviewContent": "i have been going to the melodee for years.  besides loving the good old neighborhood bar atmosphere, i like that the regulars are always ready to welcome new people and all people.the drinks are good.  wednesday evenings are free hot dogs and chips.  most everyone is friendly.  there is room in the back for events and big screen tv for sports everywhere.it is perfect for me.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Debra L.\", \"AuthorLocation\": \"El Sobrante, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1332892800000,
        "ReviewContent": "Cute little spot.  They have Kareoke Wed-Sat. That's a PLUS!  Down side is that the Kareoke is only 2 hours 9p-11pm on Wed & Thursdays. Friday & Sat is 9-1a, which is good.  So, I wouldn't give it 4 stars instead of 5, because of the short kareoke they have on Wed & Thur cuz  they have kareoke 4 nights in a row & Idk anywhere else that does that! So, I'm sticking to 5 stars! Also, the very first drink I purchased was a plus. The bartender made a really good fuzzy navel =D",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jocelyn C.\", \"AuthorLocation\": \"Las Vegas, NV\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1331683200000,
        "ReviewContent": "My best friend came to town last weekend and insisted we (she) go karaoke.  I was surprised to see the Mel-o-Dee Lounge on the Yelp list.  Growing up near the El Cerrito Plaza, this place always creeped me out from the outside as a little kid.  I was pleasantly surprised.  Yes, it's old, but has lots of character.  The drinks are good and strong.  The crowd was very mixed as previous Yelpers stated, a good thing.  I even ran into a former co-worker there.  We had so much fun, we closed the place down.  The only thing missing was some munchies.  It would have been nice to at least have some peanuts, pretzels, chips or SOMETHING to soaked up the alcohol!  Next time I'll have to get there before The Junket next door closes for some good food.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Lisa B.\", \"AuthorLocation\": \"Newark, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1330560000000,
        "ReviewContent": "My friends and family love getting together at Mel O Dee's. They have a great DJ who don't change the order of the music. People love to dance and be social. Every night is good for singing. If you want to have more turns to sing be there early. Come party with me on the last Saturday of the month in March. April Fool's Party.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Shirley C.\", \"AuthorLocation\": \"Emeryville, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1328486400000,
        "ReviewContent": "They say that you should \"Sing like no one is listening\", but what fun is that? Sing your heart out like a superstar.Karaoke is meant to entertain, sometimes good, sometimes even more entertaining. Either way it's fun to participate or watch. We stopped into the Mel-o-dee for a couple beers and karaoke.It was packed with quite the variety in the crowd, also reflected in the song choices. My beer was great, we found seats and enjoyed our time here. Maybe next time I come back, I'll get on stage and sing one. ;)",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Rebekah T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1327276800000,
        "ReviewContent": "It was the day after Christmas and a few buddies came into town and wanted to go bowling at Albany Lanes.  The plan was to down a few shots and beers before some drunk bowling.  We never though to think that the bar would be closed inside the bowling alley as it was 11am and wouldn't open until 5pm.  We'll be back.I Yelped for a nearby bar and it was Mel-O-Dee or Hotsty Totsy, which was was closed until 3pm, Mel-O-Dee it is.  The bar is next to Chef's Chinese Food, which I've seen plenty of times. As soon as I entered, I loved the decor, very gentlemen's club like. I felt I was in a strip club with no strippers. It was 11am and the day after Christmas, but the place was buzzing with the regulars.The main bartender wasn't quite eye candy per say, but she was a nicer older lady, a grandma almost. She didn't care when we got a little rowdy and kept the drinks coming for about two hours.  Prices are affordable and they had a few specials going on as well.  There's also some space near the back for dancing or sitting down at a table or two. I really enjoyed discovering Mel-O-Dee, but is a little far from home if I'm going to be doing any serious drinking. Nevertheless, a cool bar in El Cerrito, which you don't hear often.  And the bowling? It never happened.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Alexander E.\", \"AuthorLocation\": \"San Pablo, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1319241600000,
        "ReviewContent": "I lived in El Cerrito almost a year before I ventured into the Mel-O-Dee. Had walked by it many times on my way to Trader Joe's. My friend and neighbor Dave and I walked in and were immediately greeted as old friends by Ralph, the gentleman behind the bar. We drank some IPAs and were happy. A month or two later Dave and I stopped by again, sat at the bar, and Ralph said \"IPAs?\" That's talent. Several Mel-O-Dee visits later, we noticed some folks setting up karaoke in the back room. Around this time the crowd started growing exponentially. Next thing I knew, the karaoke was in full swing, including fine voices and much dancing. I had never tried karaoke before, and was talking about giving it a go when Ralph gave me a free shot on the house to give me a little liquid courage. Several Beatles tunes later I was hooked.The Mel-O-Dee is my favorite local watering hole, and has even surpassed my previous fave, the Round-up Saloon in Lafayette.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Mark H.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1315180800000,
        "ReviewContent": "A fantastic and unique little place in the middle of a strip mall. GREAT brews on tap, karaoke and easy to get to, this may have to be my new place :) Plus the velvet wall paper is a thing to see. Good people!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Izzy F.\", \"AuthorLocation\": \"Citrus Heights, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1312761600000,
        "ReviewContent": "This place was awesome. Kitchy but not cheesy.  Loved the karaoke and that people actually danced to it!  I will be back . . .",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Lex B.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1309219200000,
        "ReviewContent": "Mel-O-Dee didn't carry a tune while I was in the bar, but comedy night exceeded my expectations, though not completely making it out of the mud. The ambiance seems pretty typical to the EC Plaza, keepin it clean while acknowledging that it's neighbors with Wing Stop. The bartender was really nice to me and gave me a free 21st birthday drink, a blueberry lemonade. I thought it was good but pretty sweet, and I can't say much about the prices as I got it for free.Comedy Night!!! I thought it was going to be really goofy rookie comedy, as the bar is located in a corporate shopping mall and I like to think the good comedians can find somewhere more interesting to perform. But! I thought the comics were all pretty good, with a funny hostess who kept things going. I was most disappointed in the headliner, who was from the Bronx and was really gimmicky and didn't really appeal to the crowd.I'd come back here, maybe for karaoke and probably also for more laughs, whether at comedians or my drunk comrades.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Evs E.\", \"AuthorLocation\": \"Scottsdale, AZ\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1304899200000,
        "ReviewContent": "Any time I'm in Berkeley I'll be found here. This is my new home away from home. The karaoke is awesome. Great selection. Great singers. A sweet dance floor. A diverse clientele that loves to sing and dance. In between singers they play music and do random line dances like the electric slide. Its awesome. I don't know most of the dances and I wish I was as cool as these people are. Mel-o-dee was made for me. I really wish it was in LA but I know that if it was it wouldn't be half as rad.Oh yeah, and the wallpaper is a mix of linen and velvet in some sort of sweet tapestry pattern. It begs to be stroked.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"April K.\", \"AuthorLocation\": \"Glendale, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1303603200000,
        "ReviewContent": "i love this place such a fun place to go on a saturday night with friends or even alone for a night of good karaoke and hot older women on the prowl for younger me(me).good selection of drinks as well and its cheap. i suually sing penny lane or she loves you and get everyone dancing on the dance floor, the people who run this bar are very friendly and im getting to know them since ive been becoming a regular here as of late. i do wish they had a bigger selection of songs even though its good already, would like them to have more beatles tunes such as the fool on the hill and shes leaving home. love to come here and experince my youngness with dancing singing and a  beer and possibly a milf or a cougar.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Paulringo M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1303344000000,
        "ReviewContent": "Mel-o-dee sits in a reconstructed shopping mall, a few doors from trader joes. Mel would classify as a dive bar except it's innards are sipfy . fancy smanchy. faux velvet? 4 flatscreens.  no pool tables , 10ish draught beerspours:-blue moon(4)fresh-gin & tonic (3) pretty strongon draught:-older crowd-cordial, friendly service-2ns room availiable for dancing? kaorake?-cheers type bar.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Victor G.\", \"AuthorLocation\": \"Hayward, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1291507200000,
        "ReviewContent": "Super fun! My fiance and I love coming to Mel-o-dee for karaoke! DeeCee is an amazing DJ, and I love how friendly and welcoming she is.  This is the BEST place to go on a Friday or Saturday night--unpretentious (hello, red velvet wallpaper and saloon bathroom doors) and fun.  I love the mixed crowd, and that everyone is there to have a good time.  Can't wait to go back soon! YAH BAY AREA KARAOKE!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Sydney W.\", \"AuthorLocation\": \"Burlingame, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1289260800000,
        "ReviewContent": "For clarification, this place is next to Trader Joes. It took me a while to find it, so if this helps at all, then this review will have done it's job.Came here on Halloween for the Giants in the World Series. The TV room area had a big big big screen above the fireplace and a couple of LCD screens up on the walls around it. Cheap drinks for happy hour, well drinks and drafts were only a few bucks. Plus you have the option to order pitchers. Karaoke later on in the night was fun! People dancing and singing along and everyone claps even if you're not so great at singing.On a side note, you get 10% off from Wingstop if you call in an order and tell them you're coming from Mel-O-Dee. What's even better is that it's literally a 60 second walk from door to door. And of course the Mel-O-Dee folks don't mind if you scarf down wings at a table.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"alex f.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1281830400000,
        "ReviewContent": "went here to celebrate my BFF's bday.   Have lived in EC for 10 years &  heard about the legendary Mel-O-Dee for many years.  It lives up to the hype.  If Yelp would let me give 6 stars, I wouldStar #1: Red velvet wallpaperStar #2: Cheap drinksStar #3: Really bad karaoke singers (like me)Star #4 Really GOOD karaoke singers like DeeCee, Massina & SoupStar #5: Humungous Purell next to the tip jar (huh?)Star #6: Fun, diverse (in every way) crowd that likes to tear up the (tiny) dance floor.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Virginia D.\", \"AuthorLocation\": \"Santa Monica, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1275696000000,
        "ReviewContent": "People complain about the surrounding businesses (typical shopping chains), but I don't think they understand... Mel-O-Dee was there first. The red velvet wallpaper is from 1969. If anything, that joint deserves praise for surviving in a corporate world. Walked in last Tuesday and found out sweet soul jams are DJ'd there every Tuesday. Inell Young & the like. The black couch benches are clean and in great condition. The dance floor is small, but the ambiance is perfect. Low lighting, comfortable. Can't say enough about the 60's decor! It's the perfect joint to chill in during the weekday if you want good music and a cushy place to unwind.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Stray C.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1273449600000,
        "ReviewContent": "I've been coming to this place for almost a year and I haven't reviewed. Here we go.I used to do laundry a few doors down from this bar and I almost walked in but it seemed way too \"divish\" for me. A few grandpa's sitting there with their Buds smoking cigarettes. I turned around and left. A few months later my brother and I decided to head in and grab a beer. Since then, this is my bar. And it's within walking distance from my house and from BART.During game days, it's a nice spot to have a beer and watch sports. They have 2 flatscreens in the main room and then 2 more flatscreens in the back, as well as the HUGE flatscreen. They are happy to put on whatever you want to watch. Wednesdays is free hot dog night. Always nice to hang out with friends with free dogs, a PBR, and the game on.Fridays and Saturdays are karaoke night. When I first started going to this bar, it was a little busy on the weekends. Nowadays, it's packed! Word must have got around. It really does get crowded but everyone is in such a great mood. The crowd is what really makes this place. At the bar, you have the football coaches having beers. The regulars are there of course - both young and old. And then you have the kids there. And everyone gets along just fine. Around 11pm is when it really starts jumping. People are singing and whenever there's a good song, people get up and dance and sing along. The bartenders are friendly and fast. Stepping outside for a smoke, you never know who you are going to chat it up with. About 7 beers on tap, amongst other bottled beers, and they have a few tequilas and the Jager already cold.The locals and regulars really set the mood in the bar. It gets crazy in a good way. In all my months going there, there has never been an incident. Maybe a kid drank too much, but that's about it. I've taken quite a few friends here and they all have asked to return. We even have friends driving from SF just to hang out there. Another reviewer complained that IT IS at a mall but that's what makes it even better - it's the hidden gem of El Cerrito. I don't even bother with all the other bars in El Cerrito. The Mel is the place to be.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jose C.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1272758400000,
        "ReviewContent": "This place gets four solid stars.... for so many, many reasons... and yes, I'm writing this review while drunk after a night here... why do you ask?So I was working at my bar and thinking about doing some karaoke. I was going to go to the city. There were several local haunts that me and my gal pals were thinking about. But then we heard there was a riot in San Francisco... and multiple DUI checkpoints and we thought.... really?Enter a patron of my bar with the words \"What? You've never been to Mel-O-Dee????\" No sir, and woe is the day that I never came across this place.The Mel-O-Dee is awesome. The drinks? Large and strong and cheap (WINNER!) and the people who work there? Rad. The people who run the karaoke? Awesome... the crowd? Oh my lawdie Miss Clawdie... totally awesomesauce.While the song book is decidedly \"suburban\" (yeah, we're divas... what?) we still found songs we loved to sing and the hostess? She was on it. Totally knew how long till it was for me to sing and wouldn't take any singers once the line-up was seriously full. When you tip her you are getting your money's worth... she is working it.The decor is awesome and I won' t lie when I tell you we had a drunk photoshoot in the ladies bathroom. What?Go there. Now. Thursday Friday and Saturday... wait, no, on second thought I totally want to get an extra rendition of Kelly Clarkson's \"Since U Been Gone\"... so don't go there.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Dutch G.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1268265600000,
        "ReviewContent": "Mel-O-Dee's has to be the best Karoke place around... Delia and Ray are the best DJ's.. and the Karoke system itself, is fantastic!!  Get there early cause it gets crowded.  You can't leave the place without trying the Delia,delicious!  Drinks are cheap and the crowd is fun.. worth the drive from the city..",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Catherine H.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1265673600000,
        "ReviewContent": "This place is a hilariously ridiculous good time.  You can truly get down and make an ass out of yourself here.  The Karaoke atmosphere is perfect, the drinks are cheap and strong, and they have a smoke machine... OH YEAH!!!!  And according to the ladies, its the nicest bar bathroom in the East Bay: it's got red velvet walls, a huge mirror, couches, and plants... very luxurious.If you come here, which you have to on a Friday or Saturday for karaoke, bring a shit load of friends.  That is the true way to experience the wildness of Mel-o-dee! Prepare to get WASTED!!!! ;()",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Julian P.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1264291200000,
        "ReviewContent": "If you are even remotely creative you will appreciate the Mel-O-Dee.Drinks: Well drinks for $2.50 that are strong and taste every bit as good as their $6 counterparts being served at similar dive-y establishments. Really friendly, fast, down-to-earth bartenders.Ambiance: Alice in Wonderland meets your grandmother's living room: each time I enter the Mel-O-Dee, I feel like I'm entering another world. As others have said, red velvet wallpaper, swinging western-y doors leading to the bathroom, Karaoke set-up complete with a laser storm and smoke machine. Crowd: Three generations getting wasted in harmony.  While crowd-watching here, you start to wonder if you could become an independent filmmaker and do a documentary on the people who frequent this bar. Amazing.Karaoke: Music from all generations appropriately represented in karaoke selections. Some really fantastic vocalists and some really terrible vocalists (as it should be!) Great KJ. Night usually ends in some sic dancing. So jump down the rabbit hole and become a part of the weirdness that is the Mel-O-Dee.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jenn M.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1259366400000,
        "ReviewContent": "From the outside you would never guess the amazingness that lies within. Nestled amidst the El Cerrito Plaza shops lies an oasis where the drinks are $2.50 (and STRONG), the dance floor is made for groovin', and there is an extensive Karaoke list. When I first got there I was warmly greeted by the bartender Ralph who promptly got our drinks and gave us free shooters later in the night (which btw were DELICIOUS). I then proceeded over to the piles of Karaoke songbooks where I picked out my song of the night. The only problem with these is that they aren't organized by artist which made it easy to skim over some favorites. In the end, it was fine though :)After many a $2.50 drink I was grooving on the dance floor with friends and listening to the Karaoke singer (bad and good) do their thang on the mic. I had to swat away the occasional creepster attempting to grind on me but hey that happens everywhere right? For the most part  everyone was good company and I quite enjoyed the uncompetitive atmosphere. I highly recommend this place! No drama. No dress code. No problem. Definitely worth a trip to the usually less than exciting El Cerrito nightlife. You wont regret it!I only wish they had Karaoke EVERY night! (Just Fridays and Saturdays)",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Nayeli A.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1258761600000,
        "ReviewContent": "I will be back -- for more drinks, the super chill and open-minded vibe, and of course, the uninhibited singing =D.Please note though -- this place is SMALL. Nonetheless, it is THE quintessential karaoke bar to just...relax and not have to worry about how you look or who you're with - hell, even how you sing.Expect people of ALL ages. Seriously. Like, your grandmother seriously shaking it to some youngin rapping to \"Get Low\". (I'm serious! Stop laughing! They did! And so did we!)BUT! That's what makes this place AWESOME! It's so flippin chill and relaxed and everyone is welcomed! ---AMBIANCE---This is an old school karaoke bar. Dive-esque. Nothing fancy. (Well..except for the velvet red/gold walls, which adds a slight old-elegant touch). ar There's a full-bar with about 10 comfy bar stools.And a back-room where the karaoke takes place with about 6-10 small round tables. Not very big...wish it were bigger. Seating is very limited if you arrive after 8:30pm on a Friday! We did...and ended up sitting at the bar..but, atleast we got seats! If you come with more than 2-3 people after 8:30pm, expect to be standing all night. (But alteast you'll be drunk and singing! That's always good, right?)---PEOPLE---Very chills and happy vibe from all. My friend's jacket dropped twice off her chair, and both times some kind-person would pick it up. Best part: Everyone totally sings along! We sat at the bar for about 3-4 hours and didn't feel pressured to get-up at all! No one shoving their ways in to get a drink. No grimey person hitting on you/staring at your from across the bar. It's all good in the hood!The bartenders are definitely very chill. Our favorite was this one lady (whom we named \"Amanda\" because she looks like an Amanda). Very sweet, smiley, and attentive. She gave me an olive when I was craving one..For only 2 bartenders, they tend to your needs very quickly!---DRINKS---Yes. They pour heavy here. Though, both bartenders didn't know how to make a basic Melon Ball...and were confused when I asked for a \"Double\" Tequila Sunrise. But, were totally chill with following my recipe and funny about it to boot! \"Oh..what is it?..Haha, well, sounds delicious! I'll have one too!\"Did I mention that they pour heavy here? And drinks are mighty cheap (relatively speaking).Between the two of us, we ordered:- 1 Melon Ball (make-shift)- 1 TQ Sunirse with 2 shots of tequilla (make-shift)- 3 Pints o Beer (they have about 6 on draft I believe. All your basics).- 1 Long IslandTotal: 6 drinks + 2 complimentary shots of tequilla = about $36! That's like...$6 a drink! WOW.How accurate the drinks were...meh. Forgiven when it's this cheap.--KARAOKE--We didn't go up to actually sing...but was still fun to sing along at the bar with folks and everyone else belching the lyrics. Examples of some songs that came up:1) Can't Help Falling in Love with You2) Get Low3) Don't Stop Believing (of course) 4) Can't Fight the Moonlight5) Kokomo Yep! So, a whole random mix of stuff!---LOCATION---Right next to the Trader Joe's in El Cerrito Plaza.--PARKING--Plenty! It's at the plaza!Yep. And that's it. We're thinkin of hitting it up again for some good ol xmas carols when it comes that time of the year for some more jolly good times!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Gail N.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1258675200000,
        "ReviewContent": "If I was to choose a favorite bar, this would be it.  With a wii, karoake, decent prices, and close to home, I have enjoyed myself here on multiple occasions.  It is always fun to sing karoake with a group of friends, notably with the DYL crowd who has come here a few times.  The most memorable moment being my brother, who never sings in front of people, doing pretty good belting out the Beatles. However, I have to say that I was extremely disappointed the last time I came.  I guess my name got lost in the karoake shuffle.  I had fun hanging out and singing to other people's songs and I am not sure how much I really wanted to sing but it was frustrating to see other people get up multiple times when I had put my name in at the very beginning (first five minutes).  After over a hour of waiting, I asked about the line-up and  was disappointed by the coarseness in telling me I was a hour down.  After waiting over that, I left never having stood behind the mic once.  This is something I expect from the karoake bars I have been to in the city, not a small bar like Mel-O-Dee.  So unfortunately that experience lost a couple stars (not to mention, that I suppose the bar in and of itself is not really my thing).  It's close and I'll come back but with reservations.  I hope it was maybe just an off night.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Anne K.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1256342400000,
        "ReviewContent": "This place, for me, has all the essential elements of a good time: diverse, friendly, laid back crowd, music, dancing, and stiff cheap drinks.  It was our first time there, and we were immediately made to feel welcome (by everyone).  I love karaoke bars where everyone is encouraged and applauded for their spirit, even if they don't sound like Aretha Franklin.  This is that kind of place.  The dancing was also a fabulous surprise - someone picked La Bamba as their song, and suddenly everyone was on the (previously empty) dancefloor.  Whoah!I love it too that there were people there from like age 20 to perhaps 60-something, all enjoying the fun.  I wish I lived closer, because if I did, this would be my regular hang.  I think they offer private birthday parties in the early evening.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Shelagh L.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1255478400000,
        "ReviewContent": "OK sportsfans, let's get cozy and set the scene so you can understand how an SF resident just gave a fucking bar in El Cerrito a 5 star review. Let us begin:Its Saturday night, and we get an invite to head to this place for some karaoke. To be spontaneous, a couple of us decide to head on over. We are getting steadily more skeptical as we notice that everyone is trying to get *into* San Francisco over the Bay Bridge, and we are the only ones trying to get out. We push on.After completing the odyssey in a motor powered horse buggy called my car, I notice that the directions dead end in a mall. I call my friend asking the absurd:\"Are we going to a bar in a fucking mall\"The response: \"Um...yeah\" (said in a tone like this was a totally normal thing that you would do all the time).We find the place on the backside of the mall and walk in to find some awesomely fuzzy velvet wallpaper...check plus! The crowd will be a weird mix of crusty old peeps and young Berkeley college types. A little weird, but just stick with it...it ends up being awesome. We get 3 well liquor drinks at the bar. It costs $11, and the pours are *stiff*. Check double plus!I notice the karaoke rules state: \"please do not swing the microphone by its cord\". Like this has happens all the time too...I'm now officially ready for an amazing night.We head back to the karaoke room which is set up like a full on stage (dancefloor included). As people take the mic, a few start to dance. At about 10PM, the whole place is tanked and people are seriously dancing like mad to people singing karaoke. How did this happen?!Oh yeah, and just when you think things can't get any better they flip on a badass laser with smoke machine. Yes, I said *smoke* and *laszszers* people...for KARAOKE...what the shit?! Crazy. I don't know how this place casts a spell over all who enter, but it succeeds wholeheartedly. Its worth the trip, and I seriously can't wait to go back.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Sean C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1253145600000,
        "ReviewContent": "i don't go out that much,but when i do, i go to the mel o dee,super cool crushed red velvet wall paper, sort of a Vegas like surrounding's every time i go a guy with a bunch of tattoo's named \"dave\" is working,very nice and funny bartender. I WILL BE BACK SOON the mel o dee is the best!!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"judy b.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1252972800000,
        "ReviewContent": "Returned to the Mel-O-Dee for 1 hour at 10pm on a Monday night to kill some time. I was alone and needed a place to catch the end of the Raider/Charger game. Hi/Low lights:Drinks are dirt cheapThe place was near empty so seating was plentiful2 flatscreens at each corner of the barHuge TV in the loungeInteresting patrons but all friendly Annoying Bartender... really annoyningbia bia",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Edi B.\", \"AuthorLocation\": \"Hercules, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1251590400000,
        "ReviewContent": "I had fun but damn...why were those KJ's on a one way train to sucktown?  The guy barely whispered your name on the mike and skipped people like crazy, totally booted me and friends off the list for no reason...and seemed to have random lame girls in the booth with him doing god knows what.  I like to call them the KJ waste of space Fluffer Sideburn brigade.  Let the guy do his job and stop sucking so bad you horrifying joke of a songstress.  But I digress, this place could be fun if I hadn't had such an unsatiated desire to sing Beat It on MJ's birthday. Jerks.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jaime T.\", \"AuthorLocation\": \"Groveland, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1250899200000,
        "ReviewContent": "Velvet wallpaper and cheap drinks (3 drinks, 2 beers = $21). We went on a Friday for the Karaoke. So good. Definitely worth checking off. With the money you will save on drinks you can pay one of your friends to be the DD. Velvet wallpaper people!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jessica S.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1248652800000,
        "ReviewContent": "Once my friends and I got over the fact that this little hole-in-the wall dive bar mostly had 40-something patrons, we relaxed and had a good time. This place is the ultimate dive bar, complete with cheap / strong drinks, tacky velvet decoration and cheap little booths, and friendly bartenders and people running karaoke. Basically this is one of those that is so cheap and tacky that it's fun and cool. I wouldn't come on a regular night, but this is a fun, nonjudgmental place to sing karaoke with a wide range of nice and supportive people. It's also the only bar I know of in the east bay to offer karaoke on the weekend. It's accessible by BART (el cerrito plaza stop) and has plenty of parking in the mall lot at night. I never thought I'd have a great time in this kind of place, but I ended up really liking it.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Denise B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1247788800000,
        "ReviewContent": "Such a cool place! And not in a \"I'm way too cool for you\" type of place.We have b-day parties there all the time and the bartenders are so nice and never give attitude. Cheap drinks and red velvet walls what more do I need to say?",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Nisi C.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1246665600000,
        "ReviewContent": "You have to be in the right mindset for the Mel-o-dee.It is not cool.  It is happily un-cool, and not in a hipster pretentious way. Its like going to your grandmother's house, and finding out your grandma can still shake it.the decor is tacky, yes, but the bathrooms are clean and the drinks are cheap.  The best thing about this place is the people. The crowd is very mixed, but there is a feeling of togetherness that warms the cockles of my jaded heart.  Its an accepting place, where everybody cheers everybody on.  (I once heard someone say \"There's no boo-ing here!\" very sternly to another patron).  So come, embrace the cheese factor of  Mel-o-Dee. Be part of the weird magical purgatory of lost karaoke souls. And no booing.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Heidi F.\", \"AuthorLocation\": \"Hayward, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1245369600000,
        "ReviewContent": "I remember the first time I went here with my friends, I was downing tons of alcohol and singing tons of songs, the next morning I came to the conclusion...This place is AWESOME!!! It has everything you want in a dive bar, a good juke box, good people, and CHEAP drinks!! They recently added girl drink special on the weekends so its cheap to buy your lady friends a drink.  Also the bartenders there are extremely friendly and very quick even with tons of people asking for drinks.  The main reason I go here is because of karaoke on the weekends which is really fun but you should get their before 12 if you wanna sing because the line is long. Overall though this is my favorite place and I always tell my friends to go there.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Joshua K.\", \"AuthorLocation\": \"Castro Valley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1243728000000,
        "ReviewContent": "Good times at the Mel-O-Dee. It was couples night and we had decided on dinner at the bestest Mexican food in Berkeley. Afterwards we wanted to do something but not night club something. The light bulb popped up over my head and I said, oh I heard there is a Karaoke bar in EC we should check it out and off we went. This place is very chill, nice older crowd and unpretentious. The drinks are cheap and the funky decor only add to the charm, think Disney's haunted mansion. The hubby was bold and got up and sang, so cute! Good times with great company. We will be back again!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Claudine C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1242000000000,
        "ReviewContent": "THE MISSION:Meet with FaceBook engineer at 10:00pm, on a weeknight, for a drink, comfortable seating and have the ability to get online....in El Cerrito.Perhaps I should restate that last detail...IN EL CERRITO!MISSION ACCOMPLISHED:Found Mel-O-Dee, great seating, not too loud, free taco bar, amazing service and...free WIFI!Perhaps I should restate that last detail...Free WIFI in a dive bar!I'm sooooo giving you 5 stars, Mel-O-Dee!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Audrey C.\", \"AuthorLocation\": \"Seattle, WA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1241049600000,
        "ReviewContent": "my home away from home! I love everyone here! mel-o-dee has to be, hands down, one of the best dive bar, hole in the wall places I have ever been to. you will not be disappointed!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Melissa C.\", \"AuthorLocation\": \"Newport, RI\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1238976000000,
        "ReviewContent": "Poor reviews for the Mel-o-dee crack me up. Which part of the awesome décor, friendly staff, cheap drinks, convenient location, and fun crowd did you have a problem with, exactly?Here's how you work the Mel-o-dee:  grab a crew of friends, come early (8:30 or 9:00ish), take over a cozy-boothed corner and some tables, throw some tunes on the jukebox while you peruse the karaoke list, get your song selections in early, tip the KJ, befriend the bartenders, and drink a lot.  Cheaply. And be merry because you're at a bar in a strip-mall that has PBR on tap and a list of \"girly drinks\" that, naturally, you must try all of (4 - do the list for under $20).  As for the karaoke -- I'm of the school that karaoke should be fun, silly, loud, drunk, and ridiculous.  The song-selection is admittedly not the greatest (some ol standbys are absent -- i.e., I think there are only 2 or 3 Prince songs), but it's all but made up for with entire MOTOWN BOOKS with ORIGINAL BACKING TRACKS.  So sorry they don't have the best of college-rock kiddos, you're gonna have to brush up on your Martha & The Vandellas and enjoy that Mel-o-dee regular who kinda looks like your dad throw down on \"Me & Mrs. Jones.\"  Which is everything you hoped/feared it would be.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Lauren N.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1236470400000,
        "ReviewContent": "My boyfriend and I went here last night, with two other friends in tow. I had been hearing about this place from a friend for a couple years and was finally able to go. The drinks are strong (and reasonably priced) but the song selection for karaoke was terrible! How could you NOT have Tommy Tutone's \"Jenny (867-5309)\"?! That's my boyfriend's best karaoke song, so needless to say we were disappointed (his backup song, Chicago's \"You're the Inspiration\" was absent from the list as well). Also, we had to wait over an hour for our songs to play, but we saw several people go up numerous times. Besides those annoyances, it was GREAT. Everyone gets really into the singing and dances to almost every song (even the slow ones. Brought me back to the middle-school days). Oh, and yes, the wallpaper has to be touched. I will go back but this time I will try to get there as early as possible in order to get my songs in.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Shawn B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1232841600000,
        "ReviewContent": "Dear Aunt Florence,When I was younger, I welcomed your visits every month with open arms. You would usually show up in the morning and kind of make a mess, but I would clean up after you and then we'd go eat brownies and nachos together. It was really nice. I really appreciated your reliability and punctuality, even though you can be kind of a pain.But, my dear Aunt Flo, things have changed now. I think we need some time apart. You are no longer welcome. Please go away and do not come back for about 40 weeks. I would like that very much. Oh, and next time you visit, you had better have a baby with you. I want a god damn baby. Teenagers make it look so easy! Poo.Sincerely,Rachel H.******************************************************************************I went to Mel-O-Dee feeling sort of bummed and irritable. When Aunt Flo visits it means I can drink again, and alcohol makes me feel better when I am bummed. So does karaoke. Mel-O-Dee's hurricanes DID make me feel better, and so did the company (Emily J., Jac. C., Debbie L., Jason C., my husband, and my parents). My friends and family are super. Five stars for them and the drinks.The karaoke did not make me feel better. The KJ does not run karaoke anywhere near as well as DoowopBob (http://www.yelp.com/biz/doowopbob---karaoke-dj-concord) from my favorite karaoke bar, The Captain's Chest (http://www.yelp.com/biz/captains-chest-cocktail-lounge-concord#hrid:K05hy5Ewinl6a121r8ZFXQ). DoowopBob is fair, has a rotation, and everyone gets one turn per round. The KJ here stinks. There were some people who got to sing three times before I got to sing my second song, and it appeared it was because they know the KJ. How unprofessional. He also doesn't adjust the sound for each singer. Some people's voices were amplified too loud, while other singers could barely be heard because the backing track was too loud. He also has a very slim song selection. Negative eleventy stars for this guy. I would not go here for karaoke again, and I see no reason to drink here either when Club Mallard is so much better.The cocktail waitress was awesome! She earns this place an extra star.5 stars for waitress. 5 stars for hurricanes. 1 star for KJ. 0 stars for Aunt Flo, that whoreface.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Rachel H.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1232755200000,
        "ReviewContent": "I was torn on how many stars to give Mel-O-Dee.  The bar itself definitely deserves 4 or 5.  It is cozy, has lovely decor (velvet wallpaper!), friendly staff, inexpensive drinks, nice seating areas, and a saloon door to the bathrooms.  Fun!I had to take off a star for the karaoke.  I had a similar experience to Rachel V. and Selina B.  I love karaoke and was excited to try a new karaoke place.  They don't have a huge song selection but that is okay with me.  The karaoke guy came around and got our song slips, along with a number of other people's.  He started going through the list.  I noticed immediately that he was not adjusting the music tracks for people.  A woman got up who had a lovely voice but we could barely hear her over the backing track.  The KJ didn't seem to notice. We sang our songs and then turned in our second slips.  Three people who had sung right before us during the first round were called up a second time so we assumed we were almost up.  Then a bunch of new singers were called up. Then one of the men who was right before us was called up for a third time.  At this point I realized that we probably weren't going to singing again.  I am fine with only singing once when a place is really busy but it seemed like people who knew the KJ were given priority and allowed to sing multiple songs before others had an opportunity. I have never expected that treatment at my regular karaoke place and was disappointed that they do it like that here. I really liked the bar and would go back...just not for karaoke.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Emily J.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1232755200000,
        "ReviewContent": "This place is well hidden! It has a very unique feeling to it and friendly bartender! If you are a P.B.R (Paps Blue Ribbon) drinker, they have it on tap for $2.50! I went with a few coworkers on a Thursday night and well it just happened to be ladies night and everything is a dollar cheaper~ it was a great night! it is your typical \"hole in the wall\" bar and it does have a full bar and does have a pretty good selection of top shelf and lower shelf. They have a tequila dispenser that keeps it cold and ready for when you want that shot. Plus I really love saying the name Mel-o-deeeeeeeeeeeee!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"S Y.\", \"AuthorLocation\": \"Smithtown, Canada\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1232668800000,
        "ReviewContent": "This was suppose to be my entourage's \"hole in the wall\" but apparently a trend has occurred to start coming here. One trip my fiancé and I took here we ended up waiting a full hour for one song and when I asked the bartender for the drinks I had on my first visit she told me that only one bartender does those \"cheap cocktail\" specials and he only works on Tuesdays. I assured her I came during the weekend and she adamantly suggested that I mixed up my weekdays and weekends - I might really enjoy my weekends but not enough to be convinced that I was displaced in some time-space parallel and Friday or Saturday was actually Tuesday!! I ended up getting a watered down, over-priced drink which has deterred me from ordering here (I'll just get some Clubs at Safeway, thanks).The most recent trip back was with my full force entourage but still we made little impact in the karaoke line - 30 minutes before my fiancé got to sing and my friend and I never got to do our \"You Ought to Know\", \"Basketcase\", or our closer of \"Tubthumping\". The only deliciously fun moment was when someone from another party sang \"Time Warp\" (which I had done on my last visit and no one had the balls/ovaries/other miscellaneous parts to dance to it) and the crowd actually joined in - I think he may have been in the musical previously (for those of you looking - \"Barely Legal\" in Oakland).I lay to rest my memories of this place. I once loved you Mel-O-Dee but I don't think I'll be back until you get another machine or learn that allowing certain singers to go more times than the rest of the crowd during \"rounds\" only annoys customers; and you get bartenders who are conscious of a patron with money in their hand who wants drinks in his/her belly. You were cute Mel but I'll be back when your ego is deflated and you remember why you were cool in the first place.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Selina L.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1232409600000,
        "ReviewContent": "Well worth another star. New comfortable chairs, new carpet and same great ,friendly serving staff. Karaoke going strong as are the drinks, which during happy hour they practically give away. Oh, they just put in a new huge screen tv in time for the Super Bowl. All this and it's still a dive. Well done folks.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Tortoise S.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1231200000000,
        "ReviewContent": "Went for my birthday. They have Pabst on Tap now, yeshhhh. And of course drinks are still super cheap.Now onto the karaoke... It was a busy night, I'll give them that. I think I was one of three parties there celebrating birthdays so I didn't get to sing until the very end of the night. Which is fine. BUT, there were people who sang multiple times before me. (one lady friend of the DJ sang 4 times). Also, my initial song request had apparently already been requested by someone else before me and I didn't know this until I heard them singing it. The DJ never told me anything when I submitted the song and when I went up there to give him another song he was was unaware of this issue. The same thing happened for two other people in my party and they were told that they can sing the same song as well and didn't need to put in another. That is SO against the karaoke rules!There are rules aren't there?!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Raquel V.\", \"AuthorLocation\": \"Las Vegas, NV\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1224892800000,
        "ReviewContent": "Got invited here to celebrate a friend's birthday on karaoke night, and had a BLAST! We had SO much fun, in fact, that we made a point to get together to do again (which happened last night), and now we're thinking of coming regularly! I've even recruited more people to join us, they're hooked after one visit =PThe bar:An awesome, unpretentious, no drama, no fuss no muss kind of place. Cheap strong drinks made by friendly and pleasant bartenders, ultra-retro fun decor (walls have velvet wallpaper and mirrors, and there's a western-y swinging door to get to the bathroom area). Dive-y and comfortable, nobody passing judgment here! And there's one crazy regular, this older guy, who makes everybody feel good by going around, telling stories, giving compliments, dancing, shaking hands, and laughing at everything, hahaha. Last night there was even someone's dog wandering around? Very cute, friendly, and didn't seem to mind the loud music, which tells me he probably comes around pretty often. Anything goes!The karaoke:Everyone could get up and sing whatever they wanted and were sure to be supported no matter what the talent level :) To get the atmosphere right, there's a  light-up microphone, disco ball, fog machine, and small dance floor XD The song list is limited (which is why 4 stars instead of 5), mostly 80's hits, classic country, and the old standards, but there are a few surprising songs on the list that I wouldn't have expected to see! Besides, those oldies are what really get a crowd going, because everyone knows them, loves them, and sings along!All in all, I recommend this place to just about anyone, because everyone's welcomed here! Expand the song list and they get my 5 stars :)",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Bettie M.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1221523200000,
        "ReviewContent": "I wish there were more old school bars like this in SF.It's definitely a come-as-you-are, neighborhood kind of place.  No drama, no \"scene,\" and I'd totally feel comfortable wearing sweats and a T-shirt. Just regular people, a little karaoke action (and it really doesn't matter how bad you are, so's the sound system and the playlist) and the occaisional drink special.  The velvet wallpaper and saloon-style doors to the bathrooms add to the feel of the place.As another reviewer mentioned it's a little difficult to find, but on the plus side I got an unexpected tour of El Cerrito Plaza.I don't see myself making the trek often, but given a good reason I'd definitely do it again.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Sus... B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1220918400000,
        "ReviewContent": "Leaving BART and walking to the El Cerrito Plaza, you have to walk around the whole plaza to find Mel-O-Dee ... but it's worth it.The decor has not changed since the early 70s but it is so warm and cozy. My family had the same swivel chairs in our kitchen from that time period maybe that is why. I could have sat there all night drinking ... wait, I did.There was a special drink that night because it was so hot. For $4 it was worth it, juice and rum and Midori. When she ran out of Midori, she made us another special, the \"Rum Runner\" which was equally as good and was welcomed on such a hot night. The bartender was very personable and was quick and efficient.Karaoke was fun but I didn't sing because they did not have The Cure, Beastie Boys, or \"Tainted Love\". After not finding songs I liked, I became disenchanted and resolved myself to chair dancing and singing which was pretty fun in itself.Would I come back -- YES. Would I bring my friends -- YES. If I lived near El Cerrito BART, I would make Mel-O-Dee my local.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Shelly V.\", \"AuthorLocation\": \"Hayward, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1220918400000,
        "ReviewContent": "[Update 9/2008]: I went back recently and things are still good at Mel-o-Dee, but there has been a little change.  I like the new KJ.  However the fun lights were not there anymore (the KJ tried to compensate with a couple of trinkets, but I am hoping they plan to upgrade the stage lights--they were not elaborate to start with but they did make it more fun).  Second, the EQ on the microphone (or the quality of the microphone, I am not sure which), needed adjusting--the mic did not project enough presence in the voice.  Third, the song selection needs a fair amount of improvement, but I still found more than enough.  These are small criticisms, because the place is still great and I had a great time.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Bob H.\", \"AuthorLocation\": \"Lincoln, NE\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1220918400000,
        "ReviewContent": "I came here for my very first East Bay DYL last week!  I frequent the El Cerrito Plaza, yet have never stepped into Mel-O-Dee before.  I actually kind of didn't even know that it existed as a bar; I've always thought that it was part of The Junket next door for some reason, but alas, it is not.  It's easy to not notice this place because it's pretty narrow and windowless, and their name painted on the wall isn't very flashy, so I was pleasantly surprised to find a cool Western saloon-esque bar when I stepped in.When I asked my fellow Yelpers, \"What's good here?\", everyone raised up their fruity looking drinks and unanimously said, \"The Hurricane\".  So The Hurricane it was.  The kind, lovely bartendress concocted an awesome drink for me.  All I recognized was the pineapple juice and the Midori mix.  Anything with pineapple and Midori is good in my book.  And it was only $4 since it was the special of the night.  Suh-weet!I adore the decor of this place.  Fire-engine red velvet walls.  Lovely dark wood beams.  Swinging saloon doors.  And I fell in love with their boudoir-esque bathroom!And the icing on the cake has got to be their location.  In the middle of the DYL, I walked a couple of stores down to Trader Joe's, did some grocery shopping right before they closed, and then walked back to Mel-O-Dee to get my drinkage back on within 15 minutes.  So convenient!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Debbie L.\", \"AuthorLocation\": \"Palo Alto, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1220745600000,
        "ReviewContent": "\"We went in and no one was there.  We got scared.  So we left.\"I was a little afraid to go into this place when part of the EB DYL crowd greeted us with that.I think it was just the lack of lighting that scared them.  I really don't think it was the cast of Cocoon sitting at the bar. We made our way back to the latter years Elvis lounge in the back.  One magnificent, black, tufted leather couch winds the length of two walls -   complimented by small circular \"club\" tables and swivel chairs.  It's easy to slide in and get comfy with a lot of good friends.  It was so dark at one point, the pool players were having trouble seeing.  We tried to turn on the light over the pool table but knew instantly that it killed the mood and turned it back off.Then Angelo proceeded to make the bank shot of the year.  The KJ hoisted the table up onto a dolly and moved it aside to reveal the dance floor.He has a couple of really cool microphones, albeit the blinky light one is a little distracting when girls hold it near their bewbs.  He should have saved money on the mics and concentrated on the song book because the selections are weak at best.Give me a crappy song list and un-readable lyrics - I'magonna make an idiot of myself and probably you as well.The cute little bartender couldn't have been nicer.  I was always greeted with a \"Welcome Back\" when I headed back for \"one more\" and she always tried to talk me into getting two.  I have a fuzzy memory of her actually hiking up her skirt, she was seemingly trying to demonstrate something to one of the regulars - I kind of short circuited when she did it.  I'm not sure what it was about but it was fun.I'd go back.  If they don't improve their song selections by then, I'm threatening to throw down \"The Real Slim Shady\".",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jenn N.\", \"AuthorLocation\": \"Brentwood, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1220659200000,
        "ReviewContent": "In case you didn't read the words to the left of this review, I grew up in Nevada.  Which means I went to the Cal-Neva to gamble cheap, had many dinners in all-you-can-eat buffets, and was assaulted by cigarette smoke constantly.  This place reminds me of Reno.  A LOT.  Partially because the red velvet flocked walls and carpet still are hanging on to years of cigarette smoke, also because of the saloon doors to the bathroom, but mostly because of the clientele.  And I'm not just talking about the peeps who were on a mission to destroy their livers, but the cool dudes at the bar. This is just a cool place where Angelo can smoke Andrew at pool, I can chat with the hotness Sara about ANTM, talk to Jenn about footwear, look at Anna's awesome stocking choice, listen to Keith talk about how he got lost in a parking lot, or watch Shelly welcome the DYL virgins.  Sadly, I missed the karaoke because I was too tired from hipping and hopping at the ho down, but not a bad place.They might want to invest in a case of Febreeze, though.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Pam S.\", \"AuthorLocation\": \"Boston, MA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1220659200000,
        "ReviewContent": "very cool spot. LOVED the velvet walls and the comfy seating. leather rolling chairs at a bar? NICE! played some pool, watched some karaoke, had some fun. the saloon bathroom entrance was cool too. bartender was super friendly and promised me that she would have little umbrella's for our beer next time. what's a beer without a straw and a mini-umbrella?",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Andrew T.\", \"AuthorLocation\": \"Las Vegas, NV\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1220659200000,
        "ReviewContent": "This was my first DYL event where I actually stayed more than ten minutes. East Bay DYL'ers know how to do it and they know how to do it well. The velvet walls definitely made this place unique from the rest. The drink specials were pretty reasonable and mixed pretty well.I love the Old School mic for singing karaoke. I think I'll be belting more songs out here more often. Just bring your earplugs because I'm totally tone deaf :) Don't say I didn't warn you. If they had more BritPop, I'd be all over the mic here...but then I'd probably piss off the good karaoke singers. I guess I'll stick to my guilty pleasures of old 80s hair metal (I can thank my brother for scarring me for life with the cheesiest music of the decade).Thank you to all the lovely DYL'ers for making my experience here more fun. Yeah...I was only going to stay an hour but there was lots of good conversation with cool people. So I didn't leave until almost the last BART train left. This place is totally bitchin' especially when you mix it with a bunch of awesome Yelpers. Kudos to Bill B and those awesome dance moves. heehee.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Amy J.\", \"AuthorLocation\": \"Pleasanton, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1220659200000,
        "ReviewContent": "\"I wanna rock and roll all night...\" And the karaoke here was fun enough that I almost could. The limitation is, as mentioned, that while they have a large book of songs, it's an odd mix and missing a lot of classics. Still, there are lots of fun ones, and the small, hardwood dancefloor allows you to bust out an 80's-inspired powerslide. (Not that I would know...)Still, the 60's mood lighting, velvet wall covering, and pleather booths create a fun atmosphere that helps you not feel like the cheesiest thing in the place while you drunkenly belt out Addicted to Love. A coin-op pool table and video touch-screen games provide additional entertainment.Kelly, the bartender, was very friendly as well as quick with the drinks. My main knock against the bar is that some of the bartenders will let patrons smoke inside...and you can sometimes tell.Oh, last tip: Don't let Shelly L. catch you sitting in one of the swivel chairs. She'll try to spin you round and round until you feel ill. :)",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Bill B.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1218326400000,
        "ReviewContent": "Pros:1. What everyone else said about the interior being very nice is true. 2. The drinks are good for their prices, and the weekend karaoke is not too crowded like it is at Encore Karaoke. 3. Negligible hipster crowd4. Pretty good sound system for those sitting in the side room where the karaoke takes place5. Located in El Cerrito, which is better then being located in foggy, hard-to-drive-in San Francisco.Cons:1. Limited song selection2. Sound system does not extend into bar area, making it hard to hear singers from the bar and follow along. Most distressingly, it makes it hard to hear the KJ from the bar announce who is supposed to sing next. This is exacerbated by the fact that the KJ on Saturdays doesn't seem to enunciate very well.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Benjamin V.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1216252800000,
        "ReviewContent": "I love this place. This is a REAL old school dive bar complete w/ cigarette vending machine, old comfy ass chairs, old surly bartender and the ability to smoke in the bar. I used to work at Petco and would come here every break I got, shhhhh! Drinks are nice and stiff and happy hour prices in combination with said stiff drinks make it easy to return to work or wherever you're on your way to nice and buzzed ;-]",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Tommy P.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1215648000000,
        "ReviewContent": "I LOVE THIS PLACE! It is a total dive, but in the best way. The patrons are great, the bartender is awesome, the kj is good and the drinks are seriously cheap. The song selection is very limited but that is ok for those who have their own CDs or those who love 80\"s classics. This place welcomes everyone and is the perfect chill bar.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Lora C.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1206403200000,
        "ReviewContent": "Awesome bartenders. Cheap drinks. I get my dirty martinis for $4 a pop. They only take cash BUT there is an ATM a few doors down. The karaoke list needs to be updated but it's still fun. Not very many college kids here, which is a plus for me. You've got your regulars singing the same songs every week and mostly everyone knows everyone else by name. It's got a Cheers vibe to it. Oh. and the wallpaper is red and fuzzy. Excellent.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Katie H.\", \"AuthorLocation\": \"Portland, OR\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1203811200000,
        "ReviewContent": "most fun karaoke spot i've ever been to beside punk rock karaoke in NYC. the people there are fun, the regulars are super nice, and you don't feel like a fool singing - how can you when people are dancing while you sing! kelly, the bartender, is amazing cool and drinks are strong - careful! i wish the song list was a little larger and a little more current, but it is still a blast, and you can bring your own cd's. ron, the karaoke MC is mellow and can come off a little intimidating at first, but he is a really good guy. the hubby and i love this place and are there a lot to get our karaoke on! good spot for karaoke fans and virgins to karaoke!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Danielle S.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1201737600000,
        "ReviewContent": "First off, the bartender had me name my cocktail \"The Jessica\" so that when I came up to order more, I wouldn't sound SO GODDAM LAME ordering a(nother) Malibu & Coke. For myself. Because I'm a lightweight but can drink this stuff for a hundred years and feel just skippy, that night and the next. So fug you, I like sugar drinks, moving on.It's important that the bartender did this because it speaks volumes- volume one, that she was encouraging me to drink plural sugar drinks meaning she will enable you to drink like a little fishy, or to your hearts content, whichever comes first. And volume 2, that I had a really good time there and never once wanted to punch that lady bartendress in the mouth for making fun of me. Trust me, I'm short and gamey- punching people who tease me, in the mouth, seems like a good idea especially after sugar drinks. POW!Anyway. This bar is optimal for your sight-seeing needs in the far east bay. Do you need to watch a man with probably drain bamage singing Strawberry Fields, Stairway, and Let's Go Crazy by Prince including splits on the floor?!?!?!?OH NO LET\"S GO!Seriously, that and the girl who sang Father Figure with the most sincerity and intensity....what a memorable night. This is the best people watching place in all of El Cerrito Plaza.We didn't sing a goddam thing, although I threatened my bfer that I'd make him stand there while I serenaded him with I'm Your Man by Leonard Cohen, which I still think would be a funny visual, if you imagine me with a hat and maybe a tie. But they didn't have it.With the wallpaper/mirrors/tufted leather banquette.... it's like you've gone to visit gramma and she's naming drinks after you.Try The Jessica! 5 stars!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"jessica m.\", \"AuthorLocation\": \"Fort Collins, CO\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1200182400000,
        "ReviewContent": "Five stars for memories. Its like a party in some ones game room.  All types of people are frequenting this place.  Word of mouth is the reason. Comfy pleather seats.  This is a place to have a group of friends talk and listen to the tunes on the juke box. I'm sad to see that there is no more pink shag carpet in the women's rest room! Original red fuzzy wall paper is still intact.  Friday nights is Karaoke.  Of course there are the bizarre performances that make you laugh, but I was surprised at the local talent.  Very good singers.  Random people will pair up for duets or serve as back up singers.  Regulars bring their own CD's and give them to the Karaoke DJ.  Very cool.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Denise G.\", \"AuthorLocation\": \"Antioch, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1199059200000,
        "ReviewContent": "My friend gave me the 411 on this place before we went here, so I thought I was prepared for it.Think again. I forgot my singing voice AND my obnoxious drunk asshole shield. Must have been having a blond moment back in Oakland.Now, I've been to El Cerrito before so I thought I was reasonably prepared for the kind of crowd that would await me here. Once again, I was wrong. Immediately my friend and I are greeted by a lumbering drunk guy who decided to use us as crutches. \"LADIES LADIES! ARE YOU BUYING YOUR OWN DRINKS TONIGHT?\"\"Well, um....Yeah. It's just beer. It's cheap.\"\"OH NO LADIES I WON'T HAVE THAT OH NO! HEY BARTENDER GET THESE LADIES SOME DRINK CHIPS! I WANNA BACK 'EM UP.\"Me, thinking \"back 'em up\" was some El Cerrito slang for \"bang 'em up the ass\" nearly fell out of my chair in anticipation - I mean fear!!!! FEAR! Anyway, this man was incredibly obnoxious and I was trying to decide the best way for us to make an escape. And honestly, there was no \"best way\" because the Mel-O-Dee is a pretty tiny bar. Thankfully the female bartender (didn't get her name) swooped into our rescue. Whatever it was that she said to the Jolly White Giant calmed him down, and he actually left the bar soon after. That woman is a total lifesaver and is absolutely one of my favorite bartenders ever!This place is a little weird altogether and it kinda makes me feel like I'm in that Bizarro episode of Sealab 2020. I saw a table of people that could have been myself and my friends had our lives all worked out a little differently. Everyone here was very cordial, but I didn't trust them for one minute. People that nice must have SOMETHING wrong with them.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Pamela D.\", \"AuthorLocation\": \"Tampa, FL\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1196985600000,
        "ReviewContent": "Hands down, , , one of my favorite bars in the east bay!!!Remember that 'Sex and the City' episode where Carrie ends up at some late night Chinese restaurant with Big, runs into an old friend and later finds out this is where guys take ladies they don't want to be seen in public with? That's the Mel*O*Dee. But not really. Just seems that way.Red velvet and gold wallpaper and retro ( I shouldn't say retro since they're the real deal) booths line the perimeter of this fine establishment. The ladies WC doesn't skip a beat either, plush pink carpeting, pink wallpaper and a vanity equipped with dainty old school vanity seats.Bartenders and patrons are both as old as dirt. Live music on Fridays was always a treat. You should see these seniors all dressed up in their nightlife attire, dancing to the band (keyboards, accordion and lead singer) and living it up on a Friday night. I can only hope I have that in me when I reach their age.It's a fairly small place, but big enough for groups. I had my \"going away after party\" here back in 2003.It's been a while since I've been to this gem, sounds like I need to get back over there and get my karaoke on!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Alexa C.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1189468800000,
        "ReviewContent": "I stumbled in the doors of the Mel-O-Dee on one of those nights when I should have probably just hopped on BART and gone home, but instead found myself singing karoke in a room with fuzzy red and gold wallpaper.Since I live in the heart of Hipster Nation, it's really nice to take a vacation from it, so I was REALLY happy when I took around at the crowd.  It was like being in Iowa at one of those old bars along the highway that only the locals know about. Everyone is slightly off, strange but sweet, and of completely indeterminent age.My little group got 10 stars for effort and dramatic interpretation.  Just about everyone else in there got stars for actually being able to sing, and giving us standing ovations just because we were unafraid in our foolishness.The drinks were really cheap and the bartender was so sweet to us.Best part: the Mel-O-Dee is only a block away from BART and at the ass-end of a shopping center/strip mall.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"cindy p.\", \"AuthorLocation\": \"Santa Rosa, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1181520000000,
        "ReviewContent": "Too funny! The wall paper is great. The karaoke regulars are really good and quite entertaining. Another reviewer was right that is has a David Lynch sort of feel to it. I would definitely recommend going with a few friends. It's not exactly a place where you might meet someone, but it's fun. You have to keep a sense of humor about it. It's an old bar that is not trying to impress anyone!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Julie P.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1179360000000,
        "ReviewContent": "If you like a dive bar when its not karaoke night or if you would like to celebrate your birthday by acting like you know the words to \"Purple Rain\" by PRINCE, then this is the bar for you.Don't go in there thinking that you're gonna have an \"off-the-hook\" time. Don't go in there asking for a \"incredible hulk\" or latest \"crunk drink\" because the bartender will not know it and wont even think about making it for you. This is strictly an old schoolers bar with a little karaoke in there. You might see the youngsters in there every now and then but this is a good bar for the experienced bar-hoppers, divers, middle aged and older crowd.Don't expect dope ass night at this place. Ain't gonna happen unless you already got this night planned out with your friends or loved ones. But that's not to say that you won't have a good time at all. In fact, i crashed some girls birthday party there one night by accident. My friends and i were the life of the party, even taking pictures with the unknown birthday girl and doing a karaoke duet with her! Now my friends and I are the official birthday crashers. lolSo anyway, if you dig on somewhat cheap drinks, karaoke machine, crashing someones birthday, meeting old-timers and some newbies then this would be the bar for you. I gave it 2 stars because the last time i was there it was boo-boo. However, i would recommend this bar to someone when it's on a good night of karoke fun.And that's my review. Thanks for reading. Word.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Bob E.\", \"AuthorLocation\": \"San Pablo, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1176681600000,
        "ReviewContent": "What the *@&!?  Here are the reasons we love the Mel-o-dee:*Karaoke*Not a window in the place*Crushed Velvet Wall Paper*Spot Lotto is available*3 stiff drinks = $9!*People dancing to karaoke*15 minute wait for a hot girl like Vivian to get a drink*20 song selection from Merle Haggard (??)*Total sausage fest*The regulars are SUPER friendlyYou know it's a good time when you hear someone sing Elton John's classic song \"Don't let your son go down on me\" and when Jay H tells you your boobs aren't that special. Oh, by the way, did I mention we had a few drinks there?",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Tempe M.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1176681600000,
        "ReviewContent": "So, say you're on the verge of a serious breakdown because you've had TWO G-D DAYS OFF THIS ENTIRE EFFING CALENDAR YEAR...  And say, you feel like you're constantly robbing Peter to pay Paul (whatever the hell that means) whenever you need a minute or two off because you're so damn busy that all kinds of \"life\" things fall to the wayside (you know, like dishes, laundry, friends etc).  And say you have a Friday night meeting for work that's supposed to run until 7pm and that actually thrills you to death because it means that your Friday actually ends at 7pm and you might actually get to see your beloved friends for the first time in a long while on a Friday night, when the rest of the world is out partying and usually, you are still working....  And then, say, two of your best friends are also having \"verge of a serious breakdown\" days and they also want to see you so the three of you can get together and do what BFFs do--get trashed, bitch about our lives, sing drunken karaoke in El Cerrito, and then make someone's boyfriend come pick us up.  Where do you go?  To Mel-O-Dee, suckers!  Crushed velvet wall paper, old fashioned cash register, song list straight out of 1988, and the nicest regulars ever.  Seriously.  This place is completely \"scene\"-less and a complete gem.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"vicarious c.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1176508800000,
        "ReviewContent": "Aw shit!! I've discovered ANOTHER place to sing Karaoke!Honestly the world cannot have enough Karaoke bars for me.This has to be one of the best though!  The drinks are strong and cheap!  The wall paper alone is reason to love this place!  I swear my grandmother had a couch that had the same material on it.   The regulars are friendly and the most fun group of people I have ever met at a bar.  Where else do you go up to sing and the bar patrons begin to dance?  Dancing to Karaoke!!!  If you really wanna feel like a super star you gotta karaoke here!  They need hella more songs for their book though.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Jay H.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1175904000000,
        "ReviewContent": "I am updating my review of this place.  I used to be a diehard regular and bring all kinds of friends here.  Sadly I have boycotted Mel O' Dee's for well over a year now.  First they fired the KJ who might have been a bit slow, but he had the best sound in the East Bay and most of SF and was a nice guy.  The replacement had poor sound quality.  Then they insulted me for letting them know what I thought when they asked me to put a note in thier comment box.  And from what I hear through the rumor mill, the unfairness on the list is super obvious and biased toward one person.  It's a shame because it it close to me and a cozy hangout.  I guess the old saying is true, what goes up must come down.  And down it went.Luckily there are plenty of fine karaoke joints in San Francisco, and I might say worth the drive and toll.  I have met many fine people and had great experiences branching out.  VIVA KARAOKE (just not here).",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Scott A.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1171324800000,
        "ReviewContent": "Hey you wanna go for a drink at the Mel-o-dee? No thanks. No thanks? What does that mean? I don't wanna go. Go where? For a drink at the mel-o-dee. A drink at the mel-o-dee! Now that's a good idea!come for the cheap booze, stay for the womb-like crushed velvet walls, plasti-gold coated circa 1978 light fixtures, and the most bizarre and spirited karaoke in the B-east, period.Hello, baby.Shut up! It's Daddy, you shithead! Where's my bourbon?",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"David K.\", \"AuthorLocation\": \"Palo Alto, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1171152000000,
        "ReviewContent": "Luckily, there isn't really a need to try and impart to you the obscene cred of the Mel-O-Dee, because Wes Anderson and Sofia Coppola have basically already done that, but suffice it to say, it's like a David Lynch movie about a party in your pants. In Nevada. Or rather, El Cerrito. Same thing. Whatever.The wallpaper in here will blow your mind it's so fucking awesome (I think they actually rebuilt the El Cerrito Plaza around the walls of this place to avoid fucking with all the gilt and felted red brocade.)  And, the ladies' powder room is straight fresh, second only in fabulousness to the powder room at the First Congregational Church in Oakland.  Five stars.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Megan W.\", \"AuthorLocation\": \"Berlin, Germany\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1171152000000,
        "ReviewContent": "how to describe the perfect place? you simply can not. just know that you have not lived until you see maria d grabbing the microphone from some inebriated frat boy to join megan w in a duet of belinda carlisle's, \"heaven is a place on earth\". or until you see megan w getting DOWN to taylor dayne.  or joy m doing a perfect rendition (cockney accent and all) of \"consider yourself\" from oliver.  or brigid c. fucking owning randy newman's, \"short people\".  or maria d. doing a PITCH PERFECT RENDITION of the scorpion's, \"rock you like a hurricane\".  i was rocked.  i think the whole crowd was.  what i'm saying is we were at a rockin' party last night at mel-o-dee and you were not. jealous? i know so. i, myself, plan on being here every friday and/or saturday (kareoke two nights in a row, fool!  every weekend!) night for the next ten years. p.s. i am tired and totally just marked the majority of this review from maria d.  i am a tool.  a really fucking hot tool.p.p.s. they also have the most perfect wall paper ever here.  i can't even begin to describe it because i want your mind to be sufficiently blown when you see it and also, the words i want to use don't exist in the english language.  it's.  fucking.  amazing.HAPPY BIRTHDAY, BRIGID SUZANNE!!!!  I LOVE YOU!!!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Lou B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1171152000000,
        "ReviewContent": "how to describe the perfect place? you simply can not. just know that you have not lived until you see laura b doing the macarena with a 65 year old man in a sailor's cap. or until you see megan w dancing to james brown. or joy m doing a perfect rendition (cockney accent and all) of \"consider yourself\" from oliver. or joy m and laura b dedicating \"9-5\" to the memory of anna nicole smith. what i'm saying is we were at a rockin' party last night at mel-o-dee and you were not. jealous? i hope so.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Maria D.\", \"AuthorLocation\": \"Denver, CO\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1170806400000,
        "ReviewContent": "This place can cure a bad mood not only with strong, cheap drinks, but warm, fuzzy feelings inspired by the comraderie of the faithful regulars, strong enough to penetrate even the snobbiest hipster veneer.  There is no pressure to be Cool here at the Mel-O-Dee in El Cerrito Plaza, which feels more like the heart of some Vegas backroad.  Everyone sings and dances with abandon, talented or not (and there are both).  It's clear that karaoke night is both cathartic and exciting in that special moment-to-shine way for everyone who gets up and sings.  And my god, the wallpaper!  It's red, fuzzy, and beautiful, like a fake velvet rose you find in your grandmother's house, next to the whiskey and old letters from a secret lover.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Anna B.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1164412800000,
        "ReviewContent": "You walk in and see velvety red and gold wallpaper, an old cigarette machine, a disco ball, and a pool table.  No, you are not in some seedy little bar in some redneck town.  You, my friend, are in El Cerrito.  Actually, you are in the El Cerrito Plaza, a little strip mall.  Sandwiched in between Petco and Trader Joe's is a delightful little bar called the Mel-O-Dee.  Yes, there are a lot of retired folk that are regulars there, but on the weekends it can be pretty mixed.  On Friday and Saturday nights they move the pool table out of the way and have karaoke and dancing.  If you are lucky, the guy that does a seriously kick ass Otis Redding will be singing.  He is a treasure.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"jen n.\", \"AuthorLocation\": \"Long Beach, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1157328000000,
        "ReviewContent": "OLD.  It looks twice as old as the strip mall in which it's located.  The people at the bar look like they've been sitting there since the wallpaper was put up in 1320.  But everyone is nice!  And Karaoke is hilarious; because they are good!I asked myself, \"What the fuck am I doing out of SF and in a bar in El Cerrito?  I'm at the Mel-O-Dee!\"",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Patrick A.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1137024000000,
        "ReviewContent": "\"The bar that time forgot\" ... according to the bartender, an older lady who is always smiling as she pours you amazingly cheap and strong drinks, the place has barely changed since it opened in 1969.  With the exception of the removal of the adorable pink carpet in the lady's room.  :-(  It's tucked between a deli and PetCo in the El Cerrito Plaza shopping center ... weirdest place for the coolest bar ever.  The gold and red velvet wallpaper is really something to see.On karaoke nights (Fri & Sat), there are always a few groups of hipsters celebrating a birthday battling for the microphone with the regulars, some of whom sing like pros.  You'll see this old black dude who always sings Otis Redding boogeying down on the dance floor with a 22-year-old tattooed white chick, a middle-aged Philipino lady (\"I Will Survive\" is her song of choice) shakin it in the center of a group of indie rocker kids.  It's amazing.  I've never seen this happen anywhere else.  I took my friend there for her birthday, without calling ahead or anything, and the propietors put \"Happy Birthday Anna!\" on the karaoke monitors.  It's so hard to leave, because you always want to see what the next song will be.  Go there this weekend.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Cassandra W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1129507200000,
        "ReviewContent": "Shaky hands down, this is one of my favorite bars in California. This is definitely an old folk's hangout, which actually seals the deal for me. You won't find yourself screaming over the jukebox here, and I don't think a fight has erupted in the place since 1968. However, there's always a retired cop in the place, so maybe smoking pot out in the parking lot isn't the wisest idea...unless you know him by name and don't puke anywhere (Michael!). \r The drinks are poured as if the friendly bartender wants to see if you can handle your booze, so you definitely get more bang for you buck here. Just don't order any cocktail involving coca cola, as the tap is usually flat. The walls are covered in red, velvet wallpaper and the entire back room is littered with black, vinyl booths and chairs. \r If you've ever longed to belt out some karaoke to a room full of clapping pensioners, this shoudl be your friday night spot.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"Steven C.\", \"AuthorLocation\": \"London, United Kingdom\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    },
    {
        "ReviewDate": 1116547200000,
        "ReviewContent": "Oh, the Mel-O-Dee...it's a sleepy little joint in the mall during the day, but it comes to life at night with an upbeat flock of regulars.  The big back room has gaudy-cool red and gold wallpaper and the black leather booths and chairs are still in great shape.  The ladies' room has pink carpet!  This isn't the place to get shitfaced or have a big, loud party; it's nice for smaller, quieter gatherings over strong but cheap drinks.  There is karaoke on Saturday nights; they used to have a jazz band and dancing on Fridays, but I don't know if it's still going on.  Conveniently located mere 5 minutes from the El Cerrito Plaza BART station, there's plenty of parking at the mall in the evening, and if you need cash, there is a bank across the parking lot.  Definitely, a treasure buried amongst the vapid mall culture.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Mel-O-Dee\", \"AuthorName\": \"maiko h.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "Mel-O-Dee Cocktails",
        "venue_id": 9
    }
]