[
    {
        "ReviewDate": 1666396800000,
        "ReviewContent": "There was a cat in the bar. Amazing. Show stopping. Fabulous. Breathtaking. Also, the pometini is strong and yummy.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Abby A.\", \"AuthorLocation\": \"San Bruno, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1656806400000,
        "ReviewContent": "Never ever had less than a great time here - always struck by the hospitality! Owners are very chill and cool!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"S S.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1655769600000,
        "ReviewContent": "Always a good time at Red Hat. The staff is easygoing and they have a nice outdoor patio area. If you catch them on a live music night, even better.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Jesse D.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1632182400000,
        "ReviewContent": "A local neighborhood dive bar and a hidden gem! We came here on a Tuesday for an afternoon drink and to our surprise the bartender was super nice and offered to buy us a shot after we asked for the check/we're heading out! Had it not been for an appt we had coming up soon after, we absolutely would have stayed longer! The neat thing about this place is that they have an outside patio with misters and cats that come to hang out as well. It's a super cool little bar and looks are deceiving from the outside until you enter in and through to the patio. Definitely would recommend this place!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Nina L.\", \"AuthorLocation\": \"Pleasant Hill, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1630540800000,
        "ReviewContent": "Come to this place, fun, nice, loving people you will meet. The owners are down to earth and  beautiful.This place celebrate any occasions, drinks are the delicious Nice large patio at the back  to serve with beautiful and great smiles by the owner. Come visits this place.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Nikki B.\", \"AuthorLocation\": \"Fremont, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1622332800000,
        "ReviewContent": "This place is great, Raidi and Athula are awesome. Friendly staff great drinks and the food is pretty good also! Will be back!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"steve H.\", \"AuthorLocation\": \"Santa Cruz, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1605830400000,
        "ReviewContent": "Place is nice and owner is super cool dude. I will be going back once all this covid bs let's us.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Troy L.\", \"AuthorLocation\": \"Telegraph Ave, Berkeley, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1580860800000,
        "ReviewContent": "In my humble opinion this is the best bar in Concord. If you want to listen to live bands, this is the place to go. They play rock, punk, alternative, oldies. Everyone is nice from the door guy to bartender. I actually had very meaningful conversation with the owner of the bar who personally greeted me and told the history of the place...Drinks are moderately priced. You might have to pay a cover charge  from $7 to 10 on Friday and Saturday but i dont mind supporting local musicians.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"George B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1568160000000,
        "ReviewContent": "Raidi and Atula run a great bar. I have been happy with each visit. This is the best place in the Bay Area for the  underground band set. They enjoy people and music. Safe, clean, happy, great crowd. Paying it forward for the wonderful treatment I have received over the years. Definitely a good vibe and not enough attention on this place!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Jason K.\", \"AuthorLocation\": \"Clayton, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1563926400000,
        "ReviewContent": "When I first pulled up to the back parking lot, it didn't feel very safe.  Very dark and could use a lamp or two so people don't stumble in the dark!  Came with some friends to support a local band last weekend and it was an interesting night.  When you check in, there is a sign that says no methheads...ok...lol...It's a nice, spacious, divey place.  Don't expect much for your cocktails, this isn't some fancy place.  The dirty martini I had felt like 1/2 olive juice and was way too salty.  My friend ordered their $4 pizza and it looked like something from a frozen pack you find in Safeway.  It was also burnt black on top.Service was friendly and people overall were a nice crowd.  I would say this is a place where you can't go in and expect much but not a bad place to grab a cheap drink if you are in the area.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Yue L.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1557014400000,
        "ReviewContent": "Nice location, nice space out back to smoke and chill. Right next to a taqueira that stays open late. Live local music and the sound system is solid. Drinks were proper and good price. Staff was friendly and good crowd of people. Pool table and darts also available.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"John T.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1556496000000,
        "ReviewContent": "Live music? Yes. Fun crowd? Yes. Friendly staff / Bartenders? Yes. I went on a Friday night bc my uncle's band was playing (Saturday). A solid 7 bands were playing that night & we enjoyed every one. There were tables set around, a solid bar w great choices of beer / mixed drinks. I really liked the outside. Picnic table style & shaded. It was a fun time. Will come out again! Cheers!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Alayna S.\", \"AuthorLocation\": \"Union City, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1549929600000,
        "ReviewContent": "Love this place always fun to visit hangout in the back or listen to the bands. The staff are great, and the crowd is friendly.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Tom I.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1532044800000,
        "ReviewContent": "I'll definitely miss walking into the bar and seeing Jen after so many years of her working at Red Hat, and I'll miss Katie's friendly face behind the bar as well, but I love coming to the Red Hat and kicking it with the other nice patrons and bartenders. Sam is great. (Met her yesterday - pretty sure that was her name!) :) Stephanie is awesome too. Their whole team is really nice and do a great job. There's live music some nights of the week. A band with a couple of female vocalists covering \"Heart\" and other band's songs was in there last night.  There's a couple of pool tables. And the best feature is the back patio, with cool water misters, shade, and plenty of table seating. Because sometimes it's just too beautiful of a day to sit around indoors!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Amy S.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1522627200000,
        "ReviewContent": "Omg! So excited.. I walked in this place and I immediatelly met Bri the awesome bartender! Her swag is five star! I felt so welcome. She had the place spotless .. She invited me to the next live night music! Omg bri is the best! I live for her! She is the best! Go bri thank you thank you! You made my life a better place. Omg cant wait to meet the owners.. I heard is a privately owned business! Cant wait for the nezt time. She is an artist... She is pretty.. She ia awesome!! I live for bri!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Simon R.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1522368000000,
        "ReviewContent": "Really good dive bar considering the area. They have pool, pinball, and a nice patio in back. The service is good and the drinks are reasonably priced. They also have live music on Fridays which is nice.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"James P.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1504742400000,
        "ReviewContent": "The nicest owner!!!!  This is a no nonsense bar.  Back patio for smoking and fresh air. My husband calls it a punk bar. Nothing fancy but a cool place. Super nice and awesome bartenders and owner!  They have live music and it's just a chill place. And they have me a Birthday shot on the house!  Yay!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"courtney k.\", \"AuthorLocation\": \"Lafayette, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1503446400000,
        "ReviewContent": "This place is a dive bar at it's finest. They have a nice layout of the alcohol selection and some  cool lights around the place. There were plenty of seats at the counter and they also have pool tables.I happened to come on a Saturday night where a live band was playing. I personally do not like that type of music but after-all we only came for the drinks.The bartender was nice and was quick with getting us the check. At the late night hours on a Saturday there was plenty of parking. I would not come back here again but it's great that Concord has a local option for folks wanting to grab a quick drink.Try to hit the taco truck up when you get out. It's located right across the street next to Super Liquor!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Kam H.\", \"AuthorLocation\": \"East Bay, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1498608000000,
        "ReviewContent": "Went into red hat with my wife, jen was the worst bartender ever, no conversation that didn't start with me, she got our drinks and headed to the end of the bar, spent the duration of our hour there on her smartphone, we had to get her attention to get another drink, she doesn't know how to earn a tip, no effort to engage in conversation, upsell, refills, nothing. We have been there before and got excellent service from nikki, very disappointed this visit and bill seemed high 24 for 2 beers and 2 cocktails, we just paid and left.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"David R.\", \"AuthorLocation\": \"Pittsburg, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1486252800000,
        "ReviewContent": "Came for super bowl. Met some amazing people and had the best time since I moved here! Definitely found out new local hangout! Can't wait to check out a music night!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Derek S.\", \"AuthorLocation\": \"Riverside, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1482969600000,
        "ReviewContent": "This place is terrible. Everyone here is rude and creepy. The bartender remembered my name and address from my ID and that's creepy af. Never again will I go there.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Louis T.\", \"AuthorLocation\": \"Richmond, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1459555200000,
        "ReviewContent": "This is a weird place to write a review for. The bar almost always has live music on the weekends, or some other performer (last night a comic had a set between bands). It gets a very \"colorful\" crowd which spans all ages, colors and in most cases styles but somehow it works. Their bar is very well stocked but getting a good mixed drink is highly dependent on your bartender. They have well over a dozen taps which is quite impressive for this awkward little hot spot on the glamorous monument strip. All in all a great little hideaway dive bar",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Chris C.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1432857600000,
        "ReviewContent": "If you want good music, good drinks and laid back people this is your bar! Jen is the best bartender EVER! I usually ask her to make me a fun shooter and she never disappoints!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Megan T.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1432684800000,
        "ReviewContent": "Yah so it's a music bar ok. But when it isn't poppin um, I think the bartenders are a little too casual. The prices aren't cheap neither and I'd expect a certain level of service associated with such prices. Actually thinking about it, I've been into at least 100 bars and this one had the worst service.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Nathan B.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1431820800000,
        "ReviewContent": "Something should be said of a bar where the sound guy doesn't stay in his place when bands are playing, doing his job. And the fact they cut off your songs on the juke box short to skip to the next song is very rude and plain sucks.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Moe S.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1427414400000,
        "ReviewContent": "This IS the cool place to be. The owner is very friendly and Tony Kroll (manager i think) seems to be one of the best informed (musically)  I have ever met.  On Fridays, they have a \"pirate punk\" D/J, open mic nights on thursday(acoustic) and great original acts on saturdays.. always interesting and fun.. best club in town.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Jeff H.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1409097600000,
        "ReviewContent": "I give ONE star because the staff BESIDES the OWNER were great! This bar was \"okay\" until the owner got too drunk and decided to kick people out for no reason. We sang karaoke and paid for drinks and had a good time earlier in the night. Then the owner had the security kick us out because he was wasted and being a douche. It's sad because it's a little bar on monument and we were there to show it love and then we got kicked to the curb, not cool. Anyways never had that happen before, sad, but will never go there again!",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Stephanie B.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1400803200000,
        "ReviewContent": "Great little dive bar on Monument. One of the only live music venues in Concord, and it caters to more of the punk/metal/rockabilly crowd, so it's a great place to catch shows. Yes, the owner can be a little hot headed at times if you've crossed him the wrong way, but I've also lost count of how many free shots he's given me when he's in a good mood and having fun.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Vu D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1398816000000,
        "ReviewContent": "This place needs to decide whether its a sports bar or karaoke bar. Game 7 of the NHL playoffs with the game going and all of a sudden, \"check, check. I'm a loud bitch\" over the mic. Then loud amateur singing from the one interested person out of the 10 in the place. Head to Milo's across the street -- the beers are cheaper and they also have TVs.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Justin O.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1398816000000,
        "ReviewContent": "Live music, cool owner, good variety, yada yada blah blah. Fun open mic night on tuesday nights",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Neill C.\", \"AuthorLocation\": \"Danville, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1398729600000,
        "ReviewContent": "They get you drunk and pit with the punks. Watch the A's game and have a good time. Live music, outdoor patio to drink and smoke. Dj spins punk and old school hip hop. Pool and darts. Karaoke night. Enough said.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Trevor S.\", \"AuthorLocation\": \"Brentwood, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1397865600000,
        "ReviewContent": "Unprofessional staff and owner stopped the bar tender serving me which I waited 20min for to have him put on a movie",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Charles R.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1383782400000,
        "ReviewContent": "Be nice if they had a WORKING phone number for this bar. I left my id there and tried to call several times and it just went to a voice mail that was full. Professional guys...",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Chrissy O.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1354406400000,
        "ReviewContent": "Home away from home. Great drink specials, live bands on the weekend (mostly punk and metal), cool friendly people that work there. I like how I don't have to drive to Berkeley or SF to see some great bands.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Fish N.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1349654400000,
        "ReviewContent": "It's seriously just a dive bar after 12:30 sad, but I love their Apple cider beer. Its not that bad.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Ma L. C.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1335484800000,
        "ReviewContent": "Our band has played this venue a few times in the past year. The staff is friendly and the crowd has been energetic. The other bands were quite good, so I'd say it's a great place for a pint and live music. They've got a lot of beers on tap and there are nightly specials. Go check it out, it has booze, so you should be happy you went.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"David H.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1334966400000,
        "ReviewContent": "Red Hat has many (new) flatscreens turned to sports. this qualifies Red as a sports bar.the pool table, projection screen, minidance floor, center stage , tables and chairs scattered thruout don't diminish their claim.happy hours: 4-7 daily (times were smudged). $5rolling rock, whiskey, bourbon, vodka, tequilla, $4 imported beers and microdrafts.drink: gin& tonic(5)-large old fashioned glass, diluted?-ok serviceon draughts:-most domestic with some micros-little parking in front, in back not sure-place looks big but doesn't many people well.-place almost sparkly clean.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Victor G.\", \"AuthorLocation\": \"Hayward, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1322611200000,
        "ReviewContent": "Total rocker sports bar.  If you like loud, live music and rocking the eff out, this is a pretty sweet place to knock your socks off at.  Came here for a live show to support a coworker's band (Check them out: http://www.facebook.com/iheartmakeascene).  Cover was $5.  The bar was jam-freaking-packed so we had one person go up and order for everyone.  (Carbomb me!)The space can get pretty crowded and there's no separation from the stage and the rest of the bar.  Guess it's made for moshin.  They have a nice outdoor area for smoking and/or getting some \"fresh\" air.  (Picnic table seating in a backyard!)First time trying honey jack!  Honey jack and coke is such a winner.  I honestly don't know if this is my type of bar but I'm down to come back if Make A Scene is playing.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Kat C.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1306368000000,
        "ReviewContent": "Cool place. Nice people. Good music. Good place to have some drinks and watch the baseball game.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Barbara S.\", \"AuthorLocation\": \"Mountain House, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1304553600000,
        "ReviewContent": "Awesome neighborhood bar and quite possibly the soul of live music in Concord. The owner is a real supporter of live music and it shows. He treats bands and patrons equally well and you can tell that he has put a lot of money and effort into creating a place where everyone will feel comfortable and find it easy to have a good time. Patio, pool table, dart boards, sofa's and great music.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Bill C.\", \"AuthorLocation\": \"Port Costa, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1301961600000,
        "ReviewContent": "I am not big on pool tables but I love live music and a generously sized dance floor.  Thursday night customers are invited to guest vocal with the house band.  Karaoke with a live band!  Not too many places afford such an opportunity.  Here is one of my friends doing White Rabbit at the Red Hat:http://www.youtube.com/watch?v=psdMai6t_V4",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Tom M.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1301356800000,
        "ReviewContent": "OK - here's the deal - I LOVE METAL. That's what Red Hat is for. It serves that purpose well.Most of the time it's a kick back place to hear up and coming artists. Those artists should be applauded for their commitment and skill albeit sometimes certain bands and artists are just learning. There is something for every metal lover though.Most nights there are few people, just friends of the bands. Here's the SECRET - ask the bartender or the doorman when a big gig is coming up. This place will be raging and frenetic.The bartenders are chill, and the owner is a really awesome guy.Drinks and beer are reasonably priced.Rock on dude.T",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Tony R.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1282089600000,
        "ReviewContent": "I recently went here on a Saturday night to get some drinks. Not a huge fan of rock music, and so the vibe was not to my liking. I bought a corona for like $7. WTF!!  I give this place 1 star cause atleast the bartender was nice (although I would be too, if people were buying $7 beers from me).  Empty bar, expensive drinks, whack loud music. There lucky 0 stars isnt a option. Try the bowling alley next to it, better bar!",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Charles S.\", \"AuthorLocation\": \"Pittsburg, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1278806400000,
        "ReviewContent": "I came here recently to see my friend's band play.It's not a typical dive bar- It has a kind of a grungy, garage band, lounge style thing going on, similar to Time Out in Concord, though with more of a classy edge to it. It has a nice full bar with green  Christmas lights arranged behind bar to create that ultra neon bar look, burgundy red and black color scheme thoughout which really pulls everything together creating more of that lounge, sedating atmosphere.I really was not crazy about the scarce amount of seating as well as the arrangment of the seating however, it could have just been arranged particularly for the band playing.The bartender was friendly and cool and she made one perfect apple martini : )This is not a place I would visit regularly though, it's worth checking out to go see a band or do some karaoke.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Shannon H.\", \"AuthorLocation\": \"Brentwood, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1273536000000,
        "ReviewContent": "I drink here often. if you like punk rock its perfect. you like poppy stuff come on tuesday nights its open jam but the house band is great. they always have good specials and the back patio is now open so you can bring your beer out there. the bartenders are way cool and they can use the tips so dont be stingie. athula treats everyone there as a friend and he has a sexy gray ponytail. haha. I was at the bar when the health dept. did the inspection and i still drink here soooo.............yeah! dont think they do karaoke anymore but karaoke sucks anyway right?Oh yeah instead of cheering or clapping knock on the beam above the bar. Its the thing to do. Me and johnB started that. I always catch people i dont know doing that and it makes me feel like a pimp!!John likes it too. oh and never i mean NEVER sit on the red couch. you need not know why just dont.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"dirk d.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1268092800000,
        "ReviewContent": "woo hoo! not bad. kinda white-trashy, but the patio is nice. Music is loud, vibe is whatever & drinks are not have bad. I tried the IPA HAMMER, & I swear, i smelled herb & thought it was BAMMER. HAHAHAHHA",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Lois R.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1251676800000,
        "ReviewContent": "Not as bad as everyone portrays it as.  Basically just a hit-or-miss kind of place.  Nice layout, cool owner, and contrary to previous reviews...Linux-friendly and better than Farrington's.  Not a big fan of the bands that play there but glad it's an outlet for local bands who can't find a decent place to play at.  As an alternative form of entertainment, there are a couple of satellite-served TVs for your enjoyment.  Chuck Norris late night infomercials are always a great conversation starter...right ladies?  Drink responsibly, police love snatching up folks driving home from here.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Joe E.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1197158400000,
        "ReviewContent": "The Red Hat is formerly Jace's.  I reviewed Jace's at two stars, so under the new ownership of Atullah, it has gained a full star and has lots of potential for more.  Atullah made immediate upgrades throughout the bar, including 4 plasma TVs, raised the ceilings, brought in some hot young bartenders, and has been experimenting with live music, karaoke, etc.  This bar is still trying to find its identity, but it's a good place to watch a football game (on the projection screen), has a good happy hour, a nice owner that is open to ideas and listens to his patrons, and it attracts a diverse crowd of customers.  Not the best part of Concord, so that brings the rating down at times, but this is one of my favorite spots for a pint.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Dan B.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    },
    {
        "ReviewDate": 1193356800000,
        "ReviewContent": "Awww man - I wanted to be the first to review this place Jeff!Karaoke on a Saturday night? YES!A bar walking distance from my house? HOLY SHIZA YES!Cheap drinks? I'M IN HEAVEN YES!Hot diggity dawg - I will be back and I will be their new karaoke queen!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Red Hat Sports Bar\", \"AuthorName\": \"Aim E.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "Red Hat Sports Bar",
        "venue_id": 14
    }
]