[
    {
        "ReviewDate": 1712188800000,
        "ReviewContent": "A great local bar with an awesome sense of community!I came here on a Wednesday night for the open mic night to support my friend's last performance. It's a small bar just a few blocks from the beach and has a fun beachy vibe to it!Will definitely have to come back again!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ken D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1711238400000,
        "ReviewContent": "Best bar with an ocean view! Never a cover, live music on weekends with daily events.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Hutch M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1709856000000,
        "ReviewContent": "Dude. I destroyed the Riptide. Number one out the back door in a fresh and clean environment. By the end of the night, some savage left a bloody maxi in the jawn but I was done pooping by then.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Steiner G.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1706918400000,
        "ReviewContent": "Taking the N-Judah out to Ocean Beach, I find myself walking south on the paved walkway along the Great Highway trying to avoid zealous joggers and bicyclists. Not easy given how rude some people like to get. By the time I get to Taraval, I'm ready to make a left and head back into the city.However, before I set off on my journey back, I sometimes make the very first stop available right here. But only after 3PM because that's when they open. It's a surprisingly large space for a tavern, but the wood paneling, brick fireplace sometimes with a roaring fire, and overall old timey vibe make it feel cozier.I'm usually on the early side, so it was just me and the lone bartender. I've ordered the $12 Mama P's Shaken Pina Colada which always surprises me to see a tiki drink way out on the edge of the Sunset (photo: https://yelp.to/b7CA2mNjqu). It's a mix of Malibu coconut rum, cream, and pineapple juice shaken and served over ice. Simple but quite tasty even on a brisk day.Recently I took advantage of their holiday menu and ordered the reassuring $12 Nutty Hot Chocolate with Baileys and Frangelico (photo: https://yelp.to/TuOAbfOK3M). My one takeaway here is that it's definitely a locals' hangout, so when they trickled in, I felt very much the outsider. If I came later for an event, I would think that might offset that isolated feeling.DRINKS - 4 stars...not the best tiki cocktail I've had but I like that they make itAMBIANCE - 4 stars...cozy, vintage feel offset by the exclusivity vibe from the regularsSERVICE - 4.5 stars...the bartender is always cordialTOTAL - 4 stars...a nice find way out westRELATED - Exploring the Sunset? Here's a collection of places I've tried and reviewed: https://bit.ly/2EI8eIJ",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ed U.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1706486400000,
        "ReviewContent": "Such a cozy neighborhood bar. Great service and bingo was a lot of fun. Drinks are reasonably priced and they allow you to bring food in.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Alyssa W.\", \"AuthorLocation\": \"Stockton, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1705017600000,
        "ReviewContent": "This place is must go local bar especially for Bingo on Saturdays. The vibes are always good, bartenders are efficient and have great recommendations. The bingo host is hella fun and they provide jello shots when calling 69 on bingo. It is dog friendly and you can bring pizza in from next door. The prize box is magical too if you win, but I cannot let the secret out. You have to go and find out for yourself.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"pamela s.\", \"AuthorLocation\": \"LAKE VIEW TER, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1699747200000,
        "ReviewContent": "We arrived a little after sunset (5:45ish), pulled up a booth, had a refreshing (& affordable $7!) beer, and rolled out ~6:30 when they were getting started with (free! with prizes!) bingo. We considered staying to play, but had a date with dumplings in our tracks :pThere were a few doggos in the bar, including one who had their own seat at the bar and was maybe the cutest thing I've seen all week (:The seats at the bar had one hook per seat to hang a jacket or bag (big plus/thoughtful consideration in my mind).Seems like plenty of events throughout the month (posted some photos of flyers hanging on walls as of 11/11/23). Bartender was friendly & efficient, with a good memory. Fun lil neighborhood watering hole! We'll def be back for bingo the next Saturday we catch a sunset at Ocean Beach.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Megan J.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1695600000000,
        "ReviewContent": "Our FAVORITE dive bar in the Sunset!! My partner and I come here all the time, the bartenders are the BEST we loveeee Tara, Natalie & Molly!! The fellas are great too and the pours are always perfect! The ambiance is so cute if you're looking for a fun beach themed bar and the crowds are always fun. Entirely recommend!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"josie r.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1693353600000,
        "ReviewContent": "Neat little neighborhood bar that attracts some amazing, young & talented musicians. A friend of mine brought me here to see a band he was considering joining as a guitar player. The crowd was chill, and they have a good selection of beers that were not all just IPAs - which is a disturbing trend in many bars today.Not this place, I have choices of beers.I'll be back even on nights without live music.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Larry J.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1693008000000,
        "ReviewContent": "Oh I forgot to mention the lady who goes around with boot always has a smile on her face! The DJ has great support.Can DJ Damon do his 80s jam more than once a month ?",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mia D.\", \"AuthorLocation\": \"SoMa, San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1687651200000,
        "ReviewContent": "Had a blast at this place. My brother brought us here while we were visiting. We got to enjoy bingo night and had alot of fun. It was cool to learn about how they burned down an were rebuilt. If I lived in the area I could definitely see myself coming here alot. I especially enjoyed how we could get a pizza drop next door and eat it while drinking. Definitely a place to visit. Service was great and the bartender was very nice.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Bryan R.\", \"AuthorLocation\": \"Sunbury, OH\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1686355200000,
        "ReviewContent": "Great place for neighborhood hang out!  Nice bartenders, reasonable prices....its the Sunsets solution to gray skies!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Kashif M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1682640000000,
        "ReviewContent": "Cute little retro bar near ocean beach. The service is horrible. In particular a person named \" Tara\". Even though she watched me walk in, it took her 20 minutes to wait on me at the bar. Rude and cold as ice despite my generous tip..which I regret. She had a group of friends at the end of the bar, that had her entire focus. The bouncer told me that she has been a problem.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Brad P.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1668988800000,
        "ReviewContent": "the bouncers opinion was that I didn't look like the photo on my very real ID, so I unfortunately did not get to see this place. hopefully others will have a better experience",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jake S.\", \"AuthorLocation\": \"San Diego, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1665878400000,
        "ReviewContent": "Have been coming here for years - friendly people, good drinks, a lot of variety day to day, often live music/free food, and good prices.  One disagreement with a comment below - MUNI doesn't go AWOL here any more often than elsewhere in the city; I depend on it.  Go ahead and grab the L-Taraval to get to Riptide, keep a taxicab return as your plan \"B\" if needed.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jeff R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1659830400000,
        "ReviewContent": "RIPTIDE has been around for decades. The quintessential SF Ocean Beach surf bar. Funky, Friendly, Fun. Definitely a Local hangout but new faces are welcome. Full bar. Some top shelf I'd you want it. Prices reasonable. Parking can be tricky. DON'T park illegally down here.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ross C.\", \"AuthorLocation\": \"Danville, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1646870400000,
        "ReviewContent": "I LOVE this place on a Tuesday night when KJ Eileen is doing karaoke night!  Great vibes!  Love my bartenders Molly and Dugi!  Just crazy how this is the liveliest place in the city on a Tuesday all the way near the beach!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Richie W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1628726400000,
        "ReviewContent": "Yelp needs to remove anti-vax lunatics from review sections. They will ruin the app. The Riptide is a beloved San Francisco institution and deserves our patronage and support, especially since building back after the fire.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Patrick J.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1616803200000,
        "ReviewContent": "A friend of mine loves this place + all it's divey-ness. Unfortunately, I didn't get to experience the divey-ness because of it being closed due to COVID. However, they are doing cocktails to go and have outdoor seating. The outdoor seating is built as a parklet, which I'm always a little skeptical about because cars are still zooming by. However, on Taravel where The Riptide is, the street is closed so no worries about a car zooming by. But I still wasn't too comfortable with their outdoor seating arrangement. They have walls on 3 sides of their parklet and a roof meaning less airflow. I imagine it being because they're in the Outer Sunset and well it's cold there! But the tables overall were spaced out well and it looks like they have a smokers area too. So we decided to pay with Apple Pay and grabbed our cocktails to go and walked 2 blocks down to the beach and enjoyed the evening. The cocktails were either strong or I haven't had a cocktail in a while (likely the second). But well-priced. Service was at a window and she was super kind and didn't rush us at all. Would come back.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Julie L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1616112000000,
        "ReviewContent": "First time here and I have to say I absolutely love the vibe here. Pricing is reasonable, staff is friendly, it's pet friendly, and it is also a perfect place to enjoy a beer and watch the sunset with friends! The only drawback is that there are no heat lamps at the moment, so dress warm! We all know how this area gets when the sun goes down. With that in mind I definitely recommend this place!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Norman W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1605744000000,
        "ReviewContent": "Riptide has long been on my bucket list of bars - both for the location and the rapturous descriptions from friends. When they suffered the fire, I gladly gave, even though I'd yet to walk through their doors. This month, I finally made it, albeit during COVID, but still had a fine time. Their outdoor setup is safe yet cozy with its views of Ocean Beach's dunes. Prices are fair and staff are friendly. Tunes are playing over a sound system. It almost felt normal! When we're through this mess, I can't wait to walk through Riptide's doors, sit near the fireplace and enjoy some fine live music.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Judy R.\", \"AuthorLocation\": \"Chicago, IL\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1596931200000,
        "ReviewContent": "This is the best bar in San Francisco. The staff is one of a kind and it truly feels like you're a part of something bigger when you're there. They've adapted well to COVID safety procedures without losing their charm. Worth the trip.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ali E.\", \"AuthorLocation\": \"Half Moon Bay, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1587859200000,
        "ReviewContent": "My husband and I just stopped by this bar randomly and are so happy we did. We parked right in front of it and had ten minutes to spare while waiting for our take out across the street. I saw someone carrying a few beers from the door window and thought, \"hey! Let's go support them and buy a drink for my mom (to go), who was waiting in the car!\" It's honestly so refreshing to see such warm smiles during this horrific pandemic we are facing. The guy who greeted us and took our order and the window was super friendly and had such a positive attitude. Really easy and fun to chat with while we waited for the Bloody Mary. If you're in the area, stop by and support this neighborhood bar! Ps - this bar is super fun and I came here before COVID. Can't wait for it to reopen.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Anastasia N.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1587772800000,
        "ReviewContent": "4 mile quarantine loop down to the ocean. Perfect day thanks to Riptide.  Drinks to go with straws!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Viv C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1585872000000,
        "ReviewContent": "Cheap drinks, cash only, walked here from the zoo after it closed for happy hour and was not disappointed. killer bloody mary. would be back frequently if i lived closer.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Garrett G.\", \"AuthorLocation\": \"San Diego, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1583366400000,
        "ReviewContent": "This bar always feels like home. No matter who is behind the bar, the staff is always attentive and friendly. Whether it's a live band, DJ, or just bartender's choice, the music is always spot-on. After the fire, I was worried I might not get to drink here again. Ever since they re-opened, I've made sure to never take it for granted. It's the jewel of the Sunset, and as far as I'm concerned, the City.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Bill B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1577232000000,
        "ReviewContent": "OMG bartender refused serve drink Christmas night. I just want to buy my friend drink.Monday and Tuesday shouldn't go here bartender and security staff very stupid.I recommend you should go without Monday night and Tuesday night. Other days bartenders are very nice and professional.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Nishigami T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1572220800000,
        "ReviewContent": "I just moved to the sunset. And this bar is a five minute walk from my house. We stopped by on a bingo night after a beautiful sunset stroll on the beach. Everyone was ridiculously friendly and there was an awesome welcoming vibe. Who knew that bingo could be so fun?! Two whiskey sodas, and a Tito's soda was $21. $7 a cocktail? YOU CAN'T BEAT THAT. I took a bunch of photos of all the various theme nights they host. I am definitely coming back! Open Mic Monday's Karaoke TuesdayDJ every Friday Bacon Bloody Marys and Live Band on Sunday*Also note this bar is dog friendly.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Leah E.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1567209600000,
        "ReviewContent": "Just went to this bar and Sharon was my bartender.  oh my goodness I've been here 100 times but she made it incredible. She's literally a bar genius. You can ask her to make anything. I am only going back if Sharon is bartending.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Valerie D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1567209600000,
        "ReviewContent": "Great experience. Sharon hooked it up and took care of us all night. Neighborhood vibes, can't go wrong with riptide... I'll be back!!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Aisling D.\", \"AuthorLocation\": \"Outer Sunset, San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1566172800000,
        "ReviewContent": "I grew up in the Sunset, and have seen shows at the Riptide when I was younger. I was visiting home, and my friends and I took a taxi over from another bar where I and my friends had had one drink. Long story short: we walked in. I sat for 5 minutes alone waiting for a drink. My friend sat next to me for another 15 minutes; all together we were there for about 20 minutes and the bartender on purpose ignored us (with a great deal of eye contact) and kept serving other patrons first despite being there ahead of people. The bar back ignored us too. It was obvious they weren't going to serve us. We left.A. This is rude. B. This is judgmental. C. This is random. D. I won't be back. E. You're losing business. The door guy was nice, but this doesn't make up for completely dismissing customers on no basis on a Friday night.Lastly, we walked up to a bar on 33rd called The Four Deuces and they were happy to serve us and very friendly. ;)",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ronnie B.\", \"AuthorLocation\": \"Seattle, WA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1564790400000,
        "ReviewContent": "Coming from out of town not knowing where to go Let me tell you if you're like me and staying close to this bar I highly recommend checking it out Cheap beer and Good beerGreat music and Great company Get a black an tan and sit back and Relax",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"HOLLYWOOD M.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1564444800000,
        "ReviewContent": "I just came home from an open mic that I participated in. This was the second Monday, last Monday having played the Botanical Garden Piano event, a group of people I just met went there after. It was a blast. Charles, who leads the event, is the most helpful. I had an issue with the connector to my instrument, the iPhone. Honestly, I have no idea how I sound to others. I am usually nervous. It started at 8:30. A line forms in the middle of the room silently. You write your name in the book and you have 2 songs or ten minutes. Molly serves the booze. Every type of music gets sung/played. All skill sets. Everyone is friendly. If as one person said, she waited and waited, think of it as a blessing. You didn't have to pay. You got to take in the atmosphere free of charge. There is a therapy in waiting. Sometimes a bar is a form of therapy. Enjoy your life. Don't take yourself so seriously.I got to play my music, which I think is an addiction, and people were paying for drinks, and listening. Two people were nice enough to say nice things. What more can a person ask? I only have good things to say about The Riptide. \"Can I pull out now?\"",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mario S.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1561939200000,
        "ReviewContent": "Cool bar, dope vibes and Jean is a super nice bartender that's light weight famous! Will definitely be back for Karaoke fun!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Phil S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1561248000000,
        "ReviewContent": "The bouncers here are great. They are friendly and will tell you what night it is--bingo, karaoke, country, etc. I usually come here after eating some pizza next door to use their bathroom and drink a quick beer.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sam Y.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1560124800000,
        "ReviewContent": "Pretty cool vibe. Cash only. Sell cigarettes. Crowd is locals. What you see is what to get.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Scott D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1557532800000,
        "ReviewContent": "I came on a Tuesday night after work. I walked up to the bar and waited. And waited. And waited. The female bartender did not approach me even after we made eye contact. She kind of looked off and mumbled something to the bar-back. The bar-back saw me. Said nothing to the bartender. There was no one else waiting for a drink and only a few folks seated at the bar. She leapt up to serve a couple who approached the bar a few minutes after me. I thought, there's no way and no reason she shouldn't serve me. She must have... not seen me? Tried to give her the benefit of the doubt. But an older gentleman seated across the bar saw me. We made eye contact. I shrugged and smiled. He waved the bartender over, whispered something and pointed toward me. She said something back to him. Slowly turns with a hard eye roll that I couldn't miss, and drags her feet over to me. She approached me in a way that assured me she knew I was there the whole time. I ordered for the group of volunteers I invited to the bar who were seated at the table. I won't go into the details of how she took my drink order. I'm really puzzled. Was it the way I was dressed? Too formal? Ms. Bartender, I was respectful to you. I didn't wave you down. I paid and tipped. I live in the sunset and I will never invite friends to join me at Riptide as long as you're serving there. Usually don't write these things, but as a local and someone who's never been so poorly served and welcomed into an establishment, had to write this for others.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Josephine L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1555200000000,
        "ReviewContent": "Easily the most fun & social bar on the West Side. Where other bars cater to narrow segments of the population, The Riptide pitches a 'big tent' (so to speak ;) for any & all thirsty wanderers. Whether it's Open Mike Mondays, raucous Friday happy-hours, Bar-Bingo Saturday nights, Country-Western Sundays or any other time, The Riptide is an *outstanding* place to take the pulse of SF's biggest beach-side community - while imbibing good, strong, reasonably priced alcohol, of course.Recommended!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"David J. B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1553990400000,
        "ReviewContent": "Delightful neighborhood bar, they pour a good Guinness and they always have events going on like trivia, live bands, standups, etc.They also allow dogs, plus the staff is super friendly!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Louis M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1543449600000,
        "ReviewContent": "If you're looking for a friendly and welcoming, yet wonderfully divey bar out near the ocean, you're going to want to head to the Riptide.  After a day at the beach or if you're out in that general vicinity, you really can't beat it.They have live music, bingo, strong drinks, and dark decor.  I was worried for a while that they wouldn't open after the fire, but they did and they're just as glorious as ever! The bathrooms are about as clean as you could hope, and everyone is surly in that wonderfully dive bar way.  You don't feel unwelcomed, you just know your place as you warm your way in.This is a great place to hang your hat for a while.  Parking isn't too bad around the block, either.  Might take a second, but you won't be far away!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jes G.\", \"AuthorLocation\": \"New Orleans, LA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1540857600000,
        "ReviewContent": "This place became a staple during my week stay in the Outer Sunset! It reminded me of home in a way, kind of like a divey Brooklyn bar. They also have board games, a nice crowd, and friendly bouncers. Overall fun place and definitely the best bar in the neighborhood.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Joanna B.\", \"AuthorLocation\": \"Roselle Park, NJ\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1537833600000,
        "ReviewContent": "I can't believe I haven't written about The Riptide yet! I feel so lucky to have this as my local bar, and I was heart-broken when it was burned down by a fire that started in a neighboring shop. The owners, Les and David, have done an outstanding job bringing back the homey, nostalgic feel of the original Riptide while adding some updates. The fireplace survived and is still a great place to cozy up when Karl the Fog is out and about. The drinks are cheap and generous. There is usually a special going on, and themed events like Bingo (the BEST) and karaoke (the WORST...in a good way). If you make it out the Western Edge of the World (aka the Sunset), make sure to add a stop at The Riptide!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Dyanna Q.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1531440000000,
        "ReviewContent": "Nice bartender and good atmosphere! Perfect when on vacation. Drink prices were great as well.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mariana B.\", \"AuthorLocation\": \"Corona, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1528243200000,
        "ReviewContent": "If you don't live in the neighborhood don't fucking come. This place is a casual, low key, hole in the wall that has a lot of potential. However I requested a song that I did not realize was a different version from what I am use to. I was ridiculed by both the bar staff and the DJ. The version I love is \"live\" and the menu did not specify that. I was only told after an embarrassing \"omg you chose this\" eh interview. And then it was ridiculed through the whole bar. I will never visit again.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mercedes G.\", \"AuthorLocation\": \"Manhattan, NY\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1522972800000,
        "ReviewContent": "Awesome dive bar with cool beach vibes. Good cocktails (according to my lady) at great prices. Lots of beers. No food. Glad they recovered after the fire. Great neighborhood spot.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sam A.\", \"AuthorLocation\": \"San Diego, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1522022400000,
        "ReviewContent": "Fireplace. Live music. Eclectic clientele. Rad staff. Beach a block away.The Riptide is a true diamond in the rough of the outer sunset. Hop on the L, head on out and have a good time.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Tyson S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1521849600000,
        "ReviewContent": "Other than the lower prices on drinks, this place wasn't the greatest for a younger group of 3 people. The seating wasn't amenable for this number of people and the inside seemed claustrophobic. I am not that into dive bars though",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Clayton B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1520208000000,
        "ReviewContent": "The Riptide is the best neighborhood bar! Love Bingo on Saturday nights! When there is live music it livens the place up. Since the fire, the place has a Smokey smell that adds to the ambiance. Love the wood everywhere. All of the bar tenders are friendly and have a good time while working. Their happy hour specials are awesome! Love all of the events they put on, food drives and the ever so famous Polar Plunge on New Year's Day!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Alice B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1520121600000,
        "ReviewContent": "This is the most fun and by far most affordable bar in the Sunset. The bartenders are extremely nice and bingo night is always super fun! Locals are friendly and you can bring in outside food. It's a cool and clean dive bar. The only down side is that they are cash only but there is an ATM inside for a small surcharge. My fiancé and I came here right after he proposed!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Angela T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1519603200000,
        "ReviewContent": "DIVE in, best music in town. Reconstruction after fire is seamless from original, except the ships Captain painting is missing...",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jill L.\", \"AuthorLocation\": \"El Segundo, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1518825600000,
        "ReviewContent": "The Riptide is a great local dive bar located in the outer sunset. It's unsurprisingly crowded during the weekends. But, the service is quick. The vibes of the bar is a mixture of both young mid 20 y/o's to 50 y/o's. Another great addition to the bar is live music. It's a well rounded bar for a beach town.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jeff C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1515196800000,
        "ReviewContent": "Fun, down to earth bar with a super friendly bartender, and some cozy booths, but some really odd and a little off-putting patrons. Felt a bit like One Flew Over the Cuckoo's Nest.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ralph K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1511481600000,
        "ReviewContent": "Best neighborhood bar ever. Service is fast and friendly, cocktails are great. On a lucky night you get free potato chips. Bingo on Saturdays. Bacon Bloody Marys on Sunday are delish. Crowd always welcoming.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jules M.\", \"AuthorLocation\": \"Las Vegas, NV\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1510617600000,
        "ReviewContent": "Good local bar. Tasty Bloody Mary although we did not have the bacon because they do that on Sunday's. We were staying at an air bnb up the street. We went back but they had a wedding reception going on, like I said a great local bar. Go if you are in the area!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Beautiful F.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1508112000000,
        "ReviewContent": "I was there for the first time on a Sunday eve after Hardly Strictly Bluegrass. Loved that there was  live music all night!  Great beer too. Small neighborhood dive-type bar but recently rebuilt.  Nice, new. Beach town, love the ocean scent in the air.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Elizabeth R.\", \"AuthorLocation\": \"Redondo Beach, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1506124800000,
        "ReviewContent": "Really fun place. Great service, reasonably priced drinks, fairly clean, and lots of fun events. It's also close to the beach and public transit. It is cash only, so be ready for that, and I wouldn't recommend going on Bingo night unless you're into that (it gets super loud), but otherwise I have no complaints.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Erik B.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1505433600000,
        "ReviewContent": "I don't drink often but once in a while I will stop in for a scotch on the rocks. Here is my take on The Riptide:Good service (thanks Michelle) for sure. Clean and fairly well stocked. Very divey but that's okay with me. Big projection TV screen set up and good music. $9/single of Macallan 12 and you're gonna wanna just get it neat and ask for a cup of water with extra ice because on the rocks it's less than a single lol. My double felt more like a single at the end of it. Huge downside: Cash only. ATM in the joint but a $3 surcharge. Upside: next to public transportation and of course Brothers Pizza.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Bella B.\", \"AuthorLocation\": \"Dallas, TX\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1494288000000,
        "ReviewContent": "Best bar ever.  The staff is exceptional - each and every one of them.  It feels like a home away from home.   Familiar faces, low-key fun.  Really rebounded excellently after the tragic fire that took it away from us.  Going in on a Friday night is often one of the only things that gets us through the week.  It really feels like family.  Lots of special events : music, burlesque.  Only problem ?  Weekly bingo doesn't happen anymore.  Bring that back, and you will have absolute perfection.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mary N.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1493942400000,
        "ReviewContent": "Fun local dive bar. This bar was rebuilt after it burnt down in a fire.You definitely get the feel that this is where the locals in the sunset come. The theme inside is pretty nice. There are mounted animals on the walls and a fireplace that has a fire going.They have live music as well sometimes. Make sure to bring cash, since the bar is cash only. There is an ATM inside the bar if you need to use it. This place is fun for a low key evening.There is no food served here.Plenty of parking on the street, or the rail line drops off and picks up on the street.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Kevin S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1491696000000,
        "ReviewContent": "Found this place quite by accident while staying down the street in a motel.  What a great place.   A very friendly dive bar that pours a great drink.  Good conversations and advice on place around the area.  Plus I can take my dog in with me.  Brothers Pizza is just 3 doors down and you can bring in food.  Lots of times at happy hours the bar has free snacks.   Some times they have music or play bingo.  It is somewhat quite early, but it can get real busy on bingo night.  Never had a bad time here.  Highly suggest it.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"India G.\", \"AuthorLocation\": \"Caspar, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1484524800000,
        "ReviewContent": "The riptide is a truly amazing local bar. When it burned down two summers ago, it was truly a tragedy. Thank goodness that the owners were able to raise the funds to rebuild - it's so good to have it back.The best part about the riptide is that it is totally un assuming.  You can be anyone, be going for any reason, and feel at home here. Yes, there are hipsters, yes there are surfers, yes there are punk people, yes there are old men, yes there are your classic day drinkers, yes there are students, yes there are nerds - really - you do fit in here.Other things about the riptide that are great:- They serve free food during their happy hour (5-7 weekdays). No it's not fancy. But really, who doesn't love chips with nacho cheese sauce out of a crock pot?- The beer is not $8 or $10 a pint. I think it's like $6 for a Lagunitas.- They have both light beer and craft beer. Again - you DO fit in here.- They have a fireplace. Yes, you heard me right - a fireplace. And no, not a fake one - the real kind that you put wood on. And yes, you can sit next to it.- They have a TV and you will find your local sports fan friends there at the appropriate moments.Cons:- uh there really aren't many- It's too clean since the remodel?- Verizon doesn't get good service inside? (this might actually be a pro - who wants to get a phone call while enjoying happy hour anyways?)- It's kinda small? Love the Riptide.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sarah C.\", \"AuthorLocation\": \"Santa Cruz, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1481673600000,
        "ReviewContent": "Stopped by last night for a much needed drink after a long day, Noah, the bartender, was super friendly and helpful! Love this place!!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Holly F.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1478822400000,
        "ReviewContent": "I use to go there before the Fire happen in 2015, to hear my friend Ken Owen play the drums, on a Sunday. The service is okay, the prices are fair, its,at the end of my street gotta love that in walking distance!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Karen B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1478390400000,
        "ReviewContent": "The Riptide is back from the ashes!  The fire may have closed the bar down for a year and destroyed the decor, but it is back and better than ever!  The amazing staff is ready to serve a delicious bacon Bloody Mary, a expertly made Manhattan on the rocks, or a perfect pint of Guiness.  It is still the place to meet your neighbors and friends or make new ones so, run, don't walk to The Riptide.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"melanie b.\", \"AuthorLocation\": \"San Carlos, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1465689600000,
        "ReviewContent": "I miss this place!! Deceptively large, great jukebox selections. Bartender was great. Fun atmosphere. Locals were so receptive and warm, not like other bars I've been to in SF. I hope this place makes a comeback!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Charles B.\", \"AuthorLocation\": \"Pomona, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1460419200000,
        "ReviewContent": "Sadly, I began going to the Riptide a few months before the fire.  Awesome vibe and by far the best bar in the Sunset.  I cannot wait for it to re-open, holla.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Kyle N.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1457827200000,
        "ReviewContent": "Always loved bingo Saturdays. Looking forward to hearing O 69 and getting free jello shots Well mix of young and old. I just hope they have a bit better selection of high end spirits like single malt, bourbons, and maybe even a calvados. Looking forward to going on my 50th next month. Drink priced always good.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"A K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1444780800000,
        "ReviewContent": "My husband and friends and I have been coming to the Rip Tide since it opened. We even came here when it was the Sand Bar and before that the Oar house. However since it has been the Rip Tide, it has been a weekly home away from home for my friends and I. Since the fire, we have simply been lost without our cozy booth, and our bartender friends and neighbors that we see regularly. We support you and miss you terribly.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Amanda L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1439942400000,
        "ReviewContent": "It's a shame about the fire, this place was a great little bar stuck far enough out in the Sunset to keep it off the radar a bit.  The bingo games always got the place collectively going, and all of the sudden some dude next to you is your new best friend bc now you have a common goal (other than wasting the day away on a barstool.)  The bartenders know how to pour a drink and really don't take any BS. There always seemed to be a wave (pun!) of young weekend bar hoppers that appeared and kind of ruined it for a while, but they usually left soon enough.A very good drinker's bar.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Meg W.\", \"AuthorLocation\": \"East Bay, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1439078400000,
        "ReviewContent": "Read about bingo here on Saturday nights and a few friends and I decided to give it a whirl.  It is free and starts at 6:00pm.  Space can be a bit tight, so arrive early to grab a spot.  There are 3 rounds with a few minutes in between. Parking was a breeze!  If you're looking to grab a bite to eat near by, you're going to have to look pretty hard if you're not into pizza/pasta/Indian (all in one restaurant).  The bar staff is pretty and accommodating if you're new to the joint like we were and aren't quite sure where to situate yourself when there are no tables left.  Service seems pretty quick too!Bingo is spirited and the whole bar gets into it.  The best part is the jell-o shot when O 69 is called!I'll be back when I'm in the area or need something fun a cheap to do!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Lauren R.\", \"AuthorLocation\": \"Zionsville, IN\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1438992000000,
        "ReviewContent": "Came here last Thursday afternoon after a walk on the beach and had a wonderful time. The bartender- I believe her name was Adaline- really went above and beyond, recommending drinks and making a very enjoyable atmosphere. Also they had DIY sandwiches- so clever! I would highly recommend this cute little neighborhood dive bar.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Allie S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1437696000000,
        "ReviewContent": "The Riptide is a great neighborhood bar. It's not a fancy cocktail lounge, it's not a Michelin starred restaurant - it's an honest, no-frills bar in one of the few working class neighborhoods left in San Francisco. If you're expecting to have your ass kissed you should head back to SOMA. If you want a good drink and no bullshit, with a great 70s rock soundtrack, come here on Thursday for Adaline's happy hour shift.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Brigid B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1436486400000,
        "ReviewContent": "Great dive bar, right by the ocean with killer sunsets right outside. My dog Mako always has a blast, usually with another dog friend or two, and excellent bartender service! Always surprised at some of the people's comments -- I guess they've never been to a dive bar before, or don't know how to act if someone isn't kissing their asses all night. They should probably stick to their hipster-spots in the mission or whatever. Was there just this last Thursday with literally ZERO complaints! I'm usually outta here by 8 or 9 to miss the evening crowd, but the cool atmosphere and good times from 4-9 is always a winner. Good prices, good whiskey.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Collin D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1435968000000,
        "ReviewContent": "I struggled with the stars on this one. Most of the time I go there and it's comfortable, queer friendly, and has a home town divey time.  But with what happened recently I probably won't go back.The Thursday of the Warriors playoff games my girlfriend and I went to watch the game at 5pm ish.  It was on the big screen but with no sound (???)  And then I asked the bartender if it would be alright to bring in slices of pizza from next door.  (PS I waited 5 minutes standing at the uncrowded bar while she was texting someone)  She glared at me and literally barked \"As long as you clean up after yourselves\" and kept glaring at me.  She was so hostile that the people sitting at the bar looked up in shock.  I was in shock myself and to keep from saying \"Well, you know it is hard for me to clean up after myself or even eat in public especially since I'm only 35 years old...\" I just paused and laughed uncomfortably.  WTF.  Meanwhile there was a nasty little table with cold cuts and bread that people could eat that they had to dip their hands in.  WTF x2.We left at half time and went to Parkside Tavern where the SF citizens with a pulse were watching the game and celebrating.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Patricia D.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1434758400000,
        "ReviewContent": "Could definitely be my favorite bar in the city.  Absolutely out of the way from me but nothing makes me happier than heading out towards the beach for some music, some drinks and a good seat at the bar. Everybody knows each other, great prices for the city, dogs welcome... a great spot.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Chloe B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1433980800000,
        "ReviewContent": "This place is definitely a find. On a Friday night, it was filled with locals who seemed to know each other, a bartender who was speedy but not curt, and some pasta salad and chocolate cake on the house. No hipsters, no techies, no gleaming white buses, no endless bike racks, no $7 beers. Just a big screen showing the Giants game, people getting along and having a good time, and lots of street parking. Gosh, I almost forgot how going out in San Francisco used to feel.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Randy M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1431993600000,
        "ReviewContent": "I went to the Riptide this past Friday night for a little late night drink and Mike Gerendasy was my bartender.  He was very friendly, made me a very tasty cocktail and even went as far as to introduce me to folks sitting around me because I was there alone.  Mike has to be one of the best bartenders in the City...I will definitely be back when he is working!! The Riptide is a great neighborhood bar even though it isn't in my neighborhood!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"S. R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1431129600000,
        "ReviewContent": "Bingo Saturday nights with locals = guaranteed good time! Jenny the bingo lady is awesome, drink prices are great, cute dogs allowed :) and crowd is chill. Also bingo lady's boot sister is a hottie.Apparently there's karaoke as well!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sam P.\", \"AuthorLocation\": \"Austin, TX\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1429401600000,
        "ReviewContent": "I live in this area so it is great as a neighborhood bar and every night during the week they serve food. The great thing for me is that it is mostly locals so you get to meet a lot of people who live in this area. As far as the sunset district goes most of the bars are dive bars but other than the riptide they are all full of old men. Great drinks, cool people, and wet Wednesday's. That is when they show surf movies usually shot at ocean beach and every third Wednesday they used to raffle off a brand new board.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mercedes M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1427587200000,
        "ReviewContent": "I spent a foggy Wednesday night here, drinking cokes and eating Doritos with my visiting sister. The music was so weirdly excellent - try Norah Jones sandwiched between Minor Threat and Ministry - that I knew I was in a special place. Then a bartender in a 'namaste motherfucker' t shirt slapped some pens and napkins onto our table and told us to draw something for their weekly sketch contest. When my sister said we were leaving, the bartender called bullshit and said 'you've been sitting here all night, you're not leaving.' And so we drew really bad Jasper Johns and Andrew Wyeth knock offs to comply with the 'American modern artists after 1920' sketch contest rule that night. This bar is really fun. They have bingo and karaoke and with the wooden interior and all the nautical decor and taxidermy and activities it feels like camp. Not that I've ever been to camp.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Michelle T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1426896000000,
        "ReviewContent": "This place is cool to hang out with a few friends after work. Love their drink specials and honestly some of the friendliest staff I have ever met at a bar, and in general.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Nathan M.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1423094400000,
        "ReviewContent": "I went here a ton during the six years or so that I lived in the neighborhood, mostly because it was great to be able to walk to blocks to the bar and not worry about how I was getting home. The place is not big, but there's usually plenty of people there to socialize with. I definitely saw a few \"altercations\" there over the years, but for the most part it's a very chill place to hang out and grab a few drinks. For what is is -- a dive bar in a neighborhood full of surfers -- it works extremely well. The only reason I don't give it five stars is that I wasn't ever a fan of the bands that played there. They've got plenty of other events going on every week though.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ben M.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1421280000000,
        "ReviewContent": "I LOVE the atmosphere of this place. Super cute and cozy but just as divey. They always have something going on each night and have bands come in to play frequently. The only con is that I wish the service was better. I typically have to wait 5-10 min for a drink. It's still one of my favorite bars in the sunset.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Anastasia P.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1421193600000,
        "ReviewContent": "O69!!!!!There are dive bars, and then there are dive bars. Usually dive bars are... well just dive bars... but THIS is an AWESOME dive bar. It's near the ocean side of San Francisco, so I got super lucky, and it was insanely easy to find parking... unlike in the Sunset... or some other crazy part of town. If you look over yonder, you can see Ocean Beach! Wooooooooo.I was excepting... well... divey... but this. This place is homey; yes it's small (there are two parts to the bar which is divided by... well the bar), but even when it was a little crowded, it didn't feel that bad. The only thing I felt bad for were the dogs people were bringing into the bar... like people please... dogs? In a bar? Where they're at ground level and drunk people can't see and step on them? :/ Poor doggies... plus it's loud and kind of rowdy... so I imagine them getting kicked around a little bit.Drinks are cheap, but I didn't come here for drinks that night. I came here... for BINGO. Bingo, you say? The old people's game? No. This bingo is awesome bingo. Riptide does Bingo on Saturday nights at 6 pm. We were late, so we only got to play the last round out of three total rounds (come early because sometimes the rounds finish quickly), but it was still awesomely fun. It was a blackout round, so you had to blackout all the squares. The emcee was hilarious (pretty sure he made the game); drinking with the patrons, telling funny jokes, and he was super nice and let us play the last round.Here's the thing about this bingo. Everytime they get the O69 ball... EVERYONE and I mean EVERYONE who is playing the game, gets a free jello shot! How's that for advertising. Makes the game pretty fun and everyone's obviously in a great mood.Love the decor, there's carpet in some places... which seems like it would get really gross, but it wasn't, there's a random fireplace too in the back! Seemed to have enough space for the people in the bar... and I didn't feel too claustrophobic inside.Definitely on my list to make it back to. So much fun! Oh also, don't forget. This place is cash only! So bring moola!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Denise C.\", \"AuthorLocation\": \"Pacifica, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1421107200000,
        "ReviewContent": "i'd a gave that dj my last dimeit's great how this city truly offers a wide array of nitelifeyou want dive, beer pong, red carpet, edm, fratty, its somehwere you want lodge like you got it here.  my id and super ego after a few jamesons can run snoop like or toby keith esqueyea they're extremities as i can picture myself draped in gold bouncing to hydrolics in an el camino or waving to folks in wranglers in a dodge hemi...then i wake up the next day and realize i'm late for munithat mounted moose is the bees knees as ill drink to that massive pointer.  unexpected and good times here at the riptide",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Clark G.\", \"AuthorLocation\": \"Reno, NV\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1417996800000,
        "ReviewContent": "You know that place in Hitchhiker's Guide to the Galaxy -- the last bar at the end of the universe?  That's what I think of when I come to Riptide.  Venture out to the Outer Sunset on Taraval past West Portal, past 19th Ave., past Kingdom of Dumplings and Marcello's, past Sunset Blvd., and you will come to where San Francisco ends -- the Pacific Ocean.  And right before that, a stone throw away, is this little bar.  It's the perfect place to huddle up with friends and just let the time stand still.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Seth E.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1417305600000,
        "ReviewContent": "Love this neighborhood bar! I came here on Saturday night for Bingo Night (YES, bingo night. ) It was a full house. We manage to find a high table and got free bingo cards. The pregnant lady calling out the number was hilarious and kept the mood fun. At O 69, the whole bar got free jello shots. Drinks were super cheap here and have the usual domestic beers. There's a juke box in the corner if that tickles your pickle.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Kelly C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1410134400000,
        "ReviewContent": "Came to hear Jinx Jones play rockabilly recently, my first time at the Riptide. The beach is two blocks away, I loved hearing the surf while nearing the place. The tavern has two doors and seems like it may have been two separate spaces at some time or other, united by the bar. Drinks can be ordered from either side. I was very impressed by not having to wait long to order and receive my beer each time, despite the place being quite crowded. Also liked that I could talk to and hear my friends, the music wasn't deafening. Was further impressed by the diversity of the crowd: old, young, a table of lesbians, loners, dogs, definitely a few rockers. What a great place!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Brian G.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1409356800000,
        "ReviewContent": "Always free Always funLove the Rip and the StaffBest Bar in the Surfers Sunset",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Alex M.\", \"AuthorLocation\": \"Sunset District, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1407110400000,
        "ReviewContent": "Still a 5.  seems like they maybe cleaned up a bit.  have not noticed the smell the last few times in there. . .. . .still a must-do spot if you have never been.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Johnny C.\", \"AuthorLocation\": \"NV, NV\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1406851200000,
        "ReviewContent": "Just happened to stumble into this place since I had some time to kill while waiting to pick up the lady from work nearby.  I was pleasantly surprised.  Between the large screen with the hockey game on, the punk rock jukebox, and the dog-friendliness I was hook.  It basically felt like home.  I've made it a point since then to stop there at least once a week with the lady and the pooch.  Oh...and the bartenders are welcoming and really friendly.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Tim U.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1406592000000,
        "ReviewContent": "Pulp Fiction Soundtrack on the jukebox and a helluva bacon bloody! ! Rock on!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sin F.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1406073600000,
        "ReviewContent": "Cool lil spot with  alot of things going on within the week and a nice lil list of drinks. I tried em all they're all good. In fact the crowd was soo nice there I had people buying me drinks.  The bartenders are great , no matter how loud it gets it seems like they can hear what you requested without you even having to yell and no matter how busy it gets they give you excellent service. It was packed and I didn't have a hard time ordering my drinks at all.  The karaoke gets pretty happening here on tuesdays. Theres a nice variety of people in here. No clicky types , everyone seems to make me feel welcome. There seems to be a big college crowd here. I also find it to be a great place to watch the game. gotta check out the drink specials from 4-7, but they also have specials for the certain days of the week that last all night too.  The food is delish.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Luke S.\", \"AuthorLocation\": \"San Mateo, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1405987200000,
        "ReviewContent": "As with most of the Sunset bars, this is not for hipsters or amateurs. One of the greatest jukeboxes in the city. Great beer selection. Great bartenders and great music. The only bar in the city you can enjoy slide guitar as well as real beach music. With one of the best pizza joints in the city right next door, you just can't go wrong here.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Wayne B.\", \"AuthorLocation\": \"Ruskin, FL\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1400976000000,
        "ReviewContent": "Wel love this bar.  If we are in San Francisco we always hit the Riptide.  All the bartenders are friendly and the clintes welcoming.  We live in Fort Bragg CA and only get to San Francisco a couple times a year.  But the bartenders ALWAYS remember our preferred drinks and our names.  Week nights they often have \"Happy Hour\" food.  But you can always bring a snack of your own.  Well stocked bar and they know how to make a martini.  I would recommend the \"Bacon Bloody Mary\"served in a pint jar with bacon bits on the rim... Miss Jean makes a mean one on Sundays, and since I prefer Gin over vodka, she is happy to make the change and never questions me.  If we have our dog \"Miss Dixie Dalmatian\" with us, she always gets a strip of bacon herself.  Some nights they have events that are always fun.  But any day is a good day at the Riptide.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Scotty G.\", \"AuthorLocation\": \"Fort Bragg, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1399939200000,
        "ReviewContent": "Bingo Saturday is a lot of fun, awesome fireplace, great dive bar!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Roberta B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1399766400000,
        "ReviewContent": "I'm new to San Francisco and it was great to go somewhere where everyone is friendly, the music is good and the bartenders serve promptly. I'll be coming back for sure.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sean A.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1398297600000,
        "ReviewContent": "Fun bar but last Tuesday when I went down for Karaoke Tuesdays someone picked up my leather jacket and left me theirs. Try to get it back but don't know how :( if you see this respond or at least tell the bar tender there what happened. I would really really appreciate it. That leather jacket has a lot more sentimental value that you think.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sarah W.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1398038400000,
        "ReviewContent": "This is the nearest bar to my apartment, so I occasionally mosey on over to hear the Hillbilly Hootenanny West Side Review.  They sound amazing.  I never thought I would think that of country music, but truly, this band is good.  As for the bar, it's cash only with an ATM inside.  It gets crowded, but not too bad.  Nice, convenient dive bar.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Abby S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1398038400000,
        "ReviewContent": "I can't count the times I've staggered out of Riptide after a rip-roaring good time and somehow made it onto Muni AND stopped for Seniore's, girlfriends in tow. If you're looking for a fun, neighborhoody divebar to head to on a weeknight, look no further than Riptide. Drinks are strong, staff is friendly, and they usually have *FREE* nachos or hot dogs (eat at your own risk, but I've never had a bad experience) to soak up some of the strong drinks you'll most likely be sappin' on during the queue for Karaoke. Oftentimes there's live music and the spot has a homey kind of feeling to it: a bunch of people who know each other, or you're with someone who knows other people, or you're a stranger and go to bars alone, either way, you will likely be able to find someone who will converse with you.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Crystal R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1397174400000,
        "ReviewContent": "I reside here (Outer Sunset) and love this bar! Not a big drinker, just love the neighborhoodeee vibe, and how eclectic the people are here...the young to the kinda older set. Woman at the bar has it going on in terms of very pleasant, plus quick and efficient!  Hip w/out being tragically so...",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Debbie H.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1395878400000,
        "ReviewContent": "Fan-flipping-tastic!  We saw Gypsy Moonlight tonight and they were Exactly right. Lots of love!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Rosie S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1395187200000,
        "ReviewContent": "This place is cool to hang out with a few friends after work. Has free nachos and cheap beer. 3 premium beers for $12. Not to bad if you ask me",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Angel R.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1395100800000,
        "ReviewContent": "This place rules. A quick hop, skip and a jump away from the beach and you'll be in an authentic beachy cool bar. The decor is interesting and not cluttered. It's clean inside, but not hoity toity. The tables? Maybe my favorite part of the bar. They are made of thick slabs of beautiful wood. Unfortunately, I didn't get to see a show here. However, next time I'm in town it'll be a must.Cash only for drinks here. The beer list will satisfy any palate and they are reasonable priced. AND, they have free snacks... which included tator tots when I was there!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sarah M.\", \"AuthorLocation\": \"Tulsa, OK\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1394755200000,
        "ReviewContent": "Love this little bar, good music. $2 PBR, snacks with happy hour, karaoke night once a week, and dog friendly.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Danielle F.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1394323200000,
        "ReviewContent": "Place is awesome! It's off the grid really close to the beach. Definitely a local bar with interesting patrons. Bingo night is a lot of fun. Jenny who is also a friend of mine calls it Saturday night. Comes with free Jell-O shots (who wouldn't want that). The decor is very unique. It reminds me of a classic log cabin living room with a bar of course. The drinks are really cheap and made well. Riptide is a must go!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Al S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1392940800000,
        "ReviewContent": "Scummy dudes what don't take no for an answer. Should be one star but the staff is really nice and cool. Quick drinks and really helpful with telling drunk guys to leave girls alone. Are willing to be the bad guy to help you out. Thanks riptide bartenders!",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Charlotte M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1391817600000,
        "ReviewContent": "Love this place...  a real neighborhood bar in the best possible the sense... meaning you get a cross-section of the people that live in this whacky-ass neighborhood. Surfer dudes, poor hipsters, older people, and dogs -- come one, come all.There's a fireplace (which is more appropriate on this beach-for-suckers than a beach blanket).There's live music a lot.  Could be good.I saw some swing dancing once (and it wasn't in the 90's).You'll feel transported -- I'm just not sure where to.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Kevin F.\", \"AuthorLocation\": \"New York, NY\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1391299200000,
        "ReviewContent": "Was at Riptide with a group of friends during a night of bar hopping. This sleezy douchebag slipped his hand around me and would not leave me the hell alone after telling him off. When the bartender saw she stepped in and escorted the a-hole away. I left about 10 seconds after that with my friends following and they told me that the bartender was super nice about it and apologetic as we were leaving. Definitely going back to thank her personally for being so awesome about that! She made a bad situation go away fast and I'm extremely grateful for that.Also, the place makes fantastic mixed drinks and is really generous when it comes to shots. Not to mention that that bartender calls everyone \"honey\" and that's super cute.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"R M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1388793600000,
        "ReviewContent": "I like the beer selection and ambiance here. There's also some pretty great events like movie screenings and such here. The only downside to this place is that it's pretty small and gets packed easily. Parking is also a hassle, but it's not a bad place to chill and have a beer with some weird surfing movie on the big projector. Their tables are pretty cool, too. They're shaped like driftwood and can fit a small group.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Danny C.\", \"AuthorLocation\": \"South San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1386115200000,
        "ReviewContent": "I went here on 12-3-13 around 9:30pm.  I ordered a lagunitas ipa $5 and noticed there was a little green price list (certain draft beers were also $5--also purchased a guiness, and heineken was $4). There were 2 girls promoting \"Wild Turkey whiskey\" with coke samples to the patrons, I had two and also gave me a keychain with bottle opener.  This bar really have good prices on their beers.  Eileen the kj was throwing the gig and was able to sing all the songs I requested, she has a thorough selection (I sang Lenny Kravitz's \"Fly Away\", Marvin Gaye's \"What's Going on?, Earth Wind and Fire's \"September\" + \"Let's Groove\", and Prince's \"Popllife\"+\"I would die for you\". The speaker system is better than decent/I didn't have yell in the microphone. There was a moderate/young crowd,  definitely into the scene.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jer W.\", \"AuthorLocation\": \"San Bruno, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1385424000000,
        "ReviewContent": "Oh, I get it -- it's called The Riptide because it's close to the coast! Very clever, very clever.This is one bar that complements the area nicely. Get away from the cold, foggy banks of Ocean Beach and warm up with a roaring fireplace and the game going on overhead. It's a come-as-you-are style of bar, one where the beer flows like wine and even the dogs can take a seat.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Casey S.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1382227200000,
        "ReviewContent": "Riptide certainly has an interesting culture, an attempted nautical theme and dark wood paneling makes it a typical, middle class neighborhood bar. The atmosphere is warm and friendly, space kept clean and the staff warm, friendly and helpful.I would probably go back again.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Catherine S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1382140800000,
        "ReviewContent": "Fun divey bar out in the outer, outer. Bartenders can be a bit unfriendly, but unique place in SF.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"K Z.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1381795200000,
        "ReviewContent": "Bingo Saturdays are the shizz.Love their drink specials and honestly some of the friendliest staff I have ever met at a bar, and in general.This place can be a real turn off if you're parochial and only drink high-end vodkas and spirits. Lots of a beer on tap. Lots of interesting drink concoctions like coffee flavored vodka and baileys, as a shooter. Absolutely tasty and for only 6 bucks, it sure gives you a kick!I don't know what else to say but this place is just so down to earth and so welcoming that it makes me want to come here everyday so I too, can become a regular. I am by no means a regular to this place, but I will say that my first time here, they treated me as one. They were welcoming, not judgmental, as I was- for sure -the ONLY Asian in this place, and just down right a fun bunch of people.What other place gives you free Jell-O shots during Bingo when the coveted O-69 gets called? What other place have regulars that bring in food for the whole bar to eat? And what other bar at times has bacon flavored popcorn?I give the Riptide 5 stars, for all of the above.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Tiffany N.\", \"AuthorLocation\": \"Castro Valley, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1379203200000,
        "ReviewContent": "Was told this bar was dog friendly. Brought my dog, dog was attacked by another dog then I was asked to leave because the other dog was ownd by a regular patron. moral is don't bring your dog unless they are 100% submissive to more vicious dogs.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Max M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1376956800000,
        "ReviewContent": "My friends and I came here Saturday for bingo night. We got there around six and the place was already packed. I would suggest coming earlier if you want to grab seats. Luckily for us, a couple let us share a table with them. But don't worry if you don't have seats, they can provide you with a clipboard if you want to play bingo. Three rounds of bingo. A winner from each round wins a prize. The last round's reward is a $50 bar tab, which I think it very worth it if you win it. The entire bar gets excited as the rounds progress. Everyone also gets a free Jell-O shot if O69 is called. Unfortunately, none of us won anything that night, but I still had fun playing and chatting with my friends! This is a chill environment to grab good and cheap drinks. The staff is inviting and friendly as well. Because it is so close to where I live, I would come back to this place.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Lucia Z.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1376784000000,
        "ReviewContent": "I absolutely love coming here! Bingo is what usually brings me in, but it's also great for grabbing a drink or two (or five) with friends.  Bingo on Saturday nights is always a blast, and that's considering that I have yet to win here.  Bartenders are friendly and know how to make a good drink.  The general ambience reminds me of the random, divey country bars I've been to in the Central Valley and the infamous Elkhorn in San Miguel, but that's probably what I love most about this place.  It embraces the divey-ness without being one of those sticky-floored, dingy, crusty dive bars, and that's what makes this place truly great.  If you're in the Sunset and want to have a great drink and a great time to go along with it, check out The Riptide.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Maya L.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1376784000000,
        "ReviewContent": "The place is chill. The live music can bring it up a couple of notches as the performers are always really into it. Go ahead and take the L alllll the way out there...then grab some brothers pizza and chill at the beach. Always a good night",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Chris C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1375056000000,
        "ReviewContent": "This is a crusty joint.  The PBR flows in golden showers amidst rivulets of cheap whiskey, the bartenders have a few miles under their eyes, and the karaoke options include vaguely racist David Bowie songs.*  I can't wait to go back.*I don't condone racism, and the staff is in no way racist, but hearing someone drunkenly belt out \"China Doll\" is a sight to see.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Michael D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1372204800000,
        "ReviewContent": "disappointed. Met with 3 friends & was so excited to see them. Bar was too noisy-(small area) hard to hear people. good thing, bar is pet friendly-saw 2 dogsJane D",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"jane d.\", \"AuthorLocation\": \"Pacifica, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1370908800000,
        "ReviewContent": "Being that I don't really drink - going out to bars has a different appeal for me.If I'm going out to a bar or lounge - I like to make sure it either has great ambiance,  some pretty fabulous people at it, or some  quality live music.The Riptide has all of that.It's one of the most charming and cozy bars in all of San Francisco.It's got a rustic inviting atmosphere - which is so fitting - considering it's right by the breeze of the beach. As you enter and leave you can smell the salt water in the air. Bliss.The Riptide's bartender are unbelievably on top of things.The whole time I was here  - their main lovely bartender made sure that my water was constantly refilled (despite there being a self pour station). Each time he - added fresh wedges of lemon as well. So refreshing! It was open mic night and from the moment I entered - everyone at Riptide was kind. The older Irish gentleman sitting next to me at the bar had such a warm demeanor. He talked lovingly about his grown children. All of Riptide was bubbling with kind-eyed regulars - many of whom were there for the open-mic. Everyone was supportive of all of the musicians and just happy to be out and surrounded by friendly faces. My long walk to the beach was so well rewarded by an epic evening here - full of the nicest and most personable bar regulars and staff around. I can't wait to spend more epic evenings here.Trust.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jessica T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1365984000000,
        "ReviewContent": "This is my local go to bar. Especially Mondays with open mic and $3 Widmer's till midnight. Tuesday are also my fav day to go because the have karaoke it always ends up going till 2am and everyone usually picks some good songs to sing along to:). And Thursdays is lady's night! I really enjoy this bar and it's close to beach!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Amber T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1364688000000,
        "ReviewContent": "went there last night,not enough bar staff,only one serving 300 people,the owner could have sold double the amount of drink if he had 3 bar staff on,there was a 20 minute wait for a drink,prices are high for a dive bar,5 dollars for a steller,,people are friendly,the bar man was friendly,i find the bar women thatr usully works there not friendly,toilets could be cleaned more,theres only 2,so expect a line,its a long way outso not many yuppies go there,quite dark and dingy bar not the cleanest,its a good local bar",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"cc c.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1363910400000,
        "ReviewContent": "My wildly talented SF-based friend told me this was one of the best open mics in town, so on a recent work trip I ducked out for a couple hours, raced across Twin Peaks to the beach and found myself in one of those places that feels like home. Kind, cool, no BS staff signed me up to play and got me on stage for the two song max bonanza that was going down. Everyone who played went whole heartedly all in, something about the fireplace, the piano, the grit, the wide age range, the inclusive blue collar sideways smile of it all... After I played, tough funny Irish men bought me whiskey and told me stories and I didn't want to ever leave.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Risa D.\", \"AuthorLocation\": \"Lac-Sup\\u00e9rieur, Canada\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1361836800000,
        "ReviewContent": "Try living out in the Sunset or Parkside and suddenly you will see how important this bar is.It is better than all the others way out here.  It is.  Really.It is cozy.  It is neighborhoody.  They have some decent beers and it tastes like they clean their lines.   They always have a drink special and not always something you wouldn't want.  They have bands.  They have bingo and all sorts of other game/hang nights. They have a fireplace.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Dizzy L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1361404800000,
        "ReviewContent": "The Riptide is a great Sunset dive bar -  decent delection of micro-brews, friendly bartenders and patrons. Fireplace and projection TV showing sports are  added bonuses. For happy hour they usually have some sort of snanks such as nachos, grilled cheese, or hot dogs for soaking up the booze. Best thing was that there was not a 'hipster' in sight",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sean C.\", \"AuthorLocation\": \"M\\u00e9rida, Mexico\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1357516800000,
        "ReviewContent": "This place has got character.  And I love places with character.  More than once I've mused as to how I could sneak one of those lacquered tables out of this joint!  And did I mention, there's  a deer head on the wall... a deer head!  ha!  Or what, Is is a moose?  Too many beers!  I would recommend going when there's live music.  *Highly recommend.  The bartenders are super cool too!  Cash only, but there's an ATM.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Olivia D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1354752000000,
        "ReviewContent": "Riptide is like how a bar should be. Warm and welcoming with good people around you. The drinks are great! The bartenders know what you want. When you walk into the bar, you feel like you've been around the world. They have soo many beautiful antiques. But I must say that the two things that got me about this bar, was the audio sound in the main room and decor that surround the walls.. If you want to hear good audio sound in a bar, go to the Riptide. There are seats in front of the fireplace. one of my favorite spots!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Veresa R.\", \"AuthorLocation\": \"Daly City, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1354492800000,
        "ReviewContent": "I had a charming Sunday night here, what a little gem! Could not have been happier. Walked in with a friend to live music of cowboys and country (they had a slide guitar, guys!) and enjoyed the performances as the band called various regulars up to sing or song or two each. Some were amazingly good, others less so... but all were entertaining. I really meant to find out the name of the mother/daughter duet duo. They were incredible!The bartenders were on it and the place was soon filled. Bathrooms, your standard o-k bar experience.The crowd was varied and unpretentious, from old cowboys, hipsters, frat guys and the the like. I couldn't believe I was in SF! Will definitely be back.Thanks Riptide!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Kerry D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1350259200000,
        "ReviewContent": "Really liked this bar, it was right next to Ocean beach and had a nice friendly feel to it.They had live music and decor to match to boot. Really felt like a bar you could be a regular at if you were a local. I liked that they had history on the wall, and even had a quote to the effect of, \"welcome to the edge of the western world\" I am a sucker for adventurous type of culture tid bits. Had a couple good conversation, wish they had pirate music.I miss authentic pirate music.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Thanh T.\", \"AuthorLocation\": \"Hayward, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1347667200000,
        "ReviewContent": "I'm not sure if it was because there was no live music that night, but the ambiance was sort of dead.  It was still loud due to the music in the background.  I felt like I was in the south again, which was interesting, but I'm not feeling the bartenders there.  The drinks were fairly cheap though and strong like how I like it.  I will give it another try when there's actually music.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"John H.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1343174400000,
        "ReviewContent": "I really like this small little, home-like place.  I wish they had real food and more people during happy hour.  The regulars seem friendly, but could be more welcoming to newbies.  I haven't been to a music night yet.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Pat Z.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1341792000000,
        "ReviewContent": "This place is great! Right next to NorCal and Pacifica Beach (Linda Mar), this is the local spot to go to enjoy some great food at a very cheap price. The food is great, try their crepes, they are all pretty good. It can be busy at times, but it's worth trying it. The only weird thing about this restaurant is that you make your order at the entrance and then sit yourself.... This is the place I often go after a surf session at Pacifica.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"David L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1341532800000,
        "ReviewContent": "Awesome hole-in-the-wall surfer's bar. I'd recommend cabbing it out here because Muni has been known to go M.I.A. in this part of the Sunset.Live music, bartenders who know what they're doing and don't patronize. Cheap, cheap, cheap beers.The bathrooms are as expected, smelly and full of kegs. This place is great for a casual night of drinking and nobody to impress.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Alyssa G.\", \"AuthorLocation\": \"Seven Fields, PA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1340150400000,
        "ReviewContent": "A cozy, fun little dive bar that really just is what it is. Good drinks, comfy, friendly (in my experience) bartenders. Stop in and enjoy it if you have the chance! But bring cash: no cards and, personally, I don't enjoy paying large ATM fees.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Casey B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1336348800000,
        "ReviewContent": "The bartender is a METS fan.. a plus, also great atmosphere and great shows. The only downer was this fratboy sitting behind me grousing about the band asking for a contribution.. what a jerko.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jason C.\", \"AuthorLocation\": \"Esopus, NY\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1334966400000,
        "ReviewContent": "Came out here with my roomies on a Friday afternoon for a drink and the place was packed.  They were serving free pasta and bread for everyone to have which I thought was really cool. This is a cash place only so make sure you bring enough with you. I would definitely come back and will become a regular. Good music , low key crowd, what a great place to be after a long days of work or a relaxing day at the beach.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Claudine V.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1332806400000,
        "ReviewContent": "unpretentious, cheap, kitschy, fun. i'm comfortable going there by myself where the people are friendly but don't over stay their welcome. i'm usually the only non-irish person there but it's never an issue. all of the bars along taraval seem to have a disproportionate amount of men in them and this one is no different but i feel safer here than at others along this strip. tip: bring some cash. they don't take cards and their atm charges $3.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Janet R.\", \"AuthorLocation\": \"Brooklyn, NY\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1330732800000,
        "ReviewContent": "LOVE! this dive bar... Walked down with my roomies last night for a couple pints-2 stars for the decor- really old random swag, a fireplace, a moose, a plethora of old timey photos and the register straight from the wild west(snowboarding videos projected on a giant screen- nice touch)1 star for the dj- played lots of punk, reggae and funk... and looked like Dante from grandma's boy lol1 star for the service- it was packed but the sole bartender was on top of itVerdict: a badass neighborhood pub with flavor, I'm smitten",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Brittany T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1330128000000,
        "ReviewContent": "Great place. Sunset's very own Cheers. We showed up out of the blue just in time for Bingo on a Saturday night. Then we sat by the fire for an hour and moved so the band could set up. We stopped by for one drink and stayed for 3 hours. Lots of people had pizza from the place next door. Everyone was having such a great time. Loved it.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ann R.\", \"AuthorLocation\": \"Chico, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1329782400000,
        "ReviewContent": "just a great bar with a great laid-back vibe perfect after a long day at the beach",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mark A.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1329523200000,
        "ReviewContent": "Funky divey beach bar. Interior looks like it is rural Michigan. Lots of crusty creepy locals and then on some nights the SF State girls show up and cheer it up a lot. It's usually very entertaining to visit for a short stopover.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"M. O.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1328227200000,
        "ReviewContent": "A really chill bar that has bingo night, pretty funny actually.Its located near the beach and something about this place feels really relaxing. Especially the tables/booth. This place gives me the same comfortable feeling I had when I was just chilling at a bar in Taiwan. Beer and laptop...the only difference is that I can't smoke at Riptide.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"phillip w.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1328054400000,
        "ReviewContent": "Best place to go on a Mon night. Feels like your out of SF. Fireplace, great bartenders, local drunks, friendly people.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"R J.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1327622400000,
        "ReviewContent": "DIY yourself ladies night grilled cheese warrants driving out to 46th street (it's not underwater! The streets DO go that far).Yummy grilled cheese, cheap cheap $3.50 beer, really nice bartender (she said bye to us, and I got confused.. that NEVER happens), and a FIREPLACE. Yay, yay, yay :)Brooke says I should give them 5 stars, but I think she should make her own yelp profile and stop questioning my star giving scale.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Negien M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1326412800000,
        "ReviewContent": "Sometimes when I get out I get WAY out! The Riptide is so close to the beach that you can hear the friggin' Waves!WHOA!THE PLACE HAS SOME AWESOME DJs! the place is small and quaint. the drinks are standard. the dudes are dull, the babes are better than you would think.I have rocked and sexed tin this club and you could too if you knew what you were doing!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Alexander R.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1325635200000,
        "ReviewContent": "Nah' mean, it's a dive bar.  They have beer, drinks, and show Warriors games on the tv.  What else can you ask for?",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"ROB L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1325030400000,
        "ReviewContent": "5 stars for ambiance! I loved this bar even though I went there with an okcupid date who never called me back. But despite that minor shitty detail... I absolutely adored this place! I love being near the beach and this is a perfect spot to grab a beer after a day surfing or staring at the sun. The servers were very nice and the crowd was your typical sunset crowd- mellow and super friendly. I loved that they had a fireplace and big wooden tables. They also have live surf rock and free nachos. And, it is very cozy and nice for a first date I might add. I'll definitely be back with better company!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Megan K.\", \"AuthorLocation\": \"Healdsburg, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1324166400000,
        "ReviewContent": "my favorite bar in the city. almost hate to write a review for it as it to not get \"spoiled\" but its just an awesome local friendly bar.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Hula H.\", \"AuthorLocation\": \"Mountain View, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1323907200000,
        "ReviewContent": "Free chili and  nachos the night I went in on a cold night seeking a martini.  So that was super cool.  The cheese was the whiz kind too so it was so good yet so bad.Tables are all kinds of glazed wood shaped in one area.  Place is right by the beach and it has a fireplace that you can practically sit in.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"D B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1323734400000,
        "ReviewContent": "Asian Persuasian, Caucasian, college girl tempations.. A beer and a half and I'm wasted. Thursday nights are poppin' make sure you're updated. Don't talk to tall whiteys who are sedated, might injure the medulla oblangata. Degraded.Once found a hotty, from Calcutta.Lots of mother lovers, I recall one, I think he's name was Danny Glover.   Rowdy boys spilled one on my sneaker, I gave them a fee waiver.White on white crime outside, entertaining as ever.A man walks into a bar, maybe never.Wild College days are over.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sani S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1322870400000,
        "ReviewContent": "So I've always liked the riptide.... used to go there a lot long ago when I lived in the hood. But damn, the tatted up lady bartender was one of the most unpleasant people I've encountered in the service industry in a long long time... Life's too short, and there are too many good bars in SF, to put up with that.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Dave H.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1321833600000,
        "ReviewContent": "I'm an old lady who went here last night with her boys and their friend.  It was packed.  A jazz quartet was setting up, and we found 1 stool for the old broad (me) and ordered drinks from the calm, efficient bartender, who was holding down the fort all by himself.  Drinks were very strong, well made, properly garnished, delivered with alacrity and a polite nod.  This bartender was so good, all he needed was eye contact to start another round.  There was a big table of boisterous ladies with their dog, folks were dancing to the great band, and much merry was made.  The one sad texter sitting next to me made a number of trips to the bathroom, drank a beer, and left, texting, fairly soon, delivering up another stool.  We spent a happy Sunday night at what I think is the best neighborhood bar I have ever had the pleasure of drinking in; and I've been drinking legally for 42 years.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Diane S.\", \"AuthorLocation\": \"Santa Rosa, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1320364800000,
        "ReviewContent": "I came here the Friday of Halloween weekend with three friends. Let me just say that the last time I was here, it was a Wednesday afternoon and I was one of 6 people in the place. Not so exciting. Fast forward to my last visit: We walk in at midnight--my friend just turned legal--costumes and all. The place was PACKED! So much life and noise! Deeefinitely a different picture than scenario #1. The bartender pulls out a full-page menu of special Halloween drinks, and we get on with business. (Which by the way packed a strong backward punch in me at the end of the night. Strong drinks indeed.)A little while later, we're posted up right at the bar, and everyone's throwing me compliments on my costume and wanting a picture. I'm not trying to gloat/brag/whatever you will, my point is that the crowd here is very friendly, sociable, approachable, amicable, I can keep going...It was a very comfortable alternative to our next night at a gay bar in the Castro where the same costume returned absolutely no compliments or photo requests, only questionable and/or judging looks that l understood only as \"What the eff are YOU?\" (Feel free to sue me for wearing the same thing two nights in a row. It was indeed a superb costume, and I was on a budget.)To sum up, The Riptide is the place to go if you want a fun crowd to surround your entourage, if you need an upbeat place to party solo after a bad breakup/shitty week, and the music is great. Not to mention the drinks are relatively inexpensive. The ATM was giving me some trouble, though, so bring cash before you go on your way.And for those that are wondering, I was Slash.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Maria M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1319587200000,
        "ReviewContent": "Have lived in walking distance to this place for almost 4 years and on ly just started coming.  There are good happy hour specials, pretty friendly folks (some patrons not so much, but whatever), and fun theme nights.  Have been for open mic monday, karaoke tues, and will definitely walk over there for other nights.  Great to know there's a place that cares about a little nightlife in our hood.  It's really the only one, and luckily it's pretty fun!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Rocky S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1318723200000,
        "ReviewContent": "Great place to hangout near the beach!!  Ladies night on thursday is the absolute best! Check it out!!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Katie S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1305590400000,
        "ReviewContent": "I just saw the Cottontails (sp?) last night and really enjoyed myself! The band was so great, I was surprised that they did not charge a cover.  I love the authentic decor of the bar and the variety of patrons. I also really like that the bar is a U-shape so that the bartender can access more customers efficiently. Everyone was friendly and laid-back. Maybe more seating would be nice, but it is a little too small for more. I wish it was my local bar :(",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Riley M.\", \"AuthorLocation\": \"Irvine, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1302307200000,
        "ReviewContent": "As someone else wrote, it has good nights and it has bad nights. The dichotomy causes a tension that has motivated me to write this. Bad nights are when the bar is overcrowded with people barely legal, or when its so full of hipsters acting unwarrantedly elusive that you eat one of the Tides free hotdogs so you dont throw up from laughing. Curt waitresses most of the time. The boys/men are a little better at customer service. The glasses are filthy often: someone else's debri encrusted lip marks on that nice fresh Riptide Red you've been jonesing for all day and now, its sudsess-interuptus. Insanely unwarranted unfriendly pretention is sadly the 'Tides social benchmark, and yet the fireplace, surfer movies, wednesday's 7-11 quality nachos, and the days when there's a free table to write keeps the Riptide in the debate of \"to be or not to be\" in Sunset bars. Hipsters take note: The ironic thing about Irony is that it is self originating, it cannot be artificed. For a friendlier, more down to earth bar, with its own dirty glasses but a beef stew to die for go up the street to 4 Deuces. Just avoid the Irish activity nights if you dont have an accent...their picky about that stuff, and I dont blame them. No pretense except cocky young male stuff.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Vince's S.\", \"AuthorLocation\": \"Chico, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1301788800000,
        "ReviewContent": "Yelp and I have an undecided relationship.  I am in the service industry and it can truly harm a server, bartender or owner of a bar/ restaurant establishment.  I digress.... Myself and 4 of my friends were at Riptide on 3/26/11 for late night drinks we made it just before last call  5beers nice tip though thru the whole process of ordering this petite brunette bartender acted as if we were the biggest inconvenience. We proceed to sit at a table and chat amongst ourselves which would have been much easier if Suzy Happy Pants wasn't hurling bottle after bottle into the recycling bin with such force it was ear piercing.  Last call is given, not even 7 minutes after she is at the table saying drink up let's go and literally grabbed the drink out of one of my friends hand.  Idiot!!! 5 Industry folks that will never go back and live in the hood!! Nobody killed your Damn Puppy!! Oh wait it gets better last night April 2 Gave it another shot heard there was a great band, and yes they were Fantastic!! People are hootin hollering and WHISTLING!! Yes little miss Brunette Bartender if you are reading this you know all about the whistling.  My friend was asked to leave the bar for whistling....??, yes I know my friend occasionally can be a pain in the ass. Tonight was not one of those nights, crowd was happy everyone getting along older crowd etc. etc.  Okay so he leaves does not put up a fight. He took the fall for myself and another woman who were showing a few individuals how we learned to whistle when we were kids.  Okay probably sounds pretty lame but that is the story.  The bouncer was going to pop a vein still talking about this with Suzy Happy Pants.  She makes eye contact with me so I tried to explain that my friend was not to blame and try to tell her the lame story....  Her ever so shitty rude response was well you better give me your drink and get out of the bar as well.  Again, I digress....Dearest Owner,That little bartender should be let go in this case, the biggest gripes from your yelp reviews are service.  Whether you are dive bar in the Sunset or the Ritz our money pays your lease, labor, inventory, insurance etc.  Having a bitchy mean girl such as that in your employ is outlandish.  Remember SF is a big place you never know who you are waiting on.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Amanda W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1301270400000,
        "ReviewContent": "Could be better, could be worse. I've been there on the right night, and I've been there on the wrong night. The wrong night is usually a Friday or Saturday.  Some of the bartenders are awesome and friendly, some of them are rude. I'm glad it's close to home, because there isn't much else to do in this hood at night, but I won't come back to the Sunset for this place once I move downtown.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mez L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1298332800000,
        "ReviewContent": "Cozy little dive.  Open mic night is pretty cool.  Get to hear the locals come in play a couple of songs, each.  Quite entertaining talent shows up, so that's a night worth checking out.  My cocktails were a bit on the diluted side, so next time I go, I'll simply get my whiskey neat.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Damon Z.\", \"AuthorLocation\": \"South San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1298160000000,
        "ReviewContent": "I am conflicted.  I really like Riptide.  I like that its a dive, that they allow dogs, a good juke box, that they have cheap good beer and friendly bartenders.  I really  liked Bingo Saturdays, with a good friendly crowd that was there to chill and play with a beer.  Then I started noticing more and more people coming to Saturday Bingo, and I thought, ok, that's cool, you know, bigger bingo pot, more energy.  Then I noticed that many of the new people were rude, annoying, with drunk ex frat boys and hipsters or hipster wannabes to boot. Honestly, after this last Saturday, I think I'm going to take a break from Riptide. This Saturday reminded me of those annoying bars in the Mission and in the Haight that are super pretentious and where irony is a fashion requirement.  I know that this Saturday crowd swell may be good for the Riptide in the short run  in terms of income, but they could end up loosing some loyal customers who go there to chill, have a beer, and play the occasional game of bingo.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"M A.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1298160000000,
        "ReviewContent": "im partial to cozy dive bars.  i came in this afternoon for a lowkey daytona 500 viewing party.  i ordered a wodka bloody mary, and it was the breakfast of champions!she asked me if i wanted bacon in it.  \"sure!\"i had a lot happening in my pint glass.  the bacon was perfectly rippled and chewy and was nice soaked in the drink.  an olive, gherkin, onion and green bean were staked and good eating.  and of course the celery stalk.  it had a good peppery kick to it too, so i was set!  i ended up rocking out to guns and roses with a bunch of cool people i don't even know.  good times. good times.thanks for reading!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"yayoi s.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1297468800000,
        "ReviewContent": "There was a violent fight here at the bar tonight and I feel that it was handled very poorly.  A guy smashed a beer glass into another guy's face (literally, the guy's face was bleeding all over).  There were tiny shards of glass all over (the floor, the tables, the chairs, my face not to mention).  I asked the bartender for first aid and all they gave me was a wet nap.  I had three small nicks on me from the glass, two of them on my face with a little dot of blood and no means of proper first aid.  Being that I am a calm person I didn't make a big deal out of it but I thought the situation was handled poorly.  Of course I am grateful that all I had was a few tiny nicks, but it could have been a lot worse.  They should hire a bouncer and they should have shut down the bar for the evening.  There were tiny pieces of glass everywhere.  I'm sure they violated a dozen health code rules.  Needless to say, I'm never coming back.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Evie S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1297123200000,
        "ReviewContent": "sailor decor, giant fireplace, across from the cold dreary lovely Pacific. sweet.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"S B.\", \"AuthorLocation\": \"New York, NY\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1296259200000,
        "ReviewContent": "Eh, maybe it was just the experience I had but it seemed like a pretty typical bar. I'll do a review update when I go back with a group, but I went in with my old out of state ID and my new temporary California driver's license and the woman stood there for about 10 minutes contemplating whether to serve me. She finally decided to after asking if I was \"a police officer or member of law enforcement\". I felt a little awkward after that so I just left. One sketched out bartender!Looks like a good dive bar for the area, but I wouldn't go out of my way to be that deep in Outer Sunset at night.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Chris I.\", \"AuthorLocation\": \"Las Vegas, NV\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1294531200000,
        "ReviewContent": "This dive was written up in NYT recently, and I'll admit, upon reading about their Saturday Night Bingo games, this joint sky-rocketed to the top of my list. (I love me some Bingo!) We went on New Year's Day and it was a perfect low-key place to be post-NYE.$5 gets you a 3 Bingo cards and I think they play 3 rounds (we came late.) The give you \"dobbers\" for the last round (Black-Out!) which was fun. Who doesn't love Bingo dobbers!?The fireplace was quaint, and it was dog-friendly - always a plus in my book. The bartenders were very friendly and so was the crowd - which ranged from 20-something hipster girls, to 60 yr surfer-dudes, to drunk old Irish dudes with stone-cold glares. Definitely a local hangout.I wouldn't go out of your way to make this a destination for a wild Saturday night out, but definitely stop by for the Bingo! I'm going back and determined to win the pot!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Lauren W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1292803200000,
        "ReviewContent": "It was open mic night and my friend performed here playing his own renditions of pop songs.  For example, Brittany Spears comes to mind and \"You're the Best Around\" from the Karate Kid.  I had a blast watching my friend but the other people that performed were ridiculously good.  I'm tone deaf and cursed them all as they left the stage.The beer selection was also decent.  I wish they would add Bass so I could get a proper Black and Tan.  They made it with Guiness and Anchor Steam.  Actually, not half bad.I would definitely go back.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ashley I.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1291593600000,
        "ReviewContent": "I've only enjoyed this bar once in the many times i have gone. The one time i did enjoy the bartender was very nice and they had a fun band playing. Other times I've had the bitchiest bartender ever. I went recently and bartender was a super bitch as soon as we walked in the door. Then she made weak drinks for us. I dunno what was up her butt, because we did nothing to piss her off.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Vespa Fox C.\", \"AuthorLocation\": \"Oceanside, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1291420800000,
        "ReviewContent": "This place is okay for your neighborhood dive.And though I thought it was illegal, it's like, a dog-friendly bar too. There were 2 dogs there when I went on a Friday night. They said a lot more hang out during the day.The prices weren't amazing, but not bad. We got two beers and 3 shots of tequila. I'd say we were the hottest chicks in there.The hanging moose and crocodile heads were amusing.The ladies restroom was a Hepatitis-C level of disgusting.Yeah.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Melanie P.\", \"AuthorLocation\": \"Las Vegas, NV\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1290902400000,
        "ReviewContent": "This is an amazing neighborhood dive bar. The inside looks like the bastard love child of a Captain's room on a ship and a surf shop. The bartenders are all friendly, and I have never felt harassed by any of the guys in the place. Overall a very relaxed, fun environment with great music. Note: I like to go on Thursday nights (Ladies Night) for the 1/2 off drinks. However, it seems like the bartenders sort of make up the prices as they go, like they're not really sure how much the drink actually costs. One night I paid $3 for a cocktail, and was charged $5 for the same cocktail a few weeks later. For those of us on a budget, it's kind of annoying when you have to spend more than you expected to. A little consistency would be nice.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Rachel A.\", \"AuthorLocation\": \"San Mateo, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1290556800000,
        "ReviewContent": "This place got me in the New York Times! My roomies and I were there seeing my friend's band play, and check it out: http://www.nytimes.com/slideshow/2010/11/17/travel/20101121-SURFACING-5.html. That's me!I love it here. Great place to stop for a drink after sharking some surfers at sunset. Also, this was the last stop of my fake bachelorette party. My memory from that part of the day is fuzzy, but I'm pretty sure I had a great time.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Caitlin E.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1287360000000,
        "ReviewContent": "It is what it is. Anyone that walks up to the Riptide and marks it as a quaint little tavern, a cool live music venue or somewhere to eat is fooling themselves. It's a dive bar pure and simple. The thing is that its the ONLY dive bar for like 10 blocks in any direction so if you are in the southwest corner of the Sunset it's the best bet.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Nate S.\", \"AuthorLocation\": \"Malden, MA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1286928000000,
        "ReviewContent": "The place is really chill. It didn't get busy until about 11, and that's when the music started getting good, too. My friend and I went on Thursday, Ladies Night, but there was probably 80% guys. The drinks are dirt cheap. I was amazed I got a cranberry vodka for $3 ($1 off for girls) when I was so used to paying up to $9 for those drinks in other places. The bartender, Brian, was EXTREMELY friendly, and I would go back just to say hi to him. He's there every Thursday apparently, so go find him, flirt a little and maybe you'll get free shots of Patron. ;)",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Lisa C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1285891200000,
        "ReviewContent": "What was once a great bar is being taken over by hipsters! I really am not sure what they are doing so far from the mission but I wish they would find their way home and give the bar back the the nieghborhood.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Megan F.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1284163200000,
        "ReviewContent": "Oh, the Riptide. I love this place just as much as I hate it. I've spent many nights here enthralled by the drunken debauchery of the Sunset. It's one of the only bars in the neighborhood with cheap beer and decent music. I used to live down the street so it was easy to access if we decided last minute to head out for drinks. It helps that the L drops you off right in front and a cab ride back home used to be about $5 (if a cab is willing to even pick you up down there). It's a block from the beach so drunken walks to the sand are inevitable. However, I will advise that if you have never been before and you are not in the area don't make the trek over.They have beer specials and my favorite is Thursday night, Ladies Night. That's when all the crazies come out and the place is just packed. Needless to say there are very few ladies on Ladies Night so beware! They also have trivia nights, DJ's and bands playing from time to time. The crowd ranges from young college students, to locals and then really creepy men. I've had a few unfavorable encounters, actually I think everyone I know that has been there has had a few unfavorable encounters.I've come to the conclusion that you already need to be a few drinks in before heading to the Riptide otherwise you are just going to be disappointed. They also have happy hour but the Riptide during the day loses its charm mostly due to the fact that the crowd is tame and you can see the floors. It's a fun local spot and I'm grateful that the Tide has always been there for me on cold, foggy, lonely nights.To sum it up, the Riptide is a local dive bar located deep in the heart of the Sunset; You never know what your gonna get.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Denise S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1283817600000,
        "ReviewContent": "In the middle of the sunset. Awsome Irish bar...with a fire place. Nice place to warm up when it is cold in the sunset. I will be heading back here.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Chuck G.\", \"AuthorLocation\": \"Carmichael, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1281052800000,
        "ReviewContent": "Many a bender has found me here, at least at some point in the bender.  Depressing, I know.  But how fun was it when we found out you could bring dogs, and ran outside and grabbed one?  Or all those times at the beach after?  Or that Velvet Underground experience?  There are many others that aren't worth mentioning until rehab, though.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jon M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1279843200000,
        "ReviewContent": "The bar itself is great--good bartenders, pretty decent space, etc. But as for the crowd... well, imagine if all the popular kids from high school realized one day that they were washed up and decided to trade in their Abercrombie for flannel. Fipsters? Brosters? Brewsters? Basically, bros who have decided to pretend to be hipsters (without giving up their baseball caps or bench-presses) going to hit on girls who walked into Forever 21 looking for anything they could get their hands on with black and white horizontal stripes. Which is fine, but my friend and I felt really out of place. It's okay. Earlier in the evening (like, before 11:15, before it got really crowded) it was actually pretty good. Oh, also, watch out for the creepy older men. Really, it's high school with a creepy faculty.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Chelsea G.\", \"AuthorLocation\": \"New York, NY\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1279238400000,
        "ReviewContent": "A great local bar - please don't let the place turn in to a kennel club.....the doggie conduct gets old fast.  Maybe doggie hours and specials may help keep the pets in order.....just a thought",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Tom O.\", \"AuthorLocation\": \"Auburn, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1278892800000,
        "ReviewContent": "My friends and I have had our fair share of nights at this place, but simply because it was in the neighborhood (as in within walking distance). It's an OK place, with OK drinks, and pretty terrible service. They have live music here, not to my taste but to each their own. I do not generally like to give a bad review, but because the service here has sucked on more than one occasion, I had to voice my opinion. There was a particular time that my friends and I waited for 25 minutes to get the bar tenders attention, actually I should say for her to take our order not because it was crowded or  busy, but because she was talking to a friend. She acknowledged our presence and continued to chat away. When we finally did order the drinks they were not made right. There is no shame in saying \"I am not sure how to make that\", but there is something wrong about serving drinks that don't taste right. If you are coming here for a beer I guess it's an alright neighborhood spot, but for anything else I do not recommend it. We have not been here for a while and have no intention of coming back any time soon.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Yulia K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1278115200000,
        "ReviewContent": "What can anyone say about a bar that pretends, or at least wants to be, a surfer bar but is nothing more that an Irish pub?? This joint has some serious identity issues. DO NOT waste your time!!",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jeff B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1276473600000,
        "ReviewContent": "Decent bar, i wouldn't go out of my way to to here, but theres not a ton of other options in the area.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Michael E.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1276387200000,
        "ReviewContent": "Aside from the proximity of this location to the actual shore, nothing about it said 'Beach Bar' to me as I read the awards on  the wall, boasting that this place was the best.It was a drizzly Sunday night and we found parking right across the street  so it was a quick walk in to listen to The Seducers. I think it was Honky Tonk night. It was fun; people drank and danced. I'd go back if I lived anywhere near the place and/or had a car of my own.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Angela N.\", \"AuthorLocation\": \"Austin, TX\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1274486400000,
        "ReviewContent": "good specialsaverage pricesyounger crowdno pool table:(ok music",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"kiki b.\", \"AuthorLocation\": \"New York, NY\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1272844800000,
        "ReviewContent": "I made the pilgrimage here for the first time last Saturday evening to see Mike Beck & The Bohemian Saints play live. The music was great as was the establishment, beer selection and bar service. The barmaids were fast and attentive and provided friendly service despite how busy the place was. For you Guinness drinkers out there: The bartenders take their time to pour you the perfect pint, a lost art in most places. For those that panned this place in their reviews, I'm wondering if you were in a different bar? The only problem I have is that there isn't a cool place like this in my neck of the woods. I look forward to pouring down a few pints on my next visit.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Wild West R.\", \"AuthorLocation\": \"Roseville, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1272844800000,
        "ReviewContent": "What a great pub!  I was here for a fund raiser for the Save the Waves this past Wednesday night.  Such a great time.  The place was packed and the crowd was great.  It was very chill and laid back.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Susie A.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1272672000000,
        "ReviewContent": "Stopped by after dinner with some friends in the Mission...decided to stop because another friend recommended it.... Definitely a younger crowd...As we walked though the door, we were greeting by a large aluminum tin with the reminants of some sort of appetizers crusted over in the bottom (nasty)...  The place was crowded and the bartender was over worked...  I expected more, but maybe I am spoiled by the Parkside Tavern just up the street.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"B M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1270166400000,
        "ReviewContent": "If you like funky beach bars, this is your place. I have a theory that weirdos always hang out by the beach. Now I mean 'weirdo' in the nicest way possible. It is a solid, laid back atmosphere. Not a pub or a sports bar, but a beach bar. You get all walks of life in here- from beach bums to State students to weirdos like me and my friends.  The 'Tide is a good divey bar with alot of cool crap on the walls and the coldest beer in town. They have a different event every night of the week. The most popular is \"Ladies Night\" on Thursdays. Ask any girl that's been there about the free shot at midnight. Looks spectacular! They also have bingo, surf movie night, and open mic night. Live music acts and DJ's occasionally play as well.I've had many good, drunken times at this bar. Too good of a drunken time more often than not.  Not much more you can ask for. The owner is often there, and works hard to keep it a good place. He is also a great guy, so go up to him and say hello.  Don't go here if you are expecting a douchy marina bar with guys in knit jackets sipping on Cran-tinis. Unless you are a really attractive girl. Then by all means come here.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Kevin M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1269648000000,
        "ReviewContent": "I guess I don't really think about drinking in my neighborhood so it took me years, and I mean years to check out this place.  The bars in the Sunset are usually dives but I guess it's the people that go there that count.  I came here with my surfer friend on a night where they were showing surf footage and raffling off a surfboard.  The place was pretty packed but given how limited they are on space there were about 20 people there.  I don't know if it was a special night or they do this all the time but they brought in food for everyone to share.  How nice. :)Oh, and P.S., we didn't win the surfboard....",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Rosalind S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1268524800000,
        "ReviewContent": "A bar at the end of the world. In fact if the world is ending, this is where I want to be. After a day of exploring the beach, this was a perfect spot. Low key locals sitting around and watching the hockey game. A couple of dogs lazily sleeping the day away in the corner. A beer and a makers for $9. Good times.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"A K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1267747200000,
        "ReviewContent": "I am bias because I live two blocks away and this is the closest bar to my house, but this bar is totally awesome. Drinks are well priced, crowd is super friendly and you never really have to wait longer than 20 mins for a seat. Also, its usually pretty crowded even on weeknights!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"megan f.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1267747200000,
        "ReviewContent": "I love this place.If you're unfortunate enough to be all the way out here, forget about your misfortune in this warm and cozy bar which pours their drinks stiff to keep you there.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Theo R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1267401600000,
        "ReviewContent": "This is a great bar to have a few drinks then step outside and see the sunset, in the Sunset!  Usually really easy to park on street.  The locals are a great mix of folks you'd see in various neighborhoods of SF.  Easy to come in and get a drink and have a good time.  Used to be a dangerous dive, but it has been renovated and cleaned up nicely and is now a great spot to escape from SF and stay in SF!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"David Louis K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1267142400000,
        "ReviewContent": "Cool little hokey spot way out there in the Outer Sunset.  It'll just be packed with locals wearing plaid flannel shirts and blue jeans on any given weekend night.  They seem to be pretty chill, when I went there was a group at a table who straight up just brought a bag of Trader Joes chips, dip, and cookies to snack on while they drank and watched the bluegrass band play.  The decor and ambiance of this place makes you feel like you're in some Alaskan hunter's watering hole.  Totally out of place in a city like SF yet at the same time.. expected.  Pretty standard beers on tap, but hey they had Lagunitas IPA so I was happy.  I was the only Asian guy in the entire bar when I went, so that was new.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"William S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1265068800000,
        "ReviewContent": "Love the Riptide - fun bar and it definitely reflects the folks living out here from the five or so times I've been here (always with a neighborhood local).Jeff (?) the guy who tends bar also runs the place and does a lot to give back to the local community hosting fundraisers for all kinds of groups and is a really nice guy.Definitely a cool bar to support out in the Sunset!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Gene X.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1264291200000,
        "ReviewContent": "great neighborhood bar! dog friendly! the only thing is it opens kinda late not till like 4 oclock.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"steve b.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1264032000000,
        "ReviewContent": "Fun place and bingo was great! Firsttime there and I won the pot woohoo! Cheap beer and drink specials and a good neighborhood bar, will def go again!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jennifer T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1262736000000,
        "ReviewContent": "The decor of this place, the mural on the outside and the moose head on the wall really caught my attention! It is a really nice place, the bartenders are awesome, and the drinks are cheap and good! My only complaint was that this place was crawling with hipsters, which is always a drag, but it's not going to  stop me from coming back to this place.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Melody C.\", \"AuthorLocation\": \"Pacifica, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1262563200000,
        "ReviewContent": "Thanks to the Riptide there is a fun place to go in the Outer Sunset.  Instead of having to venture across town and pay $25 for a cab ride home - you can simply waltz over to this colorful and warm establishment, enjoy some drinks with friends, and walk home.  The bar is right at the center, so you can walk to either side for drinks, and the bartenders are friendly and at your service.  There is a variety of seating, good music, and friendly neighborhood people to make your time more enjoyable.  Not pretentious, very cozy, and oh so Sunset, I think the Riptide is a fabulous place to spend some time with friends.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ashley S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1257984000000,
        "ReviewContent": "Laid back neighborhood bar, with a fireplace. The bartender once gave us marshmallows to roast.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Max D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1257206400000,
        "ReviewContent": "Were they once shut down for serving alcohol to minors?Even though we live in the hood, we drive. Find parking, since it's not a huge problem in the sunset... get to the door.Doorman asks to see my I.D. I show it to him.Get inside, it's a bit crowded for  a Thursday night. By crowded I just mean there is no where to sit my ass down. Patrons sitting at the bar don't seem to understand the five people rubbing against the back of them are REALLY thirsty. No one budges... thanks. Bartender FINALLY acknowledges us but with hesitation...she takes two friends orders. Ten minutes pass, then she takes the remainder of our group (that's only three).Bartender asks to see me I.D. I show it to her.Twenty five minutes later, we all finally have beverages. Parties of two are hogging tables that seat four, so we are still standing. Not a HUGE problemo. Since I'm standing I'll dance a little bit. But what the hell is this song? I can't seem  to find the beat? Music is awkward.My cell phone rings.. I'm gonna go outside to take this call.Stepped outside the door for two minutes and try to come back in.Doorman asks to see my I.D. I....show it to him.Do you see a pattern? This place just keeps rubbing me the wrong way... me and my friends down our drinks and take the night to a whole new level in the mission.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Roya s.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1254960000000,
        "ReviewContent": "This bar is exactly what I want when I go to the Sunset in the afternoon for a beer.  Good service, awesome wooden tables, great juke box, nice staff, clean bathrooms and four friends having a beer at a table.  Only think that would have made it better is the fireplace wasn't on yesterday.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"A K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1254441600000,
        "ReviewContent": "Another cool bar ruined by DJs.OK bar owners, music is great. Music adds to the atmosphere, and I *want* music in my bar. I also go to bars to talk to people. When the music is SO LOUD that I have to YELL to talk to the person I'm with, it ruins the atmosphere. It also makes me take my money elsewhere.Last night (10/1/09) was a *perfect* example.  A guy was playing some really cool music. However, he just kept turning it up louder and louder. About halfway through my first (and only) beer, I decided to move to the side room - but there was a speaker in there too. There wasn't a single place in the bar to escape. This place could be the ultimate neighborhood bar. Now it's just another hipster hangout with overpowering ironic music. Puke.And DJs. Your giant stack of old vinyl records looks all sorts of cool next to the fixie you can't ride, but worn out records *sound like shit*. Mmmmkay? Some of the stuff you were playing last night was so worn out it was unlistenable. If it had been something that was only available on ancient, thrashed records, it *might* have been excusable. What you were playing was good, but it wasn't rare enough to *require* you to play old, shitty, worn out copies of that record. Take some damn pride in your music collection (and by \"pride\" I mean quality of the actual recording). And point the fucking speakers at your head so you have *some* clue as to how loud it is.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Tackett A.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1253491200000,
        "ReviewContent": "This is a legitimate dive bar. No better place to catch a buzz near a fireplace, enjoy some fresh salty air, watch surf or music videos, listen to an open mic, and generally have a good time. The owner is a super chill dude who's usually there when I go. The bartenders are all pretty cool too. Bring your friends, get rowdy, and dance with some ugly chicks.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Richard C.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1250467200000,
        "ReviewContent": "Used to live around the corner. Good neighborhood bar, nice decor for a *dive*. Good live music when they've got it. The fireplace kicks ass in the winter, and on those foggy summer nights when it feels like winter. The bartenders I remember were always cool, used to have an open mic, maybe still, that was pretty good too. I like the bar itself, roundabout, usually down to earth locals in there, surfers, blue collars, salt of the earth, good happy hour.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Boom Z.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1248825600000,
        "ReviewContent": "I have never had a bad time at this place.1. I am going back tonight in order to have another good time2. tie one on 3. make some random friendsall these can be done here without a problemwhy not 5 you ask, because i am not feeling generous",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Trent D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1248307200000,
        "ReviewContent": "This place reminds me of college, when all was right in the world, being sort of broke and drinking every weekend. Or even some weekdays. Whatever.Don't come to the riptide if you want some sort of scene. Come here to drink and be nice. And you can bring your dog. Monday night open mic has the best guy on piano doing Queen songs, you've gotta check him out. I think I tried to flirt with him in front of my boyfriend. Anyway. Love the jukebox, sometimes they'll even load some free tunes for you if you ask. Most of the bartenders are great, you know, relaxed, nice. There's a bitchy girl or two, but I assume they'll leave eventually and get a job at Delfina or something.Although there's been an influx of lame lately (customer-wise), Riptide will always be special to me! Once again, if you're looking for more than a place with beer where you can hang out with your friends, you should probably look elsewhere. If you want a dive bar, you've found it.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"J S.\", \"AuthorLocation\": \"Detroit, MI\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1247529600000,
        "ReviewContent": "Super chill, went here a couple times on a Monday night just to kick it with friends, and there were more people in there then one would assume...but we all know what assuming does...anyways, nice crowd, dogs run amuck, there is a moose head on the wall and open night mic. Definitely a good neighborhood joint, although the bartenders seem to have hearing problems and constantly get drink orders wrong, but they're usually pretty nice so i'll let it slide.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"S. M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1246320000000,
        "ReviewContent": "One of my favourite bars in the city. I knock one star off as one or two of the bartenders are really spacey and the beer selection could be a little more diverse - Chimay or Leffe perhaps? PBR on draft?",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Matt E.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1244246400000,
        "ReviewContent": "Decent in a Cheers way. If you're a single lady looking to meet some hotties, don't come here if you expect them to be fashion-concious. Speaking of dogs, you can bring them here.. but be careful petting other people's dogs because I've noticed on several occasions that even the dogs here aren't so clean; After I pet them, my hand reeked of schtanky dog.. nothing better than your drinking-hand smelling like wet-cheeto-otherpeoples'dog-funk. But relax, they have Nick Cave on their juke box.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sylvia P.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1240963200000,
        "ReviewContent": "Good drinks, good people. Very relaxed cozy atmosphere... bonus in the winter is that they throw wood on the fire. The only down side is there is no outdoor seating... if it had that it would be a 5 star.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"nicole s.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1240185600000,
        "ReviewContent": "Rolled in here after going to the beach and really liked this place. It was sunday night around 7 and they had live old timey music and $2.50 pbr bottles. The bartender was nice, and the crowd was a very cool mix of locals and others.If I lived around here this would be my local place, i'll be back.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Julian M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1240099200000,
        "ReviewContent": "One question: Where were all the mullets and curled mustaches? Perhaps my experience was outside of the norm, where I expected to step into a divey drinking hole from the 1880's...or 1980's. Instead I was generally bored, unsatisfied and surrounded by rude people and not (18,19)80's rude!Luckily, once I got past the woman practically grabbing money out of my wallet to give to the DJ, I settled into some pretty cheap drinks and enjoyed the decor. The 'tenders were pretty cool and it sounds like it may be a better experience on regular weeknights. Especially when you're all the way in the Outer Sunset!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ryan V.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1239840000000,
        "ReviewContent": "I forgot to mention this place has absinthe and they serve this in the most impressive way.   If you are a fan, you really should check it out.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Yasmin E.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1239408000000,
        "ReviewContent": "Wet Wednesday = Surf Movies and free food brought over from Brother's Pizza, which is right next door.Lady's Night Thursdays = $1 off all drinks for girls. I got my PBR for $1.50 last Thursday, which made me pretty amped.Friday's Happy Hour = free home style food and cheap drinks! It's a good place to get drinks, sit by the fireplace, and eat Brother's Pizza. Definitely my favorite bar in the Sunset!!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jamie J.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1237507200000,
        "ReviewContent": "Love this bar. 2 blocks from the beach,  this place is a local surfer/hippie/working guy and gal kinda place. That's MY kinda place. The owner likes bluegrass so they often have a bluegrass bands on the weekends. There's a fireplace, the funnest, silliest BINGO game on Sat nights from about 6-8pm, and one of the bartenders makes one of the best Margaritas in town. This place is just down home fun!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"amy b.\", \"AuthorLocation\": \"Petaluma, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1236556800000,
        "ReviewContent": "Completely amusing for my friend's birthday venue, and a place that you could easily fly solo to - because everyone is in their own world, friendly enough to talk to you if you want, and there's enough weird crap on the walls and ceilings to gawk at.  Locals bring their dogs, the \"DJ\" plays Neil Diamond covers, and the bartenders are nice.  I'm never in this area, but I wouldn't hesitate going again.  Parking is easy!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Maulie D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1236470400000,
        "ReviewContent": "I went here for the first time last Friday and loved the live metal/rocky dj. found the drink prices to be fair.Fun decor.I would totally go back even though it's way the fuck out there",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Lauren V.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1235260800000,
        "ReviewContent": "Solid, divey cheap bar with plenty of parking available near it.  Went here for a birthday party, and had a great time.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Tim G.\", \"AuthorLocation\": \"Larkspur, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1234137600000,
        "ReviewContent": "Friend of mine is a regular here. She insisted we motor from IR to Sunset and back claiming it was so good! Wasn't disappointed when we got there. Fun people. Dogs on leashes running about. Wrap around bar. Regulars getting up all on other regulars. Good times. Until time was up. Two female bartenders, one told the other \"give them a count down and tell them to get the hell out\" we downed those drinks and dashed.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jenny T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1233878400000,
        "ReviewContent": "Friendly staff, cool patrons, cheap drinks, and good tunes.Can't really ask for more.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Ben R.\", \"AuthorLocation\": \"Boulder, CO\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1232668800000,
        "ReviewContent": "a bit on the small side, a lot on the funside.oh... the craziness that goes down in the sunset. One particular time i vividly recall is when out-of-town males took off their shirts and danced their arses off. 1-stall bathrooms are impractical.service is okay.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Peter T.\", \"AuthorLocation\": \"San Diego, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1232496000000,
        "ReviewContent": "Although when I went it was super packed inside and hard to move, I still really liked this bar. The drinks were pretty cheap and the dj was spinning some good tunes.  It's a great little local bar.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sonya D.\", \"AuthorLocation\": \"San Diego, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1231718400000,
        "ReviewContent": "You know that old song \"Brandy\"? It goes, \"Brandy, you're a fine girl, what a good wife you would be. But my life, my lover, my lady is the sea.\" I believe Brandy works here. No reason, I just do. And that song happens to be a guilty pleasure of mine, so that's a plus in my book. The Riptide is a neighborhood bar and seemed to be populated by local Irishmen, surfers, and other men of varying ages and drunkenness. Girls, there's no need to dress up. The other women there definitely don't. There's a fireplace, too, which is cool, even if they do light the fire during Save the Air fire prohibitions.I also like the Riptide because it is the only San Francisco bar I can go to that when I tell people I live in Pacifica, they don't look at me like Pacifica is somewhere just south of Guam. In fact, when my friend said she lives in Potrero, they looked at her like she was the foreigner, you know, bringing gifts from far away, but making it clear she cannot stay . . . no harbor is her home.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Susan S.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1231718400000,
        "ReviewContent": "The Riptide quite divey, in every sense of the word.  For a place way out in the boonies, it is poppin.  And the prices are very reasonable.  And definitely a place for locals to hang out.Lady that came around with the tip boot?  If the jukebox played better music, the boot would be fuller.  Just a note.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jenny L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1231459200000,
        "ReviewContent": "Having lived in the Mission and Lower Haight for the last ten years, I haven't ever been in the situation of my electricity going out and no bar within one block to go to...ever.  Tonight, I came home to a dark block and dark house.  Remembering that the closest bar is the Riptide (and I have never been there), I eagerly went to go have a drink and wait out PG&E.  Plus I've been meaning to try this place out for a year or so, since moving into the much less bar-dense Sunset.  Maybe nice to get drunk less than a $30 cab ride from home once in a while, right? Once inside, I noticed that it is very similar, but smaller, in layout  as the Uptown on 17th and Capp.  Wraparound bar, but smaller main room and no pool table.  There was a dub DJ playing in one corner.  I stood at the bar, trying to decide what I wanted.  The bartender didn't look at me.  Not, she didn't look at me until she was ready for my order; She never looked at me once the 5 minutes I stood at the bar.  Literally in front of her.  I tried to make eye contact.  Nothing.  She wasn't that busy.  I myself am a bartender and am very understanding when it comes to waiting one's turn.  I also hate it when I am obviously busy and some A-hole comes in and thinks that they are the only one waiting.  However there was nothing.  Three of four minutes after I'd been standing at the bar, literally in front of her (no \"hi\" or \"give me a sec\" or \"I'll be right with you\".  Just nothing.  Then a  dude came up to the bar next to me.  \"What are you havin honey,\" she asked, and served him a beer.  Thats cool.  Then another dude comes up to the other side of me and she serves him.  I look at her, she doesn't look at me.  Maybe I smelled bad, I don't know. Suddenly I realized I don't want to be at the Riptide,  and I say F-it and go home.  Screw you riptide, PG&E was done, my lights are on, and I'm not coming back.  So now I am going to have to go on the hunt for a nice, friendly, sunset bar.  Sweet!",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"nicole p.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1231200000000,
        "ReviewContent": "I love this place.  Don't know why, it's nothing and everything all rolled into one.  It isn't a dive, and it's not hip, yet it teases you with both adjectives. You get the surfer crowd, the old irish crowd, the student crowd, and miscellaneous locals.  I've been there on nights with a DJ, live music, open mike, and on quiet nights when it was cold and foggy outside and I cozied up by the fire with a beer and the crossword.  Patrons and barkeeps are always cool/friendly, etc.  I've taken tons of people and everyone leaves saying \"what a cool little bar.\"  Its one of those really-special-nothing-special kinda places--just the kinda place I like.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Shell S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1230681600000,
        "ReviewContent": "Is it kinda creepy to name the bar by the beach where there is a helluva deadly riptide, the same? Maybe a warning, maybe an homage, by the second drink you stop thinking about it. The Riptide has the feel of a locals hangout, with friendly patrons, happy dogs, old cedar furniture accents, and a fireplace. Movie night. DJs some nights. A juke box with a pretty swell variety of cuts. There was a Thursday night about a year ago that included cut up hot dogs in water in a crock pot. Apparently they do free bar food. By 1am it doesn't look too bad with some relish.The bartender didn't know how to make a Mexican Martini (proper noun, not racial slur!), but put together a pretty decent margarita with top shelf tequila on the house when I carried the boot around for the DJ, to encourage tipping. Ah, it felt like home. And reminded me I need to buy some cowboy boots.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Char Z.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1230508800000,
        "ReviewContent": "I was a bit terrified about doing my first open mic night... This place was jumping for a Monday night ( a little more intimidating) but the staff and the crowd of locals could not have been nicer and more encouraging. Simply perfect!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Tiffany M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1230249600000,
        "ReviewContent": "they have a fireplace and were open on the most frickin boring xmas day ever, which turned out a fun xmas night after all, even if a little bizarre in its own way for my own reasons.  a very chill hangout but way far out there by the ocean, which is probably a plus in its favor actually.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Today Y.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1228608000000,
        "ReviewContent": "It's cleaner and more lively than the old Sand Bar and has a good DJ on the weekends. Alas there aren't many other options out here. However, watch your money in this place. In the last two visits,  I had one bartender  shortchange me and another was swiping  / palming any and all money off the bar as a \"tip\" I suppose, including the money I was going to use to buy my next drink. . My money was near the edge of the customer side of the side of the bar next to my drink. The bartender comes by, takes my next drink order, takes away the old glass, swipes my Five and then asks for the money when she delivers the drink.  Twice in a row here...a little bit shady.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sleepy T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1228435200000,
        "ReviewContent": "This place is a great neighborhood bar. Built in 1941 The bar has rustic brick flooring and high ceilings, the original knotty pine walls and a raging fireplace. Strong drinks. Friendly patrons. There is space for a DJ and some dancing. There is a jukebox. The bar is one block away from the Pacific Ocean. Benches galore outside for smokers. Bingo night and other theme nights. I will be back.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Infodiva B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1228435200000,
        "ReviewContent": "cool spot...  chilled out and always a good vibe in there...  sometimes its packed and sometimes its dead...  been there on saturday nights when it was one or the other...  wednesdays are the best though for happy hour and appetizers for a good time!  the dj's are kinda lame from time to time i think but im sure i might be alone in thinking that sometimes...  haha...",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Anthony Z.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1227916800000,
        "ReviewContent": "I haven't been here in a while but I used to live close to the Riptide and I miss the place!  It is by no means anything fancy or amazing but the drinks are cheap and strong so if you are just looking for a low key night in the neighborhood then this is the perfect spot.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jennifer C.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1227657600000,
        "ReviewContent": "I'm not sure if its fair to give the riptide only three stars because I've only been once but too bad, you get three stars.  I feel like people love this place because its one of the few bars out that far.  Its filled with surfers, people who like surfers, people who like the beach and people who don't want to live close to town.  (I feel weird saying \"town\" but there you have it.)  I don't surf, I didn't grow up in a surfing culture and the beach to me is hanging at the Jersey boardwalk so yeah, its not my scene.  HOWEVER, the vibe is friendly and I do enjoy their Beach Chalet beers on tap but its small, reminds me of a bar I would find located next to Mo'Bags in Mt. Olive, New Jersey.  I should note Mo'Bags is in a strip mall.  Its definitely a neighborhood bar which is why it probably gets 3 stars, because its not in my neighborhood and I'm not willing to drive or take public transit down.  I pass too many other places I would rather hang out at.If one does live in the neighborhood I can see the appeal; movies projected up on the wall and free food sometimes.   If you live out there and haven't checked it out, definitely stop by OR if you surf in the area its a must stop.  Otherwise, eh.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Kristin Marie S.\", \"AuthorLocation\": \"Nashville, TN\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1227571200000,
        "ReviewContent": "I went to SF to visit an old roommate and this was the first bar he took us to (after grabbing a burrito at a joint up the street and eating on the beach).  Oh man!  It made me want to move to San Francisco immediately.  If there are bars this awesome, I want to be able to walk to them, or at least take public transportation to them.  The fireplace was warming and a touch that bars back East don't seem to have.  The beers were reasonably priced, the crazy wooden tables were awesome, and the jukebox solid.  I plan on going back to San Francisco and hope this bar will, again, serve me my welcome beer.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Lady T.\", \"AuthorLocation\": \"New Boston, NH\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1227312000000,
        "ReviewContent": "They have a fireplace.. with board games. Battleship anyone? hell yes. This is a great place to hang out with your buddies and down a few beers.  Friendly bartenders.  Went here for a friend's 21st bday and the entire bar got a free shot. love it.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"JD D.\", \"AuthorLocation\": \"Las Vegas, NV\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1226793600000,
        "ReviewContent": "Next stop, the Pacific Ocean. This is literally a great bar at the end of the earth. Surfer vibes, chill music, good drinks, friendly staff and killer DJ's. Check their site and look at the calendar. There is something for everyone. Oh, and they have a working fireplace. Just sayin...",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Russell B.\", \"AuthorLocation\": \"Pacifica, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1226102400000,
        "ReviewContent": "my favorite local bar in the sunset.  i don't know if it is the fireplace or the deer head on the wall, but something about this place makes me feel like i'm back home in the midwest. it also helps that there's something going on (and when i say that, i mean either drink specials or free food) every day. thursdays are ladies nights, and every thursday it seems to magically be some bartender's \"birthday\" and all the ladies in the bar are called up for a free shot. this is definitely a local place, the crowd is chill and dogs are welcome. i can't ask for anything else.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mary Beth D.\", \"AuthorLocation\": \"Henderson, NV\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1223164800000,
        "ReviewContent": "It Takes a Village to get a drink at the riptide. If you are a woman, send your man up to get a drink for you, apparently most of the bartenders don't like other women.The two doppelganger piranhas are incredibly beautiful, but their souls are cold as ice and their mean nature makes them ugly.The bad attitude of these weekend bartenders is tolerable only because there is no where else to go on the outer rim for blocks, and blocks, and blocks.I am boycotting the nights they work, and drinking tall cans with the hobos by the sea--anything is more entertaining than being treated badly for no reason.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"sufi s.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1222819200000,
        "ReviewContent": "Very chill local spot. And, surf movie night on wednesdays...!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Brett K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1221264000000,
        "ReviewContent": "This place is a great low key pub that allows dogs and has a fire place.  The drinks are good, the crowd varies but is usually good and the fire is a great when it's cold and foggy.  There's also the great Brother's Pizza right next door so you can order your pizza, then pop over to the riptide for a pint while you wait.  The L is a half block up, so this is also a great place to go when waiting for the train.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Daniel H.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1221177600000,
        "ReviewContent": "Love this place. Came on a Sunday afternoon and I can't wait to go back. Perfect for just hanging out with friends. I want to be a regular, however, I don't think I'm quite there yet.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Beth T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1219276800000,
        "ReviewContent": "Love the local dives!  nearby and festive...",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"phill h.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1219190400000,
        "ReviewContent": "It is your home away from home. Rip Tide is a nice little pub in the ol'Sunset neighborhood that attracts the locals.  If you are looking for a scene, pick up joint, or something trendy this is not the place.  If you like to roll out in your PJ's and listen to a variety of music with your friends kicking back cheap drinks, then this is the place. Oh, and dogs are welcomed too!  On Wednesdays they show surf movies and sometimes  cool, local surf bands will be playing the sounds of the tropics.  This is an ask no questions type of place. You will not witness any one trying to be cool or profiling like most places in San Francisco. You can be yourself here and interact with real people.  There are loads of seats, fireplace, and tv's.  If you want a low key night and can't find anything to wear this is wear you should be..",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Yanicke W.\", \"AuthorLocation\": \"Honolulu, HI\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1217894400000,
        "ReviewContent": "I dislike this place but the extra star is for the Shaun White look-a-like jumping off of barstools.  All of the guys here were meh and we took off after one drink.  Thank you outer sunset for reminding me why rents are so cheap out here.  There's nothing to do.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"dr S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1215129600000,
        "ReviewContent": "Once again, like places I can sit.  They have an awesome fireplace, they have cool stuff on the walls, and its a few blocks from my house and THE BEACH.They play Surf movies on Wednesday, they have an open mic (which is usually older men, sunset locals... but still good and entertaining).The staff is friendly and they have specials.  Sometimes they do fundraisers for Surflike foundation and it gets PACKED, but it really is a great lil place to get some booze.  And scenic.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Arika E.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1213142400000,
        "ReviewContent": "This place is a great place to knock a few back on a Sunday afternoon.  Or anytime really.  Comfy and hassle free.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jed L.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1212624000000,
        "ReviewContent": "Ah, what can I say about my go-to bar?  Dive, beach, dogs, locals, awesome.  Alisha, Jeff, Joanne, et al, you guys rock.Little known fact: best margaritas in town.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Tony L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1212278400000,
        "ReviewContent": "Here are two things you never wanted to know about me: I am a judgmental bitch from Los Angeles & I cannot drink enough to make ugly people good looking.  Terrible, I know.  The Riptide is a cute neighborhood bar that welcomes good-looking surfers and the neighborhood cows that flock there.  I guess what I am trying to say is that this is not a TENs bar, so feel free to come here and hook up with guys that are better looking than you because they do not know any better.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sabrina C.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1211932800000,
        "ReviewContent": "Cozy little neighborhood bar.  They do a good job having fun here!  Last time I was here, two cops walked in, chatted with a patron for a few minutes, put him in cuffs, and then walked him out to the car and took off.  Huh?!?  I'd expect something like that at the pittsburg or flannahans (not to take anything away from those fine establishments...quite the contrary...it would just add to their rustic charm).  Nice having muni right outside - it's like having a private driver!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Curtis H.\", \"AuthorLocation\": \"Novato, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1210723200000,
        "ReviewContent": "For all those who wish to bask in the glory of the foggy sunset, get yourself a drink at the Riptide and cheers to you!  This place is cozy, decent music overhead and they can make you any drink you like.  Occasional dancing on the bar and some good guest live acts and DJ's. My only question: Does anyone know the guys name with glasses that is always there looking to by someone a drink?... creepy.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Collin S.\", \"AuthorLocation\": \"Chicago, IL\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1209945600000,
        "ReviewContent": "This is easily the best neighborhood bar in Parkside/Outer Parkside.  If you are looking for a fun place way out in the Aves for a couple drinks, this is the place.  If you are looking for a \"scene,\" you should probably not be looking in Parkside.  The live music is always fun, but not always great.  The White Trash Happy Hour is a must do.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Rein G.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1209427200000,
        "ReviewContent": "Great escape from the masses. This bar is always fun and the bartenders could not be nicer. The drinks are cheap too by SF standards. On Sunday they feature live music and there is usually BBQ or hotdogs or something to eat as well. Yay, booze and food.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"James S.\", \"AuthorLocation\": \"Geneva, NY\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1208217600000,
        "ReviewContent": "The Riptide makes you feel like you've left the city, and you almost have! At the end of Taraval street, it's full of surfers, Irish construction workers, ages that run the gamut, including an 80 year old ex-fireman with great stories, and surprisingly enough a lot of native San Franciscans!  The bands tend toward Americana, including bluegrass, country, etc, and did I mention the music is always free? My favorite country band, Red Meat plays occassionally to a packed house. One side of the bar is perfect for watching the band and the other for hanging with your friends at authentic driftwood tables. The decor is funky nautical, of course. Ocean Beach is only a block away and they have a killer 4th of July bar-b-que!  The majority of the bar staff are adorably cute girls who seem to be having a great time. Definitely my favorite dive in the city.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Carolyn T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1207872000000,
        "ReviewContent": "The place is okay! It was dead empty and it took the bartender like 15 minutes to even notice me sitting at the bar! Whatever! For some reason the Stella was like the worst tasting Stella ever!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Elle G.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1207612800000,
        "ReviewContent": "I don't care what anybody says about you Riptide, I love you anyways.Fireplace, dogs, good beer on tap, surf movies on Wednesdays, free food on Wednesdays, near the beach, pizza place next door, live music, super divey... what more could you ask for?",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Chrissy S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1206144000000,
        "ReviewContent": "Stumbled in at 12:30. Ordered two beers, only had six bucks. Went to the ATM, I was overdrawn. Went back, stood in front of the nice cute barkeep sweating awkwardly until B. came back with the cash.10 minutes later, three nice young ladies, including the blonde barkeep we slighted, were dancing on the bar in front of our faces.DJ was on Friday, he was wasted but played a fucking great set. Dirty martinis were delicious. Decor is a riot. See you again soon, R.T.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Chris R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1204675200000,
        "ReviewContent": "If you live in the area it's nice.. not too expensive and typically a good crowd on weekends.  Some nights are crowded, they do have a DJ and live bands.  I saw a band with an electric accordina there, that was sweet.  Ill give them credit for trying they have posters up in the sunset talking about all the events they are doing.Just not my scene, you cant dance, very loud and a weird set up.But check it out",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Megan L.\", \"AuthorLocation\": \"West Sacramento, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1203984000000,
        "ReviewContent": "It's a pretty small place and it is out in the boonies ... but it's also super chill and relaxed.  This is perhaps one of the only non-old-chinese-people places in the sunset and thank goodness for that.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Raz R.\", \"AuthorLocation\": \"La Canada Flintridge, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1203984000000,
        "ReviewContent": "I spent quite some time in Nevada City at one point in time (because of love, not because of insanity). The Riptide reminds me EXACTLY of a bar I have been to several times in Nevada City. This is good for me (memories) and bad for an SF establishment (mullets). Still, a good blue-collar time can be had by all. There are lots of boys in their 20s here. If you like boys in their 20s, this is a good place to cruise. Cougars, take note.There's live music. At least there was live music the night I was there. And after a few PBRs, you can dance around like a freak fool and no one will care at all. The location means you should probably drive but the alcohol component means you should probably walk or take MUNI. Which explains who all of these strange people are. They're beach people. And beach people are a whole other breed.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Autumn K.\", \"AuthorLocation\": \"Helsinki, Finland\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1203379200000,
        "ReviewContent": "The Riptide rules!I actually heard some good vocalist on open mic night.  I love the live music on the weekends.  Who doesn't love ladies night.   If you live in the outer sunset and you and you can't handle the trek to the mission or lower haight then I say the Riptide is the place to be.I love the moose head and the wood cut tables too.  It's almost like you're in a club house.  It reminds me of a bar that I would find in a small town, so It brings me back and makes me feel at home.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"amanda v.\", \"AuthorLocation\": \"Denver, CO\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1203033600000,
        "ReviewContent": "Walking into this place at almost midnight on a wednesday with 6 girls definitely got us some attention...a chill crowd, everyone was pretty friendly, even though I think some of them left because we were rowdy. Jeff the bartender was super sweet and gave me a free beer for my bday!  his other drinks were strong and the red-headed-slut was fantastic. he was even a gentleman when our drunk as a skunk friend hit the table and knocked over 5 glasses which he had to clean up, despite our attempts to do so. then he was even more gentleman-ly when i accidentally knocked a glass out of my friends hand (i still think it was partly his fault..) thanks jeff!! wet wednesdays were cool, old surf movies and a fireplace, plus a piano, dj, and plenty of boardgames. and clean bathrooms!! high five. ill def be back :)",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Sarah C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1202342400000,
        "ReviewContent": "Slow night on a weekend night....I'm not sure if I like or dislike their strange indoor layout of almost two rooms...Bartenders were not very nice, nor friendly...Liked the name, wish it lived up to the beach-bum-name though...",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Fannie S.\", \"AuthorLocation\": \"Pensacola, FL\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1201996800000,
        "ReviewContent": "The first time I heard someone playing an electric ukulele I did not think I would find myself in the midst of one a second time... by choice or chance. It is just not the sort of instrument that should be played out of its traditional form, which does not include wires or plugs. I certainly did not think I would find myself in the midst of one at a bar that I fondly remember as the Sand Bar, a drug den and downtrodden stomping ground settled on the edge of civilization in the Sunset. However, this is no longer the Sand Bar. It is now the Riptide and instead of witnessing a deal going down or a brawl ready to erupt by the fireplace tucked in the back you have to stand back a bit and listen to someone bastardize music in a venue much too small for even a good musician to play. The decor has cleaned up since the days of the Sand Bar as has the clientele. The drinks are a fair price and the service is efficient. The majority of the drinkers here look to be a nice mix of semi-wholesome boozers who come here because there really isn't anything else around. I wonder what happened to the shady characters who used to come here.....I would pay them double the price of whatever they were slinging to take care of the guy with the uke.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Drue C.\", \"AuthorLocation\": \"Seattle, WA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1201996800000,
        "ReviewContent": "Although I don't get out to the Riptide as often as I would like, each time I've gone there I've had a great time. Whether just chilling, watching a sporting event on tv while sipping some vino or listening to live music and chatting with fellow patrons, it's always a relaxing and friendly atmosphere. The bartenders are fabulous and the only possible negative about the Riptide is that I wish they opened earlier on weekends.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Richard B.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1201910400000,
        "ReviewContent": "The Riptide is a delightful neighborhood bar that can provide some real surprises. Not only a friendly place to drink a beer (or a few) but I've seen Kitten on the Keys and the Hot Pink Feathers dance on the bar!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Bruce S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1200700800000,
        "ReviewContent": "One of the best neighborhood bars in the City and with a pretty cool name. It's a stone's throw from Ocean Beach and its laidback vibe like, totally matches the lazy-ass surf. Maybe it's the beach's proximity, but it just seems like everyone's in a good mood and I even noticed strangers striking up conversations with each other. You're as likely to run into a surfer as you are to spot a dog or two up in here and sometimes the quadrapeds are fun to have around. The fireplace at the back makes for an even more inviting atmosphere. The jukebox plays everything from Aretha to Bo Diddly to The Clash.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Chris C.\", \"AuthorLocation\": \"Daly City, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1200614400000,
        "ReviewContent": "My boyfriend took me here on our first date. When I first walked in, I noticed that I was a little over dressed by wearing skinny jeans and high heels. (The next time I knew I had to wear tenny's and a sweatshirt)Luckily we were early and found seats. BC by 10 it was packed.I recommend the Riptide Red for the low cost and tasty taste.We go there all the time, just to grab a drink and relax.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Danielle C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1199923200000,
        "ReviewContent": "Great neighborhood bar!!!  They have a fireplace, show old movies from time to time, and provide locals with a relaxing, warm, and friendly environment to sit back and have a drink.Get to the riptide this instance!!!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Charles B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1199491200000,
        "ReviewContent": "At Taraval and 47th, The Riptide is about as physically isolated from the rest of the city as a bar can be, but it also stands alone in a figurative sense.  Maybe it's the crowd of friendly surfer dudes (and the girls who love them) and Orange County expatriates; maybe it's the mounted moose head and alligator skull, or the polished driftwood tables; whatever the reason, this bar made me feel eerily far from home, like I had walked in on something intimate and secret.I like that they have a fireplace, cool DJs (who happened to be spinning some sweet new wave and post-punk when I visited), and a few beers you're not likely to find anywhere else.  Surf movie Wednesdays and free live shows will definitely warrant at least a few return visits.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Karin H.\", \"AuthorLocation\": \"Fresno, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1199232000000,
        "ReviewContent": "This might be the coolest bar in the city (Shhhhh!!! don't tell anyone i said that) Once inside you could be in the midwest for all you know. taxidermy (moosehead that was drooling mistletoe for the holidays), good music, cozy fireplace, cute surfer boys, friendly bartenders (free drink on my birthday). first time i went here i definitely got looks like i was from outta town. i like that.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Isabel C.\", \"AuthorLocation\": \"CA, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1199145600000,
        "ReviewContent": "I really like the Riptide.1. I can walk there2. My dog is perfectly welcome inside3. The bartenders are super nice and never let my drink stay empty very long.4. Have a cool fireplace5. They play surf videos on Weds. and they are usually pretty cool and somewhat obscure videos.It is very easy to drink more than you originally anticipated at the Riptide.  Not sure why.  For my number reasons above this can turn an otherwise harmless dog walk into a much grander endeavor.  Fortunately for me my dog is strong enough to carry me and smart enough to know how to get home.  So no matter what happens after my 17th cocktail I know I will arrive safe and sound. If you are in the neighbor hood check them out.  It is the best watering hole I have found in the Outer Sunset.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Chris A.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1199145600000,
        "ReviewContent": "My favorite time to visit the Riptide is when the fireplace is lit and the bar isn't jammed to the gills with people. I know that they have live music, but I try to be out by the time that starts up - a bar that size doesn't lend itself to a lot of amplified sound. The bartenders are friendly and the patrons tend to be regulars and neighborhood folks. It's a basic neighborhood tavern, and I mean that in the best way.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"laila p.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1198972800000,
        "ReviewContent": "Jerry convinced me to write a review of the Rip Tide.  I think of it as the rowdy cousin of the Beach Chalet.  Live music (not every night - call in advance), some dancing (by the bold only).  Generally a lively crowd - a nice mix of neighborhood sorts and wiseacres, no hipsters.  Generous pours, very friendly bartenders.  It has character and style, and is very welcoming, unlike some of the other Sunset/Parkside haunts where the established denizens make newcomers feel like lepers.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Joanie F.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1198022400000,
        "ReviewContent": "A dive bar if ever I've seen one with a very nice and cozy fireplace.  I hope the mounted moose head isn't real, but the mounted alligator or crocodile head is just too amusing to fret over!  Shots are $7... and they were huge (\"Christmas special\" said the barkeep).  There's a jukebox, a set of backgammon, Candyland, Connect Four, and a piano that I hope gets played every so often.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Caroline O.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1197936000000,
        "ReviewContent": "Best bet: Go on a \"live music\" night. Great country and bluegrass bands, fun party crowd (crazy locals, tourists, hippies, young and old). Some folks squeeze up by the band and dance.  www.riptidesf.comCheap drinks, very friendly staff.  It is a small, rustic dive bar that gets pretty packed and cozy by 10pm on a music night. If you plan on hanging for most of the night, get there early and grab one of the few tables against the wall. Pizza place next door has HUGE calzones. Stop there first then hit the Riptide.    I'm in a local band and this is my favorite place to play.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Chris S.\", \"AuthorLocation\": \"San Ramon, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1196812800000,
        "ReviewContent": "Enough ambiance, funky mix of folks from all over the place, cute chicks and young guys to ogle and be ogled - and a killer long island iced  tea.  Also, indian food/? pizza place next door.   And I thought Outer Sunset don't got no class.!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Illiena V.\", \"AuthorLocation\": \"Antioch, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1195603200000,
        "ReviewContent": "this is my favorite bar in the city.  why do you go to a bar?  to hang with your friends, meet cool people and drink (maybe even get drunk).  this is what happens at the Ripper.  Ive been there probably 4 dozen times and every time, all that stuff happens for me.  wierd! but prepare to be around some wasted people.  and i mean wasted.  people come here to drink. no messin around.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"jefferson h.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1194393600000,
        "ReviewContent": "Great place with the best bartenders. Public transpo accessible. Decent parking and just a block from the beach. Very dog friendly. Surf movies shown every once in a while. Great special drinks. My fave...the Finger Bang! Now this is based on my taste but Bluegrass night and country western nights are just terrible. Unfortunately this usually happens on the weekends so I usually just go on the weekdays. Met some very cool people there and a decent pizza joint next door and the Bashful Bull across the street.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Rocky S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1194048000000,
        "ReviewContent": "Rules. When is the next free oyster extravaganza?",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jonny A.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1193875200000,
        "ReviewContent": "Riptide alongside Brother's Pizza is in the running for the greatest places I visited in San Francisco. This bar, clearly a hangout for local yokels and young dive bar trawlers alike made me feel right at home from the second I stepped in.The tattooed lady running the bar greeted us as we walked in and although it was crowded it made me feel like a welcome friend even though I'd never beent here before. We eventually sidled up to the bar and got our drink orders in and when I handed her my credit card she quickly replied with \"You're from LA, huh?\" Apparently they don't take credit cards and the LA kids who come up for a visit always slap down the plastic when it comes to gettin plastered. Luckily I had cash on me because I was vacationing and we were shocked when our cocktail and beer added up to a grand total of 12 bucks. That's unheard of in LA!We continued our drinking by ordering up a couple carbombs which were the best value of the trip at $10 for both. Sweet. The locals chatted with us and gave us great suggestions for what to do while we were in town and really made our first night in San Francisco pretty great.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Gregg F.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1193184000000,
        "ReviewContent": "Just recently moved to the neighborhood and on a Saturday night thought I'd trot down there for a drink with my boyfriend and best friend.  We got there around 11 and inside is much nicer than the outside.  Decor seemed pretty cool inside...For my first time there it was NOT a great experience because as I was standing by the bar next to two guys (seemed like they were on date) one of the guys puked and barely contained the barf spewing through his hands! It was pretty nasty!  I moved away from that spot pronto !!!!  My boyfriend brought me my drink and we moved to the other side of the bar and sat at one of tables.  I may have to go back since my first time was not that great!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jade B.\", \"AuthorLocation\": \"Pacifica, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1192579200000,
        "ReviewContent": "Holy crap, an open mic night that was GOOD!Now, I dont have anything against the concept of open mic.  God knows you'd never get me in front of a room full of strangers performing.  So I admire the courage it takes to get up there.  But...usually I just end up tuning out open mic nights in favor of drinking...anything.  Except I was lucky enough to stumble into the Riptide one night when we decided we would go carousing around the lovely dive bars of Parkside and the outer Sunset (on a Monday!  oh yeaahhh!).  And you know what?  There were some awesome people performing.  And there were doggies in the bar!  That was a plus.  Every night is themed differently so I'm going to have to go back and check out bluegrass night.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Leslie R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1192492800000,
        "ReviewContent": "One of the deciding factors for moving to the outer Sunset is the proximity of my new abode to this great bar. On any given night you will run into: your contractor, your grandpa, your old surf buddy/bandmate, that hot girl you're always trying to impress and yes, your dog. They'll all buy you drinks...except your dog (he's a stingy little guy) and the girl (she's not into you dude). There will likely be DJs or a band or movies playing and there will probably be some sort of cheap communal grub available.What I want to know is. Why is it 9 blocks there and 15 back home?",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mike Z.\", \"AuthorLocation\": \"San Bruno, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1192492800000,
        "ReviewContent": "Lately i've been doing a lot of thinking about life- and where i'm going, specifically, what type of old dude i'm going to be. The scienterifically executed polled consensus from my friend's seems to be i'll be that dirty old grandpa i'd thought i'd be. So with that in mind, its time for me to start  \"dating\" dive bars, looking for that one for me to call home and bring that old crotchety saltiness we all know and love from \"that old guy\" in the corner. What does that have to do with the Riptide? Read on.This place has got everything you'd want from a dive bar, and freakin' more! Good beers, wood panelling, distressed everything- and even some dogs running around. Awesome! Monday was open mike night and i've got to say, it was by far the best i've ever been to in the city- with everything from bluegrass to boogie woogie piano (!). The crowd was pretty freakin' cool too- hipsters mixed in with other regulars and everyone was getting along (could be the strong drinks). yah- apparently there are hipsters in the outer sunset- who knew. Probably a result of some porkbarrel diversity program spending that requires hipsters to be bussed out from Zeitgeist and Casanovas to other, less skinny-jeans wearing neighborhoods (read: outer sunset)I think I may have found a dive bar/future home of Tim V winner..... time to start getting old, who's gonna help me with being crotchety? Line forms on the left.....",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Tim V.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1190678400000,
        "ReviewContent": "The Riptide is a pretty fun bar, but I am not \"allowed\" to go because it is my husband's \"club\", where he goes free of ball & chain to get his drink on. Just to keep things lively, I occasionally do go to the \"club\", drag him out by the hair, berating him at the top of my lungs for drinking up the family's meal money and falling in arrears with support payments for his other kids. That's always a crowd pleaser!*******************(all of the above is untrue except that the Riptide IS a pretty fun bar, and the MIster prefers to drink with his BFF w/out the company of his wife.)It is a relaxed enough place that if I did drag him out by the short & curlies it would hardly raise an eyebrow. 5 stars.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Gwynnie P.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1190505600000,
        "ReviewContent": "What would I do if I was lucky enough to be out at Ocean Beach during an actual sunset?  Watch it from the Cliff House?  Watch it from the Beach Chalet?  Nah.  I'd stay on the beach and watch it, then walk over to Riptide for a beer.  For a city surrounded by water, we have precious few bars where you can actually smell the sea.  Throw in the wooden ship wheel decor, the neat double-sided bar, the trashy drink specials posted on the wall, the Beach Chalet's very own Riptide Red on tap, and a live band with harmonica that gets the place surprisingly packed with a lively but laid-back crowd from who-knows-where, and we might just have a winner in my search for a local bar (never mind that this is technically farther from my house than most places in the Mission--it's (extremely) west side and that's what counts).",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Wes M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1189036800000,
        "ReviewContent": "It may be way the heck out there, but it's worth it. My boyfriend and I have met many great people there, the bartenders are all great and the free bluegrass/ old country live music has been awesome. The huge Schlitz globe and taxidermy remind me of home, while the surfboard on the wall reminds me that I'm not in Wisconsin anymore.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Megan S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1184716800000,
        "ReviewContent": "I love this bar.  They have an amazing selection of music on the jukebox, good bartenders, a fireplace, live music and white trash snacks.  My favorite part is that my dog is welcome here (but don't tell).  As far as I'm concerned, this bar and the Shannon Arms are the only good bars in my hood.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jennifer R.\", \"AuthorLocation\": \"Penn Valley, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1184284800000,
        "ReviewContent": "Everything a neighborhood bar should be!  All that and a real fire place.  I love this place.  I wish I lived nearby so I could visit more often.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mookie M.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1184284800000,
        "ReviewContent": "I live two blocks away, and it's a shame I don't end up there more often.  Get to know your bartenders -- and they will serve you well.  Always quick and attentive service, no matter how big the order is! They have bands play there, they throw themed BBQs, usually have a DJ and a fireplace going, and when all else fails, a jukebox with a good selection.  Always a hoot! Crowd is anywhere from Rockabilly and Punk kids to Rednecks (where do they come out of?) and plenty of Irish.  Definitely a local hangout with a very warm vibe if you get into it.Fridays are the best.  So is the Moosehead that periodically smokes Parliaments.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Vicky B.\", \"AuthorLocation\": \"Chicago, IL\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1184025600000,
        "ReviewContent": "This bar is over by my buddy Justin's house...only reason I've been out here...cause it's way the hell out there in the Sunset...but the few times that he can talk me to going out there, this is where we usually go, since it's only a few blocks from his house....As for the bar...I guess it's pretty cool...the people in there seem nice enough, no tools, stupid girls, stuff like that, at least from my experience...Minus 1 star because there is no Newcastle on tap, or even bottled, which always saddens me...but still, a pretty kick back bar for when you're out in the cuts of the Sunset",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Matthew S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1182643200000,
        "ReviewContent": "The first time I came to The Riptide was a few days after it first opened and I liked the relaxed, kick back atmosphere there.  After revisiting a few weeks ago, it's still relaxed and kick back, but no longer the type of place that I would go on a Friday/Saturday night to have a few.  I'm not sure if it's the clientele or what, but something about it is just amiss.  I can't describe what it is - it's just a feeling.  Although it's my closest local bar, I think I'd rather make a trip out to Yancy's for a drink (or ten).",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Allan H.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1182124800000,
        "ReviewContent": "Its dark and gross and dirty. But Im OK with that. They have a bunch of great beers including the riptide red, which I really like. The only thing I dont like about the riptide, is that sometimes my roommate goes there to troll for wang , and she brings home some real social undesirables.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Justin M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1180656000000,
        "ReviewContent": "Ahhhh the old Sand Bar! I used to love this place. I spent a lot of time here between 1999-2002. They had great bartenders and a great local following, young, old and hella old. The Mermen used to play/practice there on Sunday nights. It will always have a deeply special place in my heart and liver!Then it closed down....I went back when it re-opened only to find that the charm and the locals were gone. In fact some of the locals were asked not to come back. Not cool.They must of been cutting onions in the back because my eyes began tearing up. I guess I just miss the true 'Edge of the Western World' vibe this place once had.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Alex H.\", \"AuthorLocation\": \"Sebastopol, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1180483200000,
        "ReviewContent": "I cant believe i lived out here in \"the sticks\" all this time and didn't make it here til recently...since then i'm attempting to make up with two visits in two weeks. The BBQ on Memorial Sunday was probably spectacular, but i was fashionably late and missed it but for some limp meat on a rickety table hovering all lonely looking by the bar. I'm sure that band was great too. Anyhow, me n me mates had a few beers, pissed off a couple of locals trying to pick us up, and lived up to our usual trick of being the last to leave. rah.all in all a fun time, loadsa single-looking surfer type vaguely punkish guys.10 out of 10 for the 'hood, cos frankly, there's fuck all else to do out here!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"tigipop ..\", \"AuthorLocation\": \"Corte Madera, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1180137600000,
        "ReviewContent": "Great dive bar!  I live about 20 blocks away and it's a great place to have a drink.  They're one of the most affordable bars in the area.  They have live music, open mic, and surfer movie night.  If you're near the beach it's a great place to stop in and have a Riptide Red Ale.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Selina B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1180137600000,
        "ReviewContent": "They've got one surfboard hanging on the wall, so I guess the name kind of fits. But it really seemed like it should have the word Lodge somewhere in the name, with the dead animal on the wall and the fireplace, etc. They've got beer and liquor along with an interesting cast of characters lining the bar...",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Nicolas H.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1180051200000,
        "ReviewContent": "The only redeeming quality this place has is the fireplace, which usually drunk 40 year olds are squawking around. Trashy bars in the Sunset are like aids in Africa. Rampant and full of flies.Sticky awkward tree tables and untrusty bathroom doors. I've walked in on many a huddled over drunk girl, trying to cover up her giblets. The only comfort drunk food they have are old Doritos. Weak.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Serene L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1177372800000,
        "ReviewContent": "This place is really fun, cheap drinks, good music, nice people.  Go here, get drunk, have fun :)",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Tara B.\", \"AuthorLocation\": \"Huntington Beach, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1174953600000,
        "ReviewContent": "*******************************UPDATE*************************I was just informed *get this* that the owner of The Ridetide actually IS from Oklahoma! What an amazing coincidence! I was also informed by a member of the band that play the night I was there, the song about Jesus is actually making fun of born again christians. Even better! I must have missed the sarcasm in the singer's voice. I think I must give this Riptide another visit.******************************************************************This bar is WAY the heck out there... but it's still in the San Francisco city limits, right? Cuz from the look and sound of this place, I think I'm back in Oklahoma:1) There is a live country band. 2) The country band dedicated a song to all the \"born-again Christians\" in the crowd.3) The chorus from that song goes: \"Me and my best friend, Jesus.\"4) There is a dead mammal hanging on the wall.However, I must say that the beer selection is much better than most Oklahoma bars. The Riptide also had plenty of tequila. I mean, with that country music playing,... what am I supposed to do? WHAT WOULD MY BEST FRIEND JESUS DO?",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Kathryn T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1172966400000,
        "ReviewContent": "a friend that lives out here asked my wife and i out here for some beers and live music. we thought what the hell and went. i wish we would go here a little more often. riptide reminds me of san diego beach bars. riptide's people remind me of the surfer and flannel wearing beach dudes and gals. no hipster attitude (when is that going to die?) i like the live music and from the jukebox. good times and crowd way out there.strange how it is way out there and only be 3 or so miles from home. here in san francisco if you have to go 3 or 4 miles it can take a half hour maybe 45 minutes to get there. in san diego we didn't think twice about taking the car to the bar and twice as far and get there in minutes. long ago that is we don't drink and drive anymore. this is why we mostly stick to our mission 'hood and do our drinking there. anyway i like the riptide and will visit again soon.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"roger b.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1172707200000,
        "ReviewContent": "Before I got married and my now husband lived around the corner form this bar, it was our usual spot.  The DJ on Fridays is the best.  Any DJ that has \"Waiting Room\" by Fugazi on rotation has got to be cool.  The Bluegrass bands kick ass also.  I'll keep on coming here, but I'm sure going to miss the 2 min drunken walk home...",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jessica H.\", \"AuthorLocation\": \"Pacifica, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1172448000000,
        "ReviewContent": "I went here on a random Tuesday night and the place was very empty, which was the kind of place i was looking for. Needed some Fresh air, a few brews, and a heart to heart conversation with a ex co-worker letting out each others grievances on how our old job sucked and how our new ones are better.Don't know how busy this place gets during the weekends but will try it out sometime... Oh by the way any bar that leaves a KEG of Anchor Steam lying around the sea breeze smelling bathroom deserves 4 stars. So 4 stars to you Riptide.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jose S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1171929600000,
        "ReviewContent": "I miss living across the street from this bar. When I lived there it was the sandbar and it was \"on the edge of the western world\". Nothing could be better. It has definitely upgraded in the years since I've moved away from the beach. The fireplace is a nice touch and the smell of the ocean air as you step outside is the best. I need to get back down there stat!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Erin O.\", \"AuthorLocation\": \"Newark, NJ\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1171670400000,
        "ReviewContent": "I can now proudly say I have danced on top of a bar. When the (sweet Alicia) bartender whisked me up during the DJ's offering of  \"Rio\" - I felt as if I could fall backwards into the lively crowd of 80's fans and be body bounced about ever so gently. Somehow I stayed on the bar, \"dancing on the sand\" with Durran Durran. A girlfriend had previously turned me onto the \"skinny bitch\" - Vodka and Diet Coke. This was my drink of choice in which I found pleasure in ordering and hearing myself do so. So, I ordered a few rounds for friends who then became hooked on the strangely good concoction.I was at the Riptide back in November of '04 - the day it \"snowed\" in San Francisco.  As a Michigan native, I found it funny to hear the \"hail\" called snow, but made no effort to correct people who so clearly were beyond thrilled. Anyhow - a photo of this day hangs on the wall at this bar, reminding me how long I have been boozing it up at this fun little quirky outer sunset neighborhood spot. Monday's are great for open mic., Friday's there is usually a great 80's style DJ - michael. And, Saturday's really good live music. Check out the calendar online for more details as they also have happy hours and other events.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Taylor E.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1168992000000,
        "ReviewContent": "Stiff, reasonably priced drinks, coupled with wood paneling, a giant brick fireplace, and those indearing old-timers that remind you not to drink so much, the riptide is one of those great, dive-y (but not too much) neighborhood bars.  Expect Rock & Roll on the jukebox, mostly metal or punk, but occasionally the obligatory Johnny Cash, and eccletic music acts on the weekends. The regulars are friendly, as is the staff, and they've got a good selection of beers on tap for a small bar. Not the place to go if you want neon lights and thumping house music.Oh, and the bar is cash only, but they've got an atm in the corner.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Roachie D.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1168300800000,
        "ReviewContent": "man i remember the sandbar. when i had my fill of all things asian up taraval, id hit up sandbar. one drunken night, i was stammering around, went outside for a smoke and looked up. wtf, this isnt sandbar. i was all trippin. holy shit, am i THAT drunk i thought i was at sandbar the whole time, but this place is called riptide?(insert usual drunken screaming \"HOOOOOOOOLY SHIIIIIIIIIIT IM FUUUUUUUUUUUUUCCKED UP. HAHAHAHHAHAHAH oohohoh AHHAHAHHAHAHHA  i thought this was sandbar the whole time, but its not. HAHAHHAHAHAHA\" )cool dive bar at the end of taraval. makes the pizza next door taste good.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Euge L.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1165708800000,
        "ReviewContent": "If you're not a regular here you know it right away. Despite that, the staff is very nice, and the atmosphere is cozy. The jukebox is so good I want to hug it. Open mic nights on Mondays, free food on Fridays, random bands throughout the week, all in the Sunset. What more could you want? Oh yea, clean bathrooms. They have those too.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Rachel B.\", \"AuthorLocation\": \"Hayward, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1165449600000,
        "ReviewContent": "Somebody took a dirty, scary little bar in the outer-sunset (the Sand Bar) and turned it into a cozy, fun place to hang out with the locals. Nice.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Alf W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1157500800000,
        "ReviewContent": "I miss the original sign that hung outside of a black spray painted shark and the words, \"The Riptide\" sloppily written! Even though it has been replaced with the oh-so fancy neon sign I'd still hang out and drink there! It's one of my favorite neighborhood bars where you can watch surf videos or Napoleon Dynamite while some random musicians perform for open mic night! Bartenders are always friendly and don't skimp on the booze in your cocktail! Also, you can listen to a great selection of music on the jukebox - you mean I can hear Danzig and Al Green back to back? The bonus - longshoremen hang out there too! Well grizzly looking guys who seemed to have been hanging at the docks all day!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Alexis D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1151280000000,
        "ReviewContent": "I mourned the passing of The Sand Bar when it changed hands and closed for renovation.  When it was reborn as The Riptide, I approached the front door fearing the worst...that of a tragic remodel involving sheet-rock walls, cheesy neon lamps, and a tolling of the bell for yet another neighborhood watering hole.\r Thankfully, The Riptide's new owners didn't ruin the place.  To the contrary, they've performed the delicate balancing act of cleaning up a decomposing neighborhood bar while leaving it's rustic charm largely intact.  The result is a place that's changed for the better.  Years of filth have been scoured away, and decrepit timbers have been replaced. But still, the hearty soul of a meeting place with history  remains.\r A central bar sits in the middle of the room, with most of the seating on the West side.  TV's for sports are small, but decently placed.  Limited wood on the walls along with a brick fireplace help create a humble ambiance with a rough-cut charm.  It's an overall feel that no cut-and-gut remodel with new materials and contemporary styling could ever duplicate.  \r The mid-day/after-work crowd is an odd mix: An easy-going group of young surfers  and a smaller segment of old-guard codgers.  Later at night the clientele gets younger as the beach crowd trickles in and the music gets turned up.\r All in all, I like it.  It's a friendly mix of young and old where the two actually interact.  And while the night crowd gets a little young and noisy for my tastes, I could really see liking it when I was in my twenties. It's out of the way, it's near the beach, and there's a pizza place two doors down.  I've came, I've seen, I'll be back....",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Mike W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1151193600000,
        "ReviewContent": "After work this comfortable and unassuming bar offers cheap pints, friendly dogs, a happenin' music selection in the juke box, smiling bartenders, and Connect Four. Really, think about it...when was the last time you sat down with a lovely pint of \"your favorite beer\" (in my case, Anchor Steam), a group of good friends, and Connect Four?! If you can't remember, go to the Riptide. Originally I listed this as a 4 star...adding the fifth because every time I have been there, the bathroom has been very clean!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jessa B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1142121600000,
        "ReviewContent": "So disappointed b/c I had such high hopes.  Our first time there, we loved it-- the fireplace, the feeling of being in a Northwoods bar.  But, the second trip there ruined it for me.  We had the whole family from Madison in town to visit.  On our drive along the oceanside, we stopped off at Riptide for a beer during the afternoon, and they kicked us out because we had a kid with us.  We weren't buying her beer-- we bought her a coke and planned to play cards in the middle of the afternoon. Instead, the bartender demanded she show ID, even though she was with both her parents, and then made her wait outside while the beers that he had already tapped were drunk.  Some chronic at the bar chimed in with, \"you should've charged them double for smuggling in a child.\"  Turns out the Northwoods look of the place is just that.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"sunny d.\", \"AuthorLocation\": \"Chicago, IL\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1139529600000,
        "ReviewContent": "When I sauntered into this extreme Outer Sunset bar I was welcomed by a warm presence of locals and a roaring fire.  I then realized I think I have found my favorite San Francisco bar, and one close to my house.  Located right off the MUNI L and at the cusp of the Pacific Ocean, the Riptide offers cheap drinks, Guinness on tap and a plethora of music options ranging from alt-country to bluegrass.  They have happy hour specials throughout the week, but the special thing about this place is the remodeling job that brought the true character out including knotty pine walls and the lodgey northwoods feel.  For a truly honest drink poured by friendly bartenders and surrounded by locals, stop into the Riptide.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Taylor P.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1139356800000,
        "ReviewContent": "This little dive bar--just a few blocks from the beach--is almost (but not quite) enough to tempt me to move to the Outer Sunset. Expect friendly, welcoming regulars (some with their dogs), great beer and one kick-ass fireplace.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Jen R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1136505600000,
        "ReviewContent": "This is one of the coolest neighborhood dive bars I've ever set foot in, and it *would* be the coolest had I never set foot in Madison, Wisconsin.  Rustic seafarer's pub meets knarly surfer dood saloon.  Cool fireplace, cheap drinks, good pizza next door, board games, friendly staff and customers, good eye candy, ample parking in front, live music and free food. Not a pretentious post-greek Marina a-hole for miles.  Good all around.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Rick H.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1135814400000,
        "ReviewContent": "Earlier this week I was sitting by a fire, roasting marshmallows on a stick while enjoying a $3.50 pint of Guinness and a $2 pint of Hefeweizen.  No, we didn't stop at a liquor store on the way to a bonfire on Ocean Beach- we were hanging out indoors at this bar.  They actually have sticks for roasting things by the fireplace, and on Wednesdays they're providing sausages and shish kabobs!  And it's right next to an L stop.  Need I say more?",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Rego S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    },
    {
        "ReviewDate": 1122336000000,
        "ReviewContent": "This is the hippest bar in the sunset. Inside the tiny space, large deer horns lord over the dimly lit bar. I arrived on open mic night to find a fifty year old man playing cover tunes on his electric keyboard. This was followed by two guys playing punk covers of Neil Diamond songs. Wow. They have their own brand of Riptide Red Ale. The owners and bartenders are super friendly. The Riptide rocks. Live Music 2 nights a week.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"The Riptide\", \"AuthorName\": \"Netty L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Riptide",
        "venue_id": 11
    }
]