[
    {
        "ReviewDate": 1712188800000,
        "ReviewContent": "Great location. Easy to get to on public transportation. Very friendly atmosphere, down to earth and it has a real neighborhood feel as well. Friendly staff, nice accommodations as well. The open mic was just what I was looking for in terms of a performance venue. As a vocalist, the Fireside *theater* is an excellent space to work in. Justin, the soundman, does a great job in getting things all ready to go for the event. He is also very thoughtful as well. I would have given 5 stars, but honestly, I can't afford $8 for a beer. I would recommend a $3 can beer, such as Pabst, or Miller, 12 oz can.Good spot, great location, friendly and welcoming otherwise.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Tao A.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1711670400000,
        "ReviewContent": "Fireside Lounge in Alameda is pretty cool. DJ heats up Fridays, and while they might not have every drink under the sun, the vibe's solid. Dance floor's always lit, plus open mic and art stuff keep it interesting. Not just a bar but a real gem in Alameda. Solid 4 stars from me!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Wanda R.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1698624000000,
        "ReviewContent": "Attended this small-scale halloween costume party in Alameda this past Saturday, and had a wonderful time. Such chill vibes in the venue, even when crowded in the cozy space, embellished with halloween decor and a somewhat limited amount of seating. We enjoyed the live musical performances during the evening... Ledbetter & his Best Bet (folk rock), Islavation (island reggae), bonus 3rd set of halloween songs with mashup of both bands. The first band did covers like Bee Gees' Stayin' Alive, and the second band, awesome reggae hits! They were all great, and kept us in a good mood all night. The costume contest was cool, since it was halloween weekend (1st prize winning a $50 bar tab). The boxed wine costume was my fave, winning 2nd place, only beat by grim reaper barbie, lol. With food served till 11pm, we were able to enjoy some bar bites from their menu later at night. The meatball dish came with garlic bread slices and a zesty marinara sauce that was quite spicy, but just too delicious to stop eating. And the flatbread was basically a thin and crispy rectangular pizza, it was tasty as well. Our cocktails were on the weaker side, very little alcohol, but flavors were good enough. In short, fun and cute venue, awesome live music for special events (and cool and creepy halloween decor), friendly but slow service, food is fantastic but drinks are weak.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Annabelle R.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1692403200000,
        "ReviewContent": "Great outdoor options on the main strip of activity. Good cocktails. Friendly service.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Vicki L.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1690675200000,
        "ReviewContent": "Came here to enjoy drag bingo and support FAAS. The good parts: pretzel bites, the DJ, and supporting our island's no-kill animal shelter. The bad parts are all related to the drag performances. I've never seen such low energy, humho queens. The weirdest part was one of the performers is an actual woman, who used creepy dolls in her act and instead of lip syncing, or even trying to sing, screamed at the top of her lungs. She gave the vibe of being kicked out of theater camp and never having parents tell her that she should probably get a job that didn't involve going up on a stage. Definitely come here for the dive bar and drinks, but don't come here for the drag. You'd think living in the Bay Area the queens would be extra and on point. Not at all.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Katie W.\", \"AuthorLocation\": \"Leeway, Arlington, VA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1687046400000,
        "ReviewContent": "It's a your neighborhood bar. The food was good, the music was good, and the drinks were really good. We sat by the window at a high top table on a rainy afternoon, having drinks and eating appetizers while listening to the music and it was a perfect girls afternoon turned evening turned night. The service is right on par with a neighborhood bar. It's everything you want for a chill Friday with yours friends.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Eu W.\", \"AuthorLocation\": \"Pittsburg, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1673222400000,
        "ReviewContent": "I came here several times 13-16 years ago and had fun with the crowd I was hanging out with at the time. Fast forward over a decade to last year when I got home on the ferry one evening and decided to treat myself to a drink. There was a guy behind the bar and he said he was in training. I said I wanted a Manhattan, up. Should have been an easy order and he excitedly said that was a drink he knew how to make. I didn't want to crush him so when it arrived in a martini glass full of ice cubes, I bit my tongue, drank up, paid, and left. Today I decided I wanted a drink post-ferry so I walked in through wide open door, figuring the Manhattan Mix-Up had been a fluke. The place wasn't too crowded and there were several seats open at the corner of the bar. There were two guys there, drinking alone, and I confirmed the seat I wanted wasn't taken. So imagine my surprise when a bartender walked over to me and asked if I was part of the private party. She then asked me to leave. I double checked and there was no sign on the door indicating that it was closed for a private party, and as I wrote above, the door was wide open. It was really embarrassing to have everyone watch as I got kicked out, and what makes it worse is that I highly doubt there was a private party actually going on based on the fact that there were other people sitting at the bar clearly drinking alone. I guess I didn't look enough like an aging hipster because I was still dressed for work?",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Sarah S.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1665187200000,
        "ReviewContent": "This place is wack. The vibe is wack. The crowd is clicky, judgemental, and, you guessed it, wack. Drag Prom, wack AF. Trivia, wack. Owner, wack. Rude. Suuuper long waits for just okay drinks. They sell tickets to stuff, then deny entry because they are \"over capacity\", but then see someone they know and let their whole group in. Waste of time and money. It's really disappointing to go out and not have any fun.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kissandtel L.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1665014400000,
        "ReviewContent": "Fireside is fantastic! The customers are chill but the people working at Fireside are spectacular. From my first visit to my 5th they have been so much fun to sit down to wind down a bit. I've had their flatbread and pretzel too and it just makes drinking so much more longer lasting.  It's a solid bar.  I would vote it as my favorite bar in Alameda.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Larry L.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1663372800000,
        "ReviewContent": "I love coming to the fireside it's one of my go too spots. It's probably one of the best bars on the west side of Alameda considering Alameda doesn't show the west side any love the west side is the best side grab a drink at the fireside lounge.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Joe W.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1656115200000,
        "ReviewContent": "The vibes are so chill there. The bartenders are super friendly. The flatbread pizzas are a go-to! I enjoy coming to fireside every time.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Elaine C.\", \"AuthorLocation\": \"Santa Clara, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1651881600000,
        "ReviewContent": "The best neighborhood bar. Everyone is welcome and accepted. And their jalapeño beer cheese is amazing!! Please keep it.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Linda K.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1650240000000,
        "ReviewContent": "Oh heck yes!!! What a fun place to hang out. Happy Hour DJ.  Solid beer options.  Cool open area out front, and the coolest staff.  Everyone was so nice to us.  My DJ crew came in on Friday night and the place was casual and electric.  .  What a fun night!!! If you're in the area, you should definitely check it out",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"C W.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1647648000000,
        "ReviewContent": "Coming home To East bay from SF looking For a friendly place ro have a cocktail.  Opened up Yelp and found Fireside Lounge. Reviews positive with extra friendless added.  So we went there. There were three women there.  Shavon made the flat breads she was super friendly and welcoming. We told her it was our first time there and she explained all The activities  offered at the bar. Trivia night, open Mic. Etc. Donna who closedOut my tab was the same really friendly and appreciative that we came in.  Perla the woman who made my drink was farFrom that.  Not friendly did not really care it was our first time in.  She delivered our flat bread and basically threw it on the table along with a few napkins and off she went.  Not saying anything.  RUDE Not inviting nor near friendly, So the flat bread was Crispy amd flavorful Very good wouldOrder again.  Drinks non memorable So 5 stars for Donna and Shavon Maybe it was just an off day. Will try again and hopefully update the rating.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Ramona H.\", \"AuthorLocation\": \"Castro Valley, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1625097600000,
        "ReviewContent": "I absolutely love this place, the bartenders are great! The Artwork, pinball machines, music, Definitely my kinda atmosphere to hangout and chill with friends",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Inna E.\", \"AuthorLocation\": \"Saint Helena, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1617840000000,
        "ReviewContent": "My local spot now that I live half a block away. Thank you for the smiles, service and drinks. Even the take home boxes are amazing. Dj on the weekends and plenty of good atmosphere.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Reyna O.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1579046400000,
        "ReviewContent": "What a delightful place!  We came here for Tuesday night Trivia and it was wonderful!  It is organized by Christine (?) on the 2nd Tuesdays of the month and she was wonderful!  5 rounds including a music round and a picture round.  Our team of 4 had a wonderful time and we were so happy when we got an almost perfect score on the music round and we WON A FUCKING PIZZA!!!  We were already stuffed with tacos, but we ate the pizza ... even the vegan guy.  The staff was also incredibly friendly. We sat by the fireplace which was warm and cozy; surrounded by other very friendly patrons.  There are lots of regulars here for the trivia which I think is very indicative of the awesomeness!  While we were in the lead for several rounds, we got bumped out on the end because we ate too much pizza and got dumb .... but can't wait to go back!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kathleen W.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1572048000000,
        "ReviewContent": "I was walking by with a friend and saw a ghost flying back and forth and had to go in. Also had a live band, amazing atmosphere, friendly employees, and pinball machine. The best part was Chris though. Not only did they decorate the bar, but are also a great bar tender, so friendly and handled the busyness so well. I'll be back tomorrow for the costume contest.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jazzy J.\", \"AuthorLocation\": \"Livermore, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1570233600000,
        "ReviewContent": "Our favorite neighborhood \"dive!\" We stumbled on the Fireside the week we moved around the corner, and instantly felt so welcome. The staff are terrific (we love Christopher and Kirkland!) and Tuesday trivia nights are the best around. We love you, Fireside!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Lauren Z.\", \"AuthorLocation\": \"Irvine Spectrum Center, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1565827200000,
        "ReviewContent": "Wonderful service, bartender was great, older lady with wonderful service and great drinks, local craft beers.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Gerald C.\", \"AuthorLocation\": \"Sterling, VA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1561334400000,
        "ReviewContent": "Love the people here and the staff. It's like a local cheers and fun events and atmosphere. Always nice to grab a drink, nice breeze in the summer and nice fire in the winter. Be nice or leave.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Austin R.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1558656000000,
        "ReviewContent": "Really fun, smaller bar. Has lots of board games, a robust rotating selection of local and larger name beers. Good cocktails from what I've had. Lots of fun events during the week and shows on the weekends.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Cameron L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1558396800000,
        "ReviewContent": "I love this place. They're so involved in the community. They're always holding events and support local artists. Everyone who works here and stops for a drink is really friendly. I feel like everyone is really welcomed. I've never felt out of place any time I've been there. I keep thinking about how I need to go back! I think that the drink prices are pretty average. And they have a decent selection of local beers, too!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Natalie C.\", \"AuthorLocation\": \"Pleasanton, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1555113600000,
        "ReviewContent": "New to alameda and this is a bar I would to definitely come back to. Great beer and very relaxing atmosphere.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Rene M.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1553126400000,
        "ReviewContent": "Dive bar with a bit of hipster and sarcastic kick to the background!It's a nice spot for a variety of drinks and get together. They have pin ball machines and live music!Cheers!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Tiffany D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1540684800000,
        "ReviewContent": "Came in here to meet friends. I've driven by this place many times, it's a dive bar for the locals. Staff was nice and friendly, which is a big plus. They had Karaoke night on a Sunday. Bunch of people just having fun and letting loose with the alcohol courage to sing. I had a good time with friends and many laughters. Drinks were solid for what it is. I would come back again if I was invited, but wouldn't be my go to spot. Four stars because of the staff.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"ARIeL P.\", \"AuthorLocation\": \"San Leandro, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1539907200000,
        "ReviewContent": "Great spot and a great bartender. Never a long wait with theses veteran bartenders and always serving with a smile and welcoming conversation.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Miguel P.\", \"AuthorLocation\": \"Daly City, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1539561600000,
        "ReviewContent": "Great crew working when I went on Thursday night. They were friendly and fun! We went to my first ever drag show! Did I have fun!! The acts were awesome! Their was a nice sized group in the bar.. not too raucous or crowded! The \"nun\" announcer was a stitch and I could tell was cool and experienced. I would go back in a minute and in fact will! See you soon!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Sandra H.\", \"AuthorLocation\": \"Spotsylvania, VA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1536883200000,
        "ReviewContent": "Our favorite local bar! Sincerely nice bartenders, great beers, and quality liquor selection. Trivia night is brutal (cutthroat and crowded!) but other than that most nights are chill. Get in before 8 on music nights to avoid the cover. Great to meet up with old friends and meet some new ones. Glad they have more day drinking hours on the weekends now. Sandy, Sarah, Chris, and Dom rock!Pro tip: Unless you're sitting at the bar order your drinks in the center of the bar between the brass bars. Fastest way to get served. ;)",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Lia T.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1535760000000,
        "ReviewContent": "Perfect spot on the west end to grab a drink. The bartenders are all super cool, and helpful. They do not serve food here, but you can bring in food from other places. And there are quite a few good food spots near by. Fireside lounge has lots of live music and the genre varies from night to night.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Andy K.\", \"AuthorLocation\": \"Austin, TX\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1532304000000,
        "ReviewContent": "Great music on the weekends. Friendly staff. Friendly patrons too. Good selection of cocktails and draft beers. They could work on getting newer and bigger bathrooms.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Bruce J.\", \"AuthorLocation\": \"Olathe, KS\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1531612800000,
        "ReviewContent": "I have called this location severel times today (during business hours) with no answser. When they have answered I was hung up on.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Corrine N.\", \"AuthorLocation\": \"Long Beach, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1531612800000,
        "ReviewContent": "What a cute place with comfortable seating and a fireplace (obviously). It can get too hot so if you're in for the long haul, keep that in mind. The bartender even gave me a small history of Fernet-Branca which was fun. Not every place has this so this gets my recommendation. Go go go!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Ricky K.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1527984000000,
        "ReviewContent": "I like this place but it can be noisy at times because they do have a lot of events going on such as trivia night, karaoke, open mic nights, bands, etc. They also do unusual things like day showings of a Harry Potter movie with cool HP themed drinks and a few times there was a Tarot reader in there in the evenings. So sometimes if I want a quiet drink that is not the place to go even though I really like the atmosphere. There is always local artist artwork on the walls that is constantly changing. I like how they use fresh squeezed juice for their greyhounds and I also like how their large front window opens so that you can watch the people walk by on Webster Street and enjoy the sea breeze as you enjoy your cocktail. There's also a good taqueria next door if you want to grab something to eat while you're sitting at Fireside so that's really cool. A great group of bartenders too.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Morrigan T.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1525564800000,
        "ReviewContent": "Great little dive bar! I've been here a couple of times now, once during a stop along Alameda's Zombie Crawl and then to see my friend's band play. Both experiences were fantastic!I love the ambience inside. It's got the perfect amount of dive bar and \"cool\" mixed in. Like, if you're in your 20's-30's you'll feel like you've found \"the place\" that other millennials haven't found yet. If you're in your 40's+ you'll fit right in with a lot of other 40+ers. They also have pinball machines and live music and board games in the back, so super bonus. The drinks are a great price, and they keep a large selection of craft beer. Bartenders are also super chill and funny and seem happy enough to be there. I like that vibe when I'm going to a bar just to hang out. I haven't tried one of their house cocktails, but will check out the list next time. I've heard good things from other people. This place is definitely a great place to hang out with the locals. If I didn't live on the other side of Alameda, I'd probably come more often. Will definitely come in for the music, though!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Melissa B.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1523923200000,
        "ReviewContent": "This is a great, community-oriented lounge that has all kinds of fun events, great art, and delicious drinks. Highly recommend a visit, especially during any of the 80's Nights that are occasionally held there, or during any trivia night. If you're looking for something different to do with your evening, it's a good place to go and have fun.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Enkhzaya D.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1518739200000,
        "ReviewContent": "Nice little dive with space in the back for shows. Jazz nights are nice, and the occasional drag shows are great for people just getting into the drag scene.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Lindsay O.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1517616000000,
        "ReviewContent": "This place holds many awesome memories for me, staff has always been super nice. On some nights they also have live bands which is always a win!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Yesenia A.\", \"AuthorLocation\": \"San Pablo, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1516838400000,
        "ReviewContent": "Lots of cool happenings at Fireside Lounge,  they show local art every month and participate in 2nd Fridays. I've actually sold some work here too.  It's a great place to show art.Also they have a wide selection of vodka and they use real fresh oranges in their drinks.Love the staff and all the efforts they put towards building a community.  Very supportive of the LGBTQ and the place is owned and operated by women!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"jessica w.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1512691200000,
        "ReviewContent": "So much fun!!   My check ins aren't accurate but I've been here probably 4 times.   Comfortable local bar with live bands.  Great service and atmosphere.   On this trip to the Bay Area I was here 2 nights.   Can't beat the local alameda prices either.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Chris M.\", \"AuthorLocation\": \"Chicago, IL\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1512345600000,
        "ReviewContent": "Good service, great cocktails, and fun theme nights, live music. Definitely recommend to any and all who care to drink.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jake P.\", \"AuthorLocation\": \"Batesville, AR\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1509148800000,
        "ReviewContent": "Chris, the bartender is awesome. I mentioned I had a sore throat, next thing I knew he made me a drink of lemon, honey & hot water.  Was very unexpected and so thoughtful.  Very attentive to the patrons.  Thank you, Chris.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Lisa E.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1508371200000,
        "ReviewContent": "My brother, a tiki bar aficionado, was visiting and we had a less-than-stellar experience at Forbidden Island. On our way home, we decided to stop here. What a treat! The lovely bartender/part-owner was amazing. Super-friendly and beyond knowledgable. We tried many unusual spirits that Forbidden Island should've known all about. (In their defense, it was the Sunday of a holiday weekend and it seemed to be the B-Team bartenders. It was much better the next day.)I'd been to the Fireside once for trivia night, but that was ages ago and this was a much-improved experience. Great ambience, too. Now that I live on the west side of town, I plan to make this a regular stop.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kim C.\", \"AuthorLocation\": \"Saint Petersburg, FL\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1506816000000,
        "ReviewContent": "They make THE best greyhounds with that fresh-squeezed grapefruit juice!! Nice place.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Edith R.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1503964800000,
        "ReviewContent": "To start, I want to say that I met the sweetest group of early 30's dudes (one of which was having a bit of a life crisis and had his buddies visiting) and I wish I had gotten their info!! We talked about exchanging and then totally spaced! If any of you sees this, shoot ya gal and email @ missgreanna@gmail.com so we can go to a float and a drink next time I'm in town! BUT ABOUT THE VENUE! Had such a fabulous time at this precious little pub! Saw a really rockin' Bluegrass band (which apparently happens the last Friday of every month) and danced the night away! Delicious cocktails and fabulous crowd! The environment was really mellow and personal and I was able to interact with the willing band directly! Would definitely recommend to anyone looking for a blissful, safe and comfortable night out!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Greanna E.\", \"AuthorLocation\": \"Mission Viejo, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1503792000000,
        "ReviewContent": "Super nice people. Friendly place.Ask Chris to make you a Chile Beer (chile flavored vodka with ginger beer) on the rocks. We made up this name. Chris made up the drink. It is awesome.Tell him Bob and Denis sent you.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Bob E.\", \"AuthorLocation\": \"Goodyear, AZ\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1501632000000,
        "ReviewContent": "Love, love, love, love. Yum, yum, yum. And yes, pick up some food from a nearby restaurant and enjoy in the bar. SCORE! Staff = super friendly.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Lauren M.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1501200000000,
        "ReviewContent": "Great little bar with live music.  Seems mostly like locals hanging out just enjoying themselves.  Would come here again in a heartbeat.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Andrew W.\", \"AuthorLocation\": \"TX, TX\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1500249600000,
        "ReviewContent": "Hadn't been for a year or so; went to karaoke last night.  Karaoke was fun, the service was great.  Nice friendly bartenders, good pours.  Nice clean place, hot as hell during warm weather.  Would rate higher, but the beer and liquor selection is subpar.  Hangar One is a fine vodka, but not having Ketel One is just silly.  No Bushmills either.  Most disturbing is the beer.  I am all for supporting local breweries, even if I find some of their offerings to be awful.  Small batch does not always equal better.  Occasionally I'm not in the mood for all that culture, and can I just have a Miller Lite or a Stella?  It's obvious Management isn't insisting on superior quality, since they serve cans of urine (PBR) and also have Tecate.  Any bar where I can't get a Heineken or a Guinness speaks to the vanity of the management and not the desires of the customer....",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Ken P.\", \"AuthorLocation\": \"San Diego, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1496188800000,
        "ReviewContent": "Comfortable neighborhood vibe with a nice area for dancing to live music - dance floor and stage are a little small but good enough for a typical Friday night crowd.  The staff is friendly, generally quick to get to you when you want to order a drink, and a good selection of libations to choose from.  Also, there are several restaurants close by so you can gab a bite before coming here for a drink and some music.  Worth venturing through the tunnel from Oakland for an evening out.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jerry P.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1495843200000,
        "ReviewContent": "Great live music! Employees very friendly and hard working! Owner makes us feel like family! Definitely coming back :)",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Meralis C.\", \"AuthorLocation\": \"Whittier, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1491436800000,
        "ReviewContent": "Fireside is our go-to neighborhood bar. Beer and spirits selection is carefully curated with local options. The vibe is on the fancier side for bars but is still a casual atmosphere. I LOVE that the bartenders are knowledgeable and can make great cocktails (we love our sazeracs). Dimly lit with candles on tables and live music occasionally. They also have a selection of board games in the back area and some pinball machines. Also a great place to see local artist's on display and for sale.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kanitha C.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1488844800000,
        "ReviewContent": "Trivia nights on Tuesdays 8pm, free admission. I came on 3/7/2017, some trivia topics were tv series theme songs and March themes. They offer prizes for the winning team, such as choosing from a variety of stationary goodies that they had purchased prior at Michael's. I heard that they offer different prizes each time. Outside food doesn't seem to be strictly enforced.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Elaine S.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1485648000000,
        "ReviewContent": "Last night I went to see a favorite band of mine, The Living Deads. I walked in the door and the two bartenders greeted our 7 person party with great delight. It was refreshing but, I wanted to know what the catch was. Well, there was not catch, they were just nice people with some of the best service I have ever had in a bar. I read on their menu a drink that had fresh squeezed grapefruit juice and I couldn't remember any more than that. It turned out to be the most amazing and creative drink I have had in a long time. The drink was called Endless Summer, sounds kinda cheesy right? but it was delicious. It was made with Mandarin Blossom Vodka, fresh grapefruit, fresh orange, Elemkaule Tiki Bitters and Ginger Ale. I couldn't stop drinking them, I three and to make myself stop. Out of our table of 7, 4 of us had 3 each. Friggin delicious!!The place is really tiny but cozy, they have a lot of tables in the back. There is a stack of games available to play as well as 2 pinball machines. I am so used to bars having disgusting bathrooms so I avoid them at all cost, but alas I could not last night. I was pleasantly surprised that it was clean, I had nothing to complain about. I would come back in a heartbeat and look forward to my next trip.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Robyn J.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1484870400000,
        "ReviewContent": "One of my favorite bars in the Bay Area!! From the decor and art on the walls to the soft ambiance with candles and music. I love the assortment of beers and fresh made cocktails. I even get to watch a game now and then on their flat screen. Enjoyable all around!!! Love it!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Matthew G.\", \"AuthorLocation\": \"West Oakland, Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1484697600000,
        "ReviewContent": "While the place is in fact quite nice, I have given this place a 1 star due to my experiences with one of the bartenders. Rude. Can be a flat out B. I have given this place multiple shots and have come in here thinking that at least she can fix her tone and demeanor. Mind you I don't have to be nice to her with that shitty attitude but yet I have always remained polite and professional. It appears most times there's something stuck up her... I believe her name is Sarah and she's been working here forever. Attitude up the A Hole. I skip this place often due to her and must say that there are other bars in the neighborhood within this strip that are just as nice if not nicer. I have had parties of 7-10 close knit friends and we gather up at 1400 Bar & Grill down the strip. Great food, and live TV as well. When the owner there (Yanni) himself comes out and gives you a hug EVERYTIME you visit, that says a lot. Just cus she's been here for a dinosaur # of years, doesn't mean she owns the place. She needs to work on her rapport building skills and relationship mannerisms. This is coming from a guy that works in a corporate setting himself. I don't hold grudges but service and conduct is critical to my experiences. ESP when you come to a place to wind down. Not to experience a constant shitty attitude or to bite your tongue. That's a stresser itself and I dont have anytime for that really. If I feel I am \"bothering\" you while placing an order, or ordering something you may not serve (Grey Goose for example), just be cordial my friend. Rest of the crew here are super cool. A few of my friends have also pointed her demeanor out in the past so I know this isn't just me. When she quits (whenever that is), Fireside will earn my $$ then. And I can put down a decent amount on drinks. I hope management can be humble enough to address this and her. Thx!",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jaz D.\", \"AuthorLocation\": \"Fremont, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1480636800000,
        "ReviewContent": "Cool place. Strangely their website says happy hour  daily 4-7 but they do not have one nor will they honor it.  Too bad",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Erik F.\", \"AuthorLocation\": \"Golden, CO\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1480032000000,
        "ReviewContent": "A Wednesday night going away drinking party, were 20 strong. With 10 different beers, most of them local brews on tap and a large frig of beers, this is the place to be. Thanks to the awesome bartender for the Hangar One Vodka tonics with the nice pours. Strange they did not offer Grey Goose or Ketel One Vodka, but besides the Hangar One they offer Tito's Vodka.On some nights, the Fireside Lounge has local live band play.  So on this night there was a live band to play some rock music, the music was appreciated by the customers.Located on Webster St, it is one of the larger bars that is double the size compared to the other bars on this street. Great place to lounge, play pool and meet up with some friends in Alameda.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jim D.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1476835200000,
        "ReviewContent": "Fireside Lounge has such a chill vibe to it; I really enjoyed it. A group of girls and I showed up for Trivia Night. Drinks were affordable and plentiful. The bartenders were fast, attentive, and friendly - they always had smiles on their faces. It's a great, neighborhood bar.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Amber L.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1474761600000,
        "ReviewContent": "Delightful. Good music, great service, excellent brews! Much approval!They have big windows in the front that lets in a nice breeze, total chill vibe here",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Nik H.\", \"AuthorLocation\": \"Indianapolis, IN\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1474502400000,
        "ReviewContent": "This place has come a long way since it's years as a windowless dive bar.  You can see outside and the light comes in!Beer selection is pretty decent, mostly local brew on draft, and a nice bottle selection.  Prices are a little higher than expected, but not too bad.I've seen some good local bands roll through here, but usually it's groups I've never heard of.  Also there's art on the wall and they might still host Paint Nights.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jonathan S.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1473292800000,
        "ReviewContent": "I don't drink and I still enjoy hanging out at this place. The folks who work there are world class bartenders. Great little place for live music too.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Mike R.\", \"AuthorLocation\": \"Albany, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1470700800000,
        "ReviewContent": "Great local bar with a great beer selection. They have different events happening throughout the week. It is a nice low key place filed with great local peeps. The bartenders are friendly and there is live music and even an open mic night. Great place!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Issy G.\", \"AuthorLocation\": \"San Diego, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1469836800000,
        "ReviewContent": "Went here with my husband during our first visit to Alameda and it was great! Good local craft beer, live music, & friendly bartenders. Nice small town vibe.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jamie G.\", \"AuthorLocation\": \"Plain City, OH\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1463184000000,
        "ReviewContent": "I've been to the Fireside many times.  It's decent, nothing spectacular, but consistently not crowded and they pour drinks.  Recently I went by and saw that they now have a sign up endorsing a political candidate.  It's my belief that it is unwise for any business to endorse a political candidate, as it isolates would be customers.  And really, is this what your business is about?  No.  I really don't think placing a candidate's campaign sign on your property is appropriate.  There are plenty of other lounges in Alameda to enjoy a drink and socialize without having to suffer a political buzzkill.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Ginger S.\", \"AuthorLocation\": \"Seattle, WA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1461283200000,
        "ReviewContent": "This is a fun place for trivia nights, and good beer if you ask the bartender their opinion. Go for the Allagash White and maybe skip the House Cab (tastes like vinegar).",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kara M.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1456358400000,
        "ReviewContent": "Went here on my 21st birthday and everything from the drinks to atmosphere was fantastic. With staff that provides excellent service and an open mic night that would blow your mind I would call it a great place to spend any night.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Nikolai Z.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1450742400000,
        "ReviewContent": "Great spot. Good chill crowd, fantastic bartenders. Whether for a casual beer or night out with friends, this place is win.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Melissa C.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1449187200000,
        "ReviewContent": "On a chilly rainy night, 40 of my best friends met up with me on my birthday at the Fireside.  We had the most delicious tasty cocktails served by sweet, kind, lovely bar maidens.  We hung out by the fire, laughed and ate some snacks they let us bring.  There was wonderful jazz playing.  The Fireside is THE best bar in Alameda to go with your buds!!!  Hands down!  Thank you Fireside !  Thanks you for the chill, laid back friendly atmosphere and your amazing service! And on a side note, on another occasion we were there and heard a wonderful girlband, glamskanks.  Bring them back!  They were amazing!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Alicia M.\", \"AuthorLocation\": \"Sanpete County, UT\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1448841600000,
        "ReviewContent": "Great beer, cozy atmosphere. Sat at a high top near the open window during warm weather and enjoyed a cold beer. Bar tender was peasant. Music was enjoyable.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kimberly S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1448755200000,
        "ReviewContent": "A wonderful neighborhood bar.  Most nights of the week there is live music or some event.  Jazz jam, rock, trivial pursuit, etc.  If one night doesn't fit your tastes try another.  I no longer live in the neighborhood but try to return for the Monday night jazz jam-- some very talented regulars.  I wish every town had such a spot.  And very fine mixologists at the bar too.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"g f.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1447804800000,
        "ReviewContent": "Great place, awesome beer selection and really nice staff (Bitsy behind the bar and Justin running the open mic).  Went here for the first time this evening to check out the open mic situation- warm and inviting easy going place with a real neighborhood feel.  Its not my neighborhood but will go out of my way to get back here soon.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Boris L.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1446768000000,
        "ReviewContent": "I was in town for a raider game and spent my weekend on the island. This is a very nice cool bar. Not rowdy or anyone bugs you. Nice staff. Great neighborhood. Definitely coming back here",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kristina F.\", \"AuthorLocation\": \"Carson, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1446076800000,
        "ReviewContent": "Fun place for a couple of drafts and catching football-both bartenders were great-gave me tastes to decide what I wanted. Good mix in the crowd with some early Halloween costumes! Want to come back to check out on a music night.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Mark O.\", \"AuthorLocation\": \"Roseville, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1445385600000,
        "ReviewContent": "Love this bar. Just down the street from my apartment. Good people, good local music and beer. I couldn't ask for much more!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Brian B.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1438128000000,
        "ReviewContent": "Best bar in alameda. Bitsy is great and she makes a helluva cocktail. Definitely check it out on a rainy night when the fireplace is roaring, it's fantastic.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"KC F.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1433462400000,
        "ReviewContent": "This is my favorite bar! If you're looking for a neighborhood bar where everybody knows your name, come here.  The owners are awesome, the bartenders are great and the drinks are on point. Gotta throw a shout out to my faves Chris, Bitsy, and Sarah!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"James E.\", \"AuthorLocation\": \"Embarcadero, San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1421712000000,
        "ReviewContent": "Bitsy one of the bartenders.  She's a gem.  So caring and kind and fun!  Drinks are well prepared and taste delicious.   There's this nice atmosphere. Of camaraderie even when you know anyone and they have live music like Jazz and blues and also open mic nights for those who enjoy being under the spot light without being judged.   As a lady coming to a dive bar solo for the first time I can only say this: relax,  you're in good hands and you're going to have a great and safe night :))",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Angela V.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1418688000000,
        "ReviewContent": "I love the fireside. The bartenders are wonderful and knowledgable, the atmosphere is chill, there's no more pool, but pinball is awesome! Jazz organ on Monday evening is mellow and my favorite time to stop by. I love my neighborhood bar!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Marion M.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1416268800000,
        "ReviewContent": "I lived around the corner from Fireside for about a year. It's a great little bar with wonderful cocktails, trivia on Tuesdays, open mic, and most importantly if you enjoy old movies, you can watch them here over and over (love it!).",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Janey W.\", \"AuthorLocation\": \"Clovis, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1415059200000,
        "ReviewContent": "This is my local bar away from my place of residence. What's not to like about it?Cool AtmosphereLarge selection of beers, whiskey, rye etc at reasonable pricesAwesome bartenders; Sarah, Chris and Clay in particularThey are also playing sporting events. Watched the Giants win the WS there this year, so they'll have a special place in my heartAlso, they just started some really good specials for Sunday football.All in all, a delightful and fun place to enjoy drinks",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"N H.\", \"AuthorLocation\": \"Los Gatos, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1414886400000,
        "ReviewContent": "This Bar is a local gem in Alameda.  The staff is amazing and efficient and are a joy to talk to.  They play all the sports games on and have a full bar and plenty of delicious local brews! It's a local spot that brings a much needed respite from snobby san francisco bars.  This is a must stop bar! And they make amazing manhattans!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Sean M.\", \"AuthorLocation\": \"Santa Rosa, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1413676800000,
        "ReviewContent": "Nice place. I get the feeling its run by amateurs. Not open til 4 on football sundays even though they have TV's. Actually most times it seems to be closed. Live bands for cheap or free but bad sound system. Lots of beers but all kinda the same. You get the idea. Very mediocre so though its in my neighborhood I usually go elsewhere.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"darrel w.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1411344000000,
        "ReviewContent": "Stopped in for a drink in a whim, and glad I made the choice. The bartender was friendly, and quick to offer recommendations for their liquor selection. She also made a great Old Fashioned- well balanced, not too fruity. Would come back whenever in the area.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Roarke M.\", \"AuthorLocation\": \"Pacific, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1410048000000,
        "ReviewContent": "This is a great local bar. They typically have a diverse beer selection and a fun trivia night. I wish they had cider in tap, however. Super chill spot to cozy up with friends and they even have a Dolly Parton pinball machine!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Mylie T.\", \"AuthorLocation\": \"Sebastopol, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1410048000000,
        "ReviewContent": "Four years later - new owners, new attitude.  The place is great. Vintage pinball machines, live music, good drinks at reasonable prices.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Brian H.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1409097600000,
        "ReviewContent": "Fun, chill local bar. Came for a meet-up event, and had a great time! They had a live band playing which made for good music, but hard to hear the person sitting next to you, even on the opposite end of the place. Bartenders were nice and had quick service. Would come back if I'm in the area.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jenn D.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1408492800000,
        "ReviewContent": "We enjoy the cocktails & the great beer selection! Plus they're on the 51A bus line, so I can stop by any time without fear of those ever-vigilant Alameda police!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Blaze F.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1404604800000,
        "ReviewContent": "Sunday evening, about twelve patrons are here. That's great. Especially because I want to spend a little time with my boo and the less the crowd, the better...for this evening. Sadly, they no longer carry food...like no food. I wanted that carnivore plate. Well nope, no mo boo. Whatever. He played the two pinball machines and I sipped on my Zin",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Elease T.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1404172800000,
        "ReviewContent": "If you have not been to this gem on Webster St. You have missed a great bar and gathering place. The drinks are well poured and wines are local. This is just so more enjoyable than other noisy bars here, got my friends to ditch Forbidden Island... Once you get here the ambiance is relaxed, live music is great - just come here for happy hour and you will be glad you did.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Sally M.\", \"AuthorLocation\": \"Emeryville, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1403395200000,
        "ReviewContent": "Came here after work last night on a whim to celebrate my brother's belated birthday and we were quite surprised to see how nice the place actually is.  Crowds are energetic, drinks are good (or at least my siblings who drink said so) and reasonably priced.  I just stuck to my usual, a Sprite.  Bartenders are very friendly.  Music might not be to everyone's liking, but there's no cover charge so you can't really complain about the live band.If we ever decide to hang out again, we'll definitely keep this place in mind.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Sivilay T.\", \"AuthorLocation\": \"Orinda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1394150400000,
        "ReviewContent": "Very cool atmosphere.  Very classy.  I've been here for some of the live music and it's been awesome.  They have a great selection of local beers and liquor.  They use fresh juices in the cocktails which makes a huge difference.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Greta R.\", \"AuthorLocation\": \"San Rafael, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1392940800000,
        "ReviewContent": "I like the atmosphere-- especially with the fireplace warming the back of the bar.  The drinks seem great with an excellent selection of beers, and although I didn't order a mixed drink, they have a big Citrus squeezing machine for fresh fruit juice. Sarah, who is behind the bar was extremely friendly and pleasant.  They have free Wi-Fi, as I noticed one bar patron was enjoying a beer and also getting some work done on her lap top.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Taylor A.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1391472000000,
        "ReviewContent": "Barely any wine choices (last time I was here was over 7-8 months ago). Music was horrible about 2-3 of the times I was here (it was their live music bands). They sounded like they were yelling on the mics. Sounded like metal on crack. Sorry. I was only here to play pool with a friend. And then wanted some one on one catching up with a buddy of mine. Didn't work out to well because I am now deaf. Do not plan on coming back here anytime soon. Unless I find out the music genre changes to something more laidback, fun, and retro.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Grazie E.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1390694400000,
        "ReviewContent": "Nice neighborhood bar with friendly patrons.   Good rye selection, chill vibe (went at an off-ish time before the music started), and good board games.   The veggie/cheese/hummus plate was actually solid, and I didn't hate that the bartender gave me a wink.  My only wish is that there was some more comfy/updated seating.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Nat T.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1388620800000,
        "ReviewContent": "I love this place!  Often overlooked on the West end but this is worth a stop.  Great beer selection and amazing cocktails.  They get some great musicians in from time to time as well.  Check them out!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Matt S.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1388534400000,
        "ReviewContent": "We rang in the new year here and it was pretty fun because we were in good company. The bartender here was extremely knowledgable and kind. The vibe was very chill and laid back and the interior was nice and cozy. Great beer and whiskey selection. The focus is certainly on local breweries and distilleries. We will return here when we are looking for a relaxed night out. They also have a pool table which is great, and Tuesday night trivia.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Alyssa W.\", \"AuthorLocation\": \"Walnut Creek, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1384732800000,
        "ReviewContent": "I checked out Fireside Lounge on Saturday afternoon because all the other bars I had bookmarked weren't open yet. Plus, I've been wanting to check out more of Alameda so I figured it would be fun to check out. There weren't many people there, which wasn't so bad for a Saturday afternoon. The bartender was super sweet. Apparently she was covering for someone, but she made a nice first impression.The bar is very spacious with a pool table and a small stage. They had happy hour while I was there and it looks like they have happy hour all day Sundays. Later in the evening, the bartender lit all the candles at the tables and put on the fireplace. Very cozy!After seeing that there will be a Siouxsie and the Banshees tribute band playing next month, you bet your sweet ass I'll be back.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Vanessa S.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1383350400000,
        "ReviewContent": "A great bar with real drinks and pleasant atmosphere (as long as they don't have a loud band). The fireside is a nice place to enjoy a cocktail (the \"mo betta\" is best) with a special someone. They have live music which can be really cool but sometimes a loud band can totally overwhelm the small space, so I avoid this bar on those occasions.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"DANE E.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1382227200000,
        "ReviewContent": "This place has the BEST cocktails!!!! I highly recommend any of the drinks with St. George products!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Michael L.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1381795200000,
        "ReviewContent": "I really love the Fireside. It's a great small town, cozy bar type of feel where you can go and have a chat with a friend or just hang out and play a board game while avoiding the late night party atmosphere. Also, their trivia is very fun and well-organized. I also love how they rotate out the drink selections.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Amber R.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1380931200000,
        "ReviewContent": "Delicious drinks, great staff, good bands.  What more could we ask for?",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"S W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1380326400000,
        "ReviewContent": "Fun little place!  No food and old time movies playing. Ok to bring the food in but should have a few food items and sports on TV. No one is going to watch a movie - but could have one screen with the movies for the ambience and then a couple games on! Still nice place and nice staff!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Donna M.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1378166400000,
        "ReviewContent": "Every Tuesday is trivia night at the Fireside Lounge. We like to come for the entertainment, meet up with friends and enjoy the drink specials. They have local craft beers on tap from Linden Street Brewery, Ale Industries, Drake's, Black Diamond and Cherry Voodoo. Our favorite is the \"Golden State of Mind\" from Ale Industries, that I still call \"Orange Kush\". They often have a happy hour or game night special drink, beer or shooter offered. I love trying new drinks and beer.The drinks on the cocktail menu are delicious and they have quite a few Gin cocktails that I really like. They will deliver tacos from the Taqueria next door, which makes for even a happier happy hour. You can bring in food from neighboring restaurants to enjoy, which I like. The bartenders, staff and owners are really friendly. The trivia folks are great and it makes for a fun night out in Alameda.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Rebekah T.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1376352000000,
        "ReviewContent": "Not what I was expecting. I walked in with friends ready to buy a round and the bartender didn't even greet us. Unless her greeting of \"I need to see everyone's I.D.\" counts. We are all in our late 30's btw. For the second round, I had to wait for her look away from her cell phone for about 5 mins as she finally poured beers while still on her phone. Its one thing to wait when theres a crowd, but when there's not? Also, there are candles on every table and at the bar which the bartender said she didn't have a lighter for. I found one (at the bar from another worker) and lit them myself. And to top it off, we went there for the foosball table which doesn't exist. Crowd, environment, ambiance, not good either. Not sure how this place has such good reviews.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kyla B.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1368921600000,
        "ReviewContent": "Best bar/lounge in Alameda but can't one of the TVs over the bar show some sports?  The movies are great but on all three TVs?",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"mfm i.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1367971200000,
        "ReviewContent": "I have come here a few times to see my bf's band play.  The first time was on St. Patrick's day and it was surprisingly slow, the next time was on a Saturday and it was packed and awesome.  There is some amazing talent that comes through here.  To have a venue in Alameda that consistently brings in live music is truly awesome.  The bar itself has a front room with a pool table and in the back room there is the stage and seating.  The bar is a good size and there is seating there as well.  Drinks are pretty solid and reasonably priced.  The only thing that is missing from here is some bar snacks.  They do at least have a fire place, but it's never on, at least when I have been there.  All in all I am a fan of the Fireside and this is probably the best bar on Webster so check it out!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Molly M.\", \"AuthorLocation\": \"Lafayette, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1367798400000,
        "ReviewContent": "Saturday night, great music, dead place... what's wrong with the picture? All the girls got a free round of Red-Headed Slut doubleshot from the DJ's friend! Wowzers! At least it's not crowded and nasty!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Mary S.\", \"AuthorLocation\": \"San Francisco Bay Area, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1366761600000,
        "ReviewContent": "I really, really want to like Fireside, because they have a great focus on locally produced beer, wine and spirits. The beer list includes local faves like Linden, the cocktails feature Hangar One and St. George products, and the wine list is all local. I like tha.t But I can't recommend this bar because the bartender was so hopeless phlegmatic that it made the entire experience excruciatingly unpleasant. On Tuesday night it was trivia night so the bar was busy but not crowded-- nothing a competent bartender couldn't handle with ease. I ordered a Sage Slam from their cocktail menu. And I proceeded to stand there and watch the bartender try to make this drink. And stand there. And stand there. He didn't seem to know how to make the drink, where to find the ingredients or that haste was of any particular import. Mr. Slo Mo could have made a beef wellington in less time than it took to concoct a drink with five ingredients. Meanwhile people are waiting. And waiting. And waiting. Later, I went back to get a beer. And waited. And waited. And waited. I went back three times. Same thing. Then I gave up and left. If you like standing around looking at a bar without a drink in your hand, this will be your kind of place.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"John G.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1364342400000,
        "ReviewContent": "Really great vibe, and great beer selection. No food beyond little snacks, but you can BYOF. Great neighborhood bar.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Greg F.\", \"AuthorLocation\": \"Hayward, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1364169600000,
        "ReviewContent": "Great spot on Webster. Every now and again it is nice to get off of Park Street and journey to the West End. Stumbled upon Fireside and it is truly a hidden gem. Not only was the fire going but plenty of seating whether you wanted to play/watch pool, sit at the bar or in the lounge area. Love that they have board games/cards available to play. Will absolutely return.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Joe T.\", \"AuthorLocation\": \"Santa Clara, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1362960000000,
        "ReviewContent": "I celebrated my 50th birthday at Fireside Lounge and all I can say is AWESOME! AWESOME! AWESOME! The staff was \"off the hook\" fantastic, super friendly and helpful. I couldn't believe it when I turned up and there was a sandwich board saying \"Kelly's Birthday Party\".  They had a drink menu specially printed with Happy Birthday Kelly and beautiful balloons. This was all done on their own accord. I didn't arrange anything in advance other than the band and DJ. Bitsy went out her way to make certain everything was set up to my liking. They had the sound system all set ready for the DJ as well as the stage for the band. I knew I had a big dance crowd coming, so Bitsy and Chris removed most of the table and chairs or pushed them to the sides to make plenty of dance space. I was concerned the fireplace in the back would get too hot once people got dancing. Bitsy's response was \"no problem it's gas, we'll just turn it down when it starts to warm up.\"  They supplied a big container of iced water for my dancing friends which was most appreciated. The wonderful bar staff Chris, Julia and Sarah excelled in making the most delicious mixed drinks and serving a diverse selection of micro brews with huge smiles on their faces. I can't say enough great things about this place. It has such a welcoming atmosphere like the \"Cheers\" bar in the television sitcom where everybody knows your name.  They worked really hard to make my birthday the most memorable experience. Love it! Love it! Love it!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kelly S.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1362528000000,
        "ReviewContent": "Really enjoy this bar for a bunch of reasons! It has great happy hour specials on the weekdays and on the weekends! Very relaxed vibe and a good beer selection. My favorite parts of the bar is the board games (UNO, Chess, Scrabble, etc.) and that you can bring food into the bar. Live bands during the week and open mic!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Patty P.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1362441600000,
        "ReviewContent": "Pretty good bar with Pretty good Beer. I prefer to come when they don't have shows. Trivia night is good.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"L. W.\", \"AuthorLocation\": \"San Diego, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1361491200000,
        "ReviewContent": "Still making their awesome cocktails with super fresh ingredients.  Still have live music and Salsa dancing on specific nights.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Peppermint P.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1361145600000,
        "ReviewContent": "Great customer service. Bartenders are awesome. They know how to make MY drinks. :) & Clean bar which is a plus.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Mary R.\", \"AuthorLocation\": \"San Leandro, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1359331200000,
        "ReviewContent": "Since my last review, the Fireside has evolved into our regular hangout.They do an excellent job of keeping the cocktail menu fresh while maintaining their commitment to local booze. Their taps swap out somewhat less frequently, but combined with the big cooler full of options there's more than enough variety.The staff is always friendly, the big swing-open windows up front are great when the weather is nice and the fireplace in the back is great when it's not.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Steve M.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1358294400000,
        "ReviewContent": "my fiancee and i were introduced to the fireside via catching the The Rumble Strippers and Golden West Trio show there.... we mosied in shortly after doors opened - bellied up to the bar and settled in for what turned out to be an amazing eveining. the vibe at this joint hit the sweet spot in my heart. and the roaring fireplace in the back is just the cherry on top. the cocktail menu and offerin's are stellar. they highlight small batch and local libations and offer creative mixtures of them. every cocktail we ordered was simply delicious. the bartenders were keen on what they were mixing.... the place was packed - and the folks behind the bar were killin' it with keeping the drink flowing. most impressive to me - was to meet and see the owners behind the bar - standing right next to the mixologist - slingin drinks and offerin' smiles. wow - what a great little gem of a joint. we will be back again and again...",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Nik G.\", \"AuthorLocation\": \"Santa Monica, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1357948800000,
        "ReviewContent": "Looking forward to more time here! Hard working and super friendly staff!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Grae S.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1357948800000,
        "ReviewContent": "Born and raised in Alameda...I know the Fireside or what was a biker bar years and years ago. I longed for a trendy hip bar in A-town...went to opening night and had high hopes. Why the 1 star? Their Salsa night sucks! They trick you by saying they have Salsa nights then when you go it's either dead (no dance partners...due to poor marketing for this venue) or they are not playing Salsa at all!!!! For those who love to Salsa we don't want something similar or jazzy or whatever we WANT SALSA and if we are disappointed once we almost never go back. Don't offer Salsa unless you have access to the Salsa scene goers and have a good DJ or live music.  Hip hop Latin music draws a totally different crowd...no the kind of crowd a Salsa person appreciates. The Down Low...closed...why not go after those folks...that place was packed every Wed night...now where do they go???I am a Salsa dancer living in Alameda and I would rather drive to Berkeley or SF to Salsa. What a shame cuz the Fireside has so much potential but they need better marketing and folks who know what Salsa is all about.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Lulu B.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1357344000000,
        "ReviewContent": "Reason for visit: Trivia and Taco nightWhat I drank: Water, beerVisit date: January 1, 2013First time? Yes.I was super excited for trivia and taco night, mostly the taco part since I suck at trivia. My friends and I arrived a little early (like the flyer suggested) and no one was there. We had the whole bar/lounge to ourselves. And then, we find out that the place where they get their tacos from (the neighboring business apparently) is closed! So, there goes taco night. We ended up ordering food from the Nations across the street. When people started trickling in, they started trivia night. It was hard as expected; also, it was Christmas themed (extra hard). Fireside needs to update their website's trivia page to let people know about weird themes and taco closures.On the plus side, I found a sweet beer that I actually like - an orange kush. Yes, kush. Highlights:Nice seating area.They have board games and pool.You can bring food in from wherever. Bathrooms are clean for a bar/lounge.Fireplace.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Erin G.\", \"AuthorLocation\": \"El Cerrito, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1355788800000,
        "ReviewContent": "This place is pretty good.  Of the bars on Webster in Alameda this is probably the best.  It has a cool atmosphere to it, art on the walls, pool table, dim lighting and so on.  They often have bands playing on the weekend and their prices are okay.  They aren't cheap but they do have significantly better well liquor than your normal bar.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"James W.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1352851200000,
        "ReviewContent": "I had to update my review of this place. When I first tried out Fireside a few years ago it was 11pm on a Saturday night and it was DEAD. On a SATURDAY night. So I initially rated low.But then I ended up at Fireside again last Saturday due to a long line to get in at the Forbidden Island. (Unbelievable! A line to get into a bar in Alameda??) I was pleasantly surprised at how alive the place was. There was a live band playing in the back, a small crowd in the front room and some people playing around the pool table. The type of crowd was great too - a very diverse mix of age, race, gender/sexuality. :) I love that about Alameda. The bar service was great. There was only a slight delay in getting our drinks. The bartenders were very friendly. I loved it! So happy to have another great bar to go to in Alameda.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Claudia P.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1352764800000,
        "ReviewContent": "I have never felt a need to review a venue, feeling that it is their job to give good service and it need not be rewarded. However, I had to make the exception for Fireside Lounge. I recently had a birthday party here and everyone from the owner to the staff were absolutely fabulous in making my birthday fun and memorable. If you're looking to have a party, I recommend booking with Fireside. Ambiance, drinks and customer service are top! They can even refer a DJ with reasonable pricing. I also recommend you request Claire, Sara and Taylor as your working staff, they are FABULOUS!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"M P.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1350518400000,
        "ReviewContent": "The worst customer service ever!! Very rude and can't even make a long island!! Loud music! Never again!!",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"E-man A.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1350000000000,
        "ReviewContent": "I visited the Fireside after reading the Yelp reviews. I really wasn't disappointed. Wonderful friendly staff, outstanding range of local and domestic beers and spirits, and a very inclusive and welcoming set of regulars.  Being a lone international traveller, finding a friendly place is essential and this place ticks all the boxes. I will return on my next visit to Alameda.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Simon W.\", \"AuthorLocation\": \"Hook, United Kingdom\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1347840000000,
        "ReviewContent": "Free Pool! Stiff drinks. Don't smoke in front of the bar . Do ask the bartender to play Selena. Do expect to find a more \"mature\" crowd. Do expect to find an 80's cover band. Don't sing the lyrics out loud in my ear. Great spot for making out in a corner , whiskey, and evidently.....wedding receptions?",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Hannah A.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1347667200000,
        "ReviewContent": "Good beer section.  Best management ever. Love how the windows open up.  Perfect place to go on an afternoon to chill with a beer and good company.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kimberly P.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1347062400000,
        "ReviewContent": "Loud music. Couldn't hear the person next to me talk. Rickety chairs at the bar. Friendly bartender. Friendly door person. Dark like a dungeon and extremely poorly lit pool table.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"John S.\", \"AuthorLocation\": \"Pittsburg, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1344816000000,
        "ReviewContent": "Great place!  I went on a Saturday afternoon after getting Dim Sum.It's a very chill environment with friendly staff. There's a pool table and there's tv's that show old western movies.Liquor-wise I'm a big fan of whiskies, scotches and bourbons and they have a very pretty great selection beyond the common names. With some friends, we shared a bunch of different ones and one of the staff made some recommendations.. I particularly enjoyed the Highwest 36th Vote Barreled Manhattan.I would go again!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Mike L.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1343692800000,
        "ReviewContent": "I went to this place after i got an invitation to their \"salsa\" nights. I went inside expecting a real salsa dance floor, but all i saw was a pool table and a small space in the back, near the exit, which I can only assume is their dance floor. Hm, this is not the place for salsa though. Its a regular bar more than a lounge. It may be a cool place to hang out if you want to kick back and drink, but not salsa dancing. my friend and I were in there about 5 mins max, then we had to find a real salsa place, so we ended up going to SF. its too bad that there are no real salsa dancing in eastbay on a Thursday night. the advertisement for their salsa nights is deceiving.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Evelyn S.\", \"AuthorLocation\": \"Hayward, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1338595200000,
        "ReviewContent": "Great prices, service, relaxing atmosphere.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Gary C.\", \"AuthorLocation\": \"El Dorado Hills, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1337472000000,
        "ReviewContent": "Great bar. Best things in life, beer and live music can be found here. Went for the first time and they had a great reggae band playing Marley and Sublime. Beer selection was good, maybe a bit overpriced($6) but with no cover to get in it works out. A mixed crowd of folks, including those awesome \"hipsters\".  I only wish it was bigger, not much room to get drunk and dance.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Charles F.\", \"AuthorLocation\": \"Conway, SC\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1331337600000,
        "ReviewContent": "Great beer selection but even better signature drinks include spirits distiller in Alamenda. How much more signature can it be. Alamedians need to come here and make it there new favorite place.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Michael W.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1330819200000,
        "ReviewContent": "This place caught my attention from a block away.  The red glowing sign that reads Fireside draws you in immediately.  I loved the cozy feeling you get when you step in.  You can tell this is a favorite neighborhood bar for many.  If only I lived closer, I would visit often.  The bartender was adorable.  She was as friendly as can be.  We tried a mix of drinks from the cocktail list, all of them were original and fun.  There was a fireplace in the back, with a few tables, boardgames available for use, and a pool table.  All of these things made me feel like I had just come off the slopes and stepped into the best lodge around.  However, the Hawaiian themed birthday party taking place fit the place perfectly too.  I really enjoyed my time here.  Great crowd, fun atmosphere, and great staff.  I will be back.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Ashley W.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1329782400000,
        "ReviewContent": "Sunday was the first time I came since six years ago when my best friend's family member owned it. Since it was sold, it has been cleaned up A LOT! It's almost like a completely different place now... IN A GOOD WAY! I like the old divey feel that Fireside once had, but now that it's the Fireside LOUNGE, the name definitely suits the vibe. There's not a lot of rowdiness, the lighting is perfect, the bartender (maybe the owner?) is very knowledgeable about what she serves. They serve local drinks, like Whiskey from Ukiah and Linden St. brew from Oakland on tap, as well as the \"normal\" stuff. The bartender offered my boyfriend and I a taste of a bunch of different local stuff and even took a shot with us herself. She was attentive, friendly, and beautiful. We will most definitely be returning!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Lea O.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1329609600000,
        "ReviewContent": "LOVE THIS PLACE! Great under new ownership! If you want something original; come to the Fireside!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Gina H.\", \"AuthorLocation\": \"Seattle, WA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1329523200000,
        "ReviewContent": "I have to say I was so surprised I liked this place but it was Amazing! FIrst night I walk in the bartenders are so friendly and welcoming and they make great drinks umm yummy. The overall ambience of this place is warm, cozy fire, laid back but upscale. It's a hidden gem in Alameda. When I first walked in I met a guy named Keali'i from Hawaii  and he was so nice to us talking story with us which is always a great sign to me because I am from Hawaii so it made me feel even more at home. Reggae band on a friday night even better! I can't recommend this place enough",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Desiree L.\", \"AuthorLocation\": \"Honolulu, HI\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1329177600000,
        "ReviewContent": "Fireside's got such a great vibe to it. It's not divey, hipstery, trendy, or whatever other -ys you could come up with. It's a neighborhood bar through and through, one where the bartenders pour your drinks strong and locals come and go as they please.Besides, with \"Vertigo\" on the tube, Orange Kush Ale in my hand, and friends at my side, what more could you want?",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Casey S.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1328572800000,
        "ReviewContent": "This is one of my go to bars in Alameda. They have great beer, spirits and great atmosphere . the only thing that sucks is the wine list. Come on ladies can we get a little more of a selection.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"martin k.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1328486400000,
        "ReviewContent": "This might be the best bar in Alameda.  First and foremost, great drinks.  Could use some more beers on tap, but there's an entire fridge full of delicious bottled microbrews for $3 a pop - can't beat that with a stick.  Full bar, quality booze and mixers (and the knowhow to mix 'em right).  Besides the drinks, the decorum is great - fresh paint, new floors, good furniture, art on the walls.  The owners are fabulous people, and the patrons are quite enjoyable as well.  A very diverse crowd, without most of the riff raff whose drunken dealings drive most of us out of the bar at an early hour.  A great place to stop in for a drink or spend an evening, especially when there's a band (BarChords!).Cheers!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"e b.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1326758400000,
        "ReviewContent": "Great neighborhood bar- great beers- great and imaginative cocktails.  I've lived on this side of Alameda for 15 years- and it's the best thing that's ever happened to the West End!! Apple-Jack, Moonshine Hot Toddy!!!  Are you kidding!  Super YUMMY!  Yes!And Taco Trivia Tuesdays!!!  Come on!  Major fun for all!The owners are absolutely lovely people.  I'm a major fan!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Stephanie S.\", \"AuthorLocation\": \"Arroyo Grande, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1325203200000,
        "ReviewContent": "Cool bar with nice ambiance and good beers and spirits available. 2 major issues [for me]:1. every so often one bartender in particular short-pours the drinks. Seriously, a martini glass is not very big. So if the drink doesn't make it up to the rim, WHY AM I PAYING YOU $7 PLUS TIP?2. This place has a nice, classy look and feel to it (i.e. old films playing on the TV instead of sports), WHY IS THERE OBNOXIOUSLY LOUD CLUB MUSIC BEING SPUN BY AN AMATEUR DJ THAT NOBODY IS DANCING TO?If those two issues could be addressed this would be a 5 star joint, easy.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Stephen R.\", \"AuthorLocation\": \"El Dorado Hills, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1325030400000,
        "ReviewContent": "nice selection of beers on tapfriendly serviceyet somewhat pricey..good spot of alameda locals",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Max-Adam A.\", \"AuthorLocation\": \"San Leandro, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1322697600000,
        "ReviewContent": "I found this place through Yelp and thought it might be a nice chill place to hang out post-birthday dinner for the bf.  The website advertised that it was going to be 80's night so I was super excited to check it out. Unfortunately I was deceived.  I had no idea what music they were playing and they were also playing some strange, sometimes xxx-rated, old-school Tom Hanks movie. Bizarre.However, free pool, awesomely nice bartender staff, inexpensive drinks, and a huge beer selection made up for all of that.  You'll also only find a lot of local brewed and distilled stuff here too. Awesome.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kim-van T.\", \"AuthorLocation\": \"San Pablo, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1321920000000,
        "ReviewContent": "I'm reviewing this place subjectively.  I was looking for a decent sized bar I could find a corner in to study.  Based on the previous two times I'd been there, about a year previous, I thought I'd have good luck.  However, it appears this place was taken over by new owners.  I sat in the most isolated, out of nowhere corner, I had sound-isolating earphones in, a hat way low over my face, and I was very clearly buried, actively, in intense studying.  However, in one hour alone, 6 separate people came way out of their way, over to my isolated corner to repeatedly bang on the table until they got my attention, and ask me asinine questions.   All hope of getting studying done was lost. Clearly not my kind of bar.  However, not going to knock the bar down to one star, because everyone there was working was very nice, attentive, and the staff seemed to be putting a lot of effort into including all the customers in social activities, a real social kinda bar.  It was also clean, and had a solid atmosphere.  I think if I were looking for that kind of bar, I'd come back here.  However, it seems now I have to find another bar to study in.Also, 5 bucks for 1 beer is ridiculous.  And they charged me $7 for a shot of jager.  Times are too hard for these kinds of prices.  However, some clientele can clearly afford that so, again, am not going to knock them down to 1 star for that.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"logical a.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1321833600000,
        "ReviewContent": "This place is amazing. Grace was bartending and making fabulous martini's. The ambiance was lovely. The DJ was kicking ass! I would go again.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Zipporah R.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1321315200000,
        "ReviewContent": "I have been coming to this bar since I arrived in Alameda a few months back.  It is a classy joint; A free pool table, black and white classics on the TV screen.  It is a quiet little hole in the wall to get a drink, with very sociable and polite bartenders as well as patronage.  They do not have food but Webster St. has plenty to offer, so that's never a problem.  They do however offer very fine spirits and beer on tap.  They have events every so often where they made special drink concoctions that are quite good, as well as DJs playing a variety of music.  I can't say enough about how much I like this place, it's definitely my regular stop for a drink.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Douglas L.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1319932800000,
        "ReviewContent": "Update** Garlic Noodles are back!!  Not here, but still in Alameda.  At a bait shop/bar??  I need to investigate...",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Dan B.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1319673600000,
        "ReviewContent": "yay! so nice to come inside after being bounced 4 years ago.  I wish them well, the place looks beautiful- credit goes to prior owners as it was a dive hole before patrick brown renovated it.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Alisha Y.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1318896000000,
        "ReviewContent": "This place is excellent.  Free pool, nice seating, and a really incredible not-on-tap beer selection.  They had this big cooler full of tasty beers, and cheap.  I got a Purple Haze and Summer Solstice, each just $3!  For a bar, that's pretty damn good.  And with the Yelp check-in deal, that knocks a dollar off.  $2 tasty beer!  NICEThey also have free pool, and a variety of events throughout the week.  I don't live in Alameda, but I'd check it out again if I was in the hood.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Robert S.\", \"AuthorLocation\": \"San Jose, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1318809600000,
        "ReviewContent": "The place is great! The staff and owners are super friendly and attentive. My only gripe is not being open earlier on the weekends.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Robby M.\", \"AuthorLocation\": \"Benicia, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1317945600000,
        "ReviewContent": "Good place to stop for a pint. Friendly staff and decent selection of beers and hard-A. Good atmosphere, but the seating is a bit strange. I wish there were some bars with more reasonable prices. I know the economy is rough, but charging more than $4 for a beer is not that cool. Bars that charge $5.50 or some other amount over $5 should be ashamed. I don't walk around with change in my pocket and I don't want change in my pocket either! Whole dollar amounts people, stop adding cents and tax to booze. Include your tax costs in the total price and make the customer happy.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"David H.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1315353600000,
        "ReviewContent": "I've visited the Fireside lounge on a few occasions. I found the staff to be very pleasant and informative. I also liked the classic films on the flat screens. People have complained about the prices, but they have to realize that the the days of drinking on the cheap are coming to a close. And the products the ladies are serving are quality items. No Popov or Rub of the Brush whisky.(though I do have a freind who wishes they had Captain Morgan) It's good to see Webster St. come back.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Lupo M.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1311638400000,
        "ReviewContent": "The Fireside is arguably the best bar on Webster Street.  Cheers to the three new owners for taking over and infusing this space with new energy.  Past improvements are suddenly even sweeter with the addition of premium alcohol, fresh squeezed juice and inventive cocktails.  A more polished crowd rounds it out.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Camille K.\", \"AuthorLocation\": \"Lincoln City, OR\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1310774400000,
        "ReviewContent": "Great atmosphere, good local brews, my favorite place in Alameda. They actually use fresh squeezed juice in their drinks. Gotta check it out!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Eric M.\", \"AuthorLocation\": \"Emeryville, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1309824000000,
        "ReviewContent": "LOVE this bar.  Went to the Grand Opening Friday night and the Fourth of July party yesterday morning.Great (local) beer selection and delicious cocktails (they actually squeeze the fruit juice right there in front of you).  Their tap water is infused with lemons and cucumbers!  Amazing.It's well-lit and has lots of tables to sit with groups, plus a long bar with plenty of seating.Best of all: free pool.It's right on the 51A bus line, so I had an easy commute from my Oakland home.  I'll definitely be back.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"d k.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1309651200000,
        "ReviewContent": "What a Great Place.... Great place to sit down and forget about your Trouble's and just kick back ...Great Beer Menu ... Its one of those places If you don't know what you want Just let them know and they will make you something Great!!!!! Wines are Great!!!! Alameda this is what you needed ..go in check it out .The Bartenders Rock !!!.Plus the Security guy who works the Door is a hot-tie!!!!! Go in check it out !!!! You wont be Sorry!!! at All",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kealiiokekai K.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1309392000000,
        "ReviewContent": "I've been back twice since the new owners took over, and I adore it! They put in a great selection of small-batch, mostly local spirits, beers, and wines and they mix up a great cocktail. The bartenders were a hoot, the crowd was fun, and there's food nearby. CD jukebox with a wacky mix of 80s, metal, and randomness. Awesome evening out--can't wait to hang there when it's warm and the front windows are open. I remember the Fireside when the interior had been renovated, but the owner had not. It's a whole different energy now.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Synergee F.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1309305600000,
        "ReviewContent": "Wow, what at change! Over my time in Alameda the Fireside has gone from the grossest bar on Webster, to a good looking place with a terrible owner, to one of my favorite bars ever. The owners are amazing, the whiskey selection is outstanding, the whole vibe of the place is just preface, and what's that you say, there is free pool as well! I do not review often, but this place deserves it. There are a lot of mediocre reviews on here that have nothing to do with what is in this space now.  Good people, good drink, good times!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"James M.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1309132800000,
        "ReviewContent": "Sometimes there is a thirst that can only be quenched by a perfect cocktail...  and the fireside lounge really delivers. Just through the tunnel and within walking distance of some other little bars... this is a fun destination. The lighting is just right, pool table, old school jukebox, fun bartenders....  what else could you ask for?",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Heidi S.\", \"AuthorLocation\": \"Sydney, Australia\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1308700800000,
        "ReviewContent": "I love the Fireside b/c of the large picture windows that open to the street's night air! I'm thrilled that it is back open, love west end businesses and hope the new owners open it up in the morning of July 4th for Parade watching!!!    Please!!!Thanks,April Colombu",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"April C.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1308614400000,
        "ReviewContent": "It's open ya'll!  Such a wonderful neighborhood bar!  I'm glad to have discovered it.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Helen B.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1307836800000,
        "ReviewContent": "It's open! It's open!  Great beers on tap, great choices of beer for bottles, great selection of spirits!!The place has a great energy.....for any mood you might be in.I will definately be back.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jenny B.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1302480000000,
        "ReviewContent": "Reopened under new management. But I haven't been in... I hear they have karaoke? I'm giving 3 stars to average it out.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Alana D.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1289779200000,
        "ReviewContent": "My first time here, and I must say the food and the service were outstanding. We ordered the flank steak & risotto, both were yummy. And very reasonable price too. I will definally come here if i'm in the city.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"andy p.\", \"AuthorLocation\": \"Sunnyvale, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1285804800000,
        "ReviewContent": "I wonder what ASPECT of the Fireside is for sale?  I assume they don't own the building.  The name?  The equipment?It just seems to me that it wouldn't be that hard to make a success of this place.  I mean, hell, Wallys and the New Zealander stay open!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kelly M.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1284249600000,
        "ReviewContent": "For sale? Closed?I live in the West End and try to support my local businesses as best I can.I was happy that the Fireside had a \"make over\" and liked the overall result. Good atmosphere, quailty drink. Prices a little high but not outrageous. Went to the \"Peanut Butter and Jam\" webster st fair (commercial peanut butter started on webster st. Jiffy? near the Jack in the box- the Jam is the music part and tribute to PBJ) and was looking forward to a triple IPA at FI. Not open and a for sale sign.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"bob n.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1280275200000,
        "ReviewContent": "Came here to help celebrate a girlfriends birthday. It was a fine place-the company was great but the music was crappy. We finally noticed a juke box and that made the tunes better. The bartender made decent drinks but seriously, if you have peanuts or pretzels or something, hook a big paying table up. This being said, the goldfish crackers I saw and asked for went really well with my Cosmo, but not as good as the Mexican food from next door!Plusses for nice clean bathroom (one seater) and for having pool tables for those who care to play!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Tam F.\", \"AuthorLocation\": \"San Ramon, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1278806400000,
        "ReviewContent": "I agree with my boy, Todd B. This place should be more poppin. Even on a Friday night, it was nearly empty expect for our sizeable group. But I had a great time. The bartender took care of me well with good vodka/tonic's. They have plasma's everywhere, a pool table, a foosball table, and a piano. It's also a very nice place inside. Definitely a good spot to hit up for some beer/drinks, before a night out.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Andrew T.\", \"AuthorLocation\": \"Las Vegas, NV\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1276646400000,
        "ReviewContent": "I love The Fireside Lounge. Besides the sheer fascination I have for the beautiful bar, the owners/bartenders make my boyfriend and me feel welcome every time we go.  I have never had a sour experience there; in fact, it was one of the first places in Alameda where I felt welcomed. I live close to Webster St and have seen how dead the nightlife can be on a week nights, so I really can't blame the owners for having limited hours.  Recently, The Fireside has gotten even better: Dollar Taco Thursdays, Five dollar glasses of wine on Wednesday, and great music on the weekends. I would recommend this local bar to anyone who is looking for a casual bar with great beer and wine selection, friendly faces, and vibrant energy.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Krystal A.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1275955200000,
        "ReviewContent": "I had a few cherry mojitos and a couple of the amazing coconut margaritas. The bartender chick was ON her game...and she claimed not to be a regular bartender. I sure as hell hope she's working it again when I return.I don't remember too much more about that night... I just know it was fun and the drinks kicked some serious ass.--------------------------Update:If I could bump this place up a star or 2, I totally would.They made my birthday a very special day and every time I come in here, I have a great time drinking and chatting with friends and other regulars.I have noticed that there are a few peeps that the bartender and owner are just not cool with & I've seen them ask folks to leave for various reasons. But, not me.. no no, see, they like me and I am treated like Alamedan royalty when I come in here. Others.. meh, not so much.Sucks to be them. :)",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"T A.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1273881600000,
        "ReviewContent": "Nice lil place real quiet and great drink selection. I like the location. Drank with alot of cool strangers lol",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"kris v.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1269907200000,
        "ReviewContent": "If I could give this place a ZERO stars, I would but Yelp only allows one star.  So if you can see from my ratings, I rarely give 1 stars to ANYTHING but I've got to say this place deserved it.  3 of my friends and I walk into the bar on a Friday night around 12am.  We were NOT intoxicated at the time, in fact we had just met up to START drinking at the Fireside Lounge.  Here's is an reenactment of what happened.We walk in and there are about half a dozen people @ the bars.  We ask the bartender what kind of beers they have to which he responded \"they're all over there\" (gesturing to a fridge with a bunch of beers).  Yes there was a sign that said no self-service BUT we assumed that if you point us in the direction of the beer it would be okay to grab our selection and pay for it.  No at this point, the asshole (aka bartender) decides to pull a power trip and accuses us of being intoxicated and used his \"right to refuse service\".  We all thought he was kidding until he escorted us out of the bar and locked the door behind us...all because we picked out the beers we wanted?!?!So after all that, I've come to the conclusion that the owner (bartender) is a complete douchebag and I don't understand why anyone would patronize that bar!  Perhap he just has a hatred of asians? I don't know.  Maybe it could have been the fact that half our group was asian?  I have no idea but don't come here- they deserve to close down.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Ann H.\", \"AuthorLocation\": \"San Diego, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1269648000000,
        "ReviewContent": "Despite the angry reviews for Fireside Lounge, I decided to check it out with some friends since I just moved in down the street. My thoughts on the place can be summed up in this 2 minute dialogue that occured.After putting our stuff down and asking the bartender a bit about the local beer on tap, I decide to go for something lighter... me: Do you have any bottled beer?bartender: (points to fridges next to bar) There are 100 kinds of bottled beer.For a second i get excited because this starting to seem like an awesome place. There are signs that say \"No Self Service\" but the guy just pointed me over there so I figured I should bring my choice to the bar to pay for it.bartender: Did you see the sign?me: Well, yes, but didn't you just send me over there to pick one?bartender: No. Have you been drinking tonight?me:  I had some wine earlier... (It's 11:30, not very early)bartender: I am going to refuse service to you, i'm closing up now.My friends and I look at him, like \"Are you serious?\"bartender: Yes. you are intoxicated, I am closing up. He went to the front door and startind to lock it up. There were still 6 people sitting at the bar, but we were being kicked out.I still can't believe this actually happened. Being kicked out for picking out a beer of a fridge after being directed to do so. What a jerkface! I was just planning on having a chill night with some old friends and we were kicked out and locked out! Never again.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"liz c.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1268092800000,
        "ReviewContent": "I want to like this place. I want it to be my  neighborhood bar.  The remodel is nice, They have a Decent booze selection. They have a good beer selection.However My  problems with this place.They post hours that they do not keep. March 5 th 8 pm they are CLOSEDWhat kind of bar is closed on a Friday and this is not the first time. 2 months ago I tried going on a Saturday night CLOSED also. So beware of hours posted. The Bartenders are average. Wonder if the guy just uses it for a tax write off  because he won the lottery or he is a trust fund baby. Do your business district and your neighbors who want to go out for a drink sell the place to someone who cares and wants to own a bar.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Patti j.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1265068800000,
        "ReviewContent": "Love this place.Friendly patrons, excellent bartenders, reasonable prices (with exceptional specials) and owner is super friendly.Not to mention, the beer selection is immense. Solid and dependable draft selection, as well as an insane No. of bottles.I used to be so-so about this place, but since then the owner has really kicked it up a notch and made sure his guests feel right at home. They've even started giving out twitter-based-specials (@FiresideAlameda)!Good music, great people, solid drinks. Step in and give it a shot.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Casey W.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1264982400000,
        "ReviewContent": "Shoulda, Coulda, Woulda...Should of been a good night.Could of been a great night.Would of went somewhere else had I known.Came here for a birthday party over the weekend... and things started off promising. Good music. Good selection of drinks (although they had a sign for Hoegaarden beer yet none on tap). Nice sized place (so I thought).Well, at about 11:00pm, turns out the party went over capacity for the place... which I guess is 50 people according to the guy in charge. The music was stopped and people who did not have drinks in hand were told to leave. I guess if we were all packed in there like sardines, this would of made sense except for the fact that it wasn't even crowded. I've been in bars and clubs where you have a hard time just moving around and this place was far from that point. After some people left (it seems they stopped serving alcohol at that point), the party limped along for another hour before house lights were up and music was cut.In the end, night was over just as it was getting going. Disappointing.Well, this place has potential... for the anti-social people who fear large crowds.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Mike A.\", \"AuthorLocation\": \"Daly City, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1264896000000,
        "ReviewContent": "1st time here was for a Birthday party. The night started out pretty cool, maybe 15-20 people showed up between 9-9:30 and were just chilling. Bartender was very friendly and nice, but seemed to get a little overwhelmed as the place started to get busier. The guy who I didn't realize was the owner was bar backing and didn't really lift a finger to help with drink orders. (Two bartenders hustling could have handled the group, but one bartender was never going to get keep everyone served) It seriously was taking 15min+ to get drinks (some people weren't even getting acknowledged) Then about 10:45, the owner stopped everything and asked people to leave because he was \"Over Capacity\" (There were maybe 60-70 people in this place) and sounded like he was complaining that he had run through a case of vodka in an hour and a half. (Last time I checked, that was the point of a bar to sell alcohol) He more or less ordered anyone that didn't have a drink in hand to leave to help reduce the risk of them getting a fine that he was not going to pay (within his right as the owner to reserve the right to refuse service to anyone, but I just didn't get the whole rationale of things) People complied and then 15 minutes later the bar stopped serving all together and they started putting up the chairs. Needless to say, the evening was cut short, it was fun while it lasted and I've never heard of a bar not being allowed to have more than 80 people in at one time. It was bizarre... I felt bad for the two regulars that stopped in but couldn't pull up to the bar because our group had it locked down, but heck, it was one night and they could have stayed...This place maybe cool on regular nights, but this experience turned me off to it... it was just bizarre to me. Atmosphere was cool, but it didn't seem like they wanted the business. Even if the group was around 50 people like the owner said he \"was told would be in attendance\" he still wasn't even trying to keep that many people in drinks.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Mark T.\", \"AuthorLocation\": \"Arden-Arcade, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1264896000000,
        "ReviewContent": "This place blows - our friend just had his 30th birthday there - and well after telling them 2 months in advance and setting everything up - in middle of the party mind you it's only 11:30 they cut alcohol service because they were over capacity and well let me tell you there was so much space in there - I can't even believe that their capacity is that low. Oh and guess what hella people left and then still no alcohol service oh and to top it off then they shut down the bar - way to ruin my friends 30TH birthday - THANKS FIRESIDE LOUNGE YOU SUCK. And p.s. If I could put negative stars for a rating I would but unfortunately you have to have at least one star so there u go",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Lisa M.\", \"AuthorLocation\": \"San Ramon, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1263340800000,
        "ReviewContent": "D had been whining about wanting to play pool so I, fabulous partner that I am, went on Yelp to find somewhere we could shoot balls. Cheap date that I am, I wasn't really trying to go somewhere that charged more than a few bucks per game (some places were $10+/game!). This is how we ended up at Fireside early one afternoon. I hadn't bothered to check their hours and if it had been a different day we would've arrived to find ourselves staring at a locked door, as they usually open at 4pm. However, the fates (and NFL or NBA or whichever happens during Fall) were working with us that day and Fireside was open early to show the game.The bartender, who I'm pretty sure was the owner, is very friendly and let us sample various beers from their great selection. I don't remember the name of the one I had but it was a caffeine-laced stout and was very tasty. Between the alcohol and the caffeine, my body quickly reminded me that I hadn't eaten anything all day (don't worry, we hit up the El Novillo truck after leaving Fireside).Because there were only a few guys sitting at the bar, D and I had the pool table all to ourselves. Not having to wait for others to finish and not having an audience to watch me fail miserably were bonuses to the pool being FREE!It was a little chilly in the bar and they had a space heater set up, which was so kindly pointed in the direction of the pool table. My skinny ass really appreciated that. I would love it if the fireplace were in use and if there were more places to \"lounge\" - it is called the Fireside Lounge, after all :)",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"kristen m.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1261699200000,
        "ReviewContent": "This place blows.  There is never anyone there!  It has to be because of the douchey staff.   I wouldn't mind if they were dumb as a box of rocks if they were at least decent to look at - they are repulsive!  And their attitudes don't help them or the establishment.  The owner needs to wake up and take some notes from the successful bar owners in the area, such as Lucky 13 or McGraths.  Every other bar in town will be packed on a late Sunday afternoon except for this one,",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Lynn H.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1259712000000,
        "ReviewContent": "We fell into the Fireside late one night after dining elsewhere in Alameda. My friend is an enthusiastic fan and patron of the place. It was my first time there. After being served some pretty dismal alcoholic concoctions all over Alameda, it was a pleasure to be served by a truly talented bartender who takes his work seriously. I ordered a lemon drop - with gin, not vodka. Friggin' fantastic! I had completely given up on ordering this relatively simple drink at any bar since everyone screws it up so badly. Why is it that all of a sudden every fool thinks he/she is a \"mixologist?\" NOT!!! But there's a true cocktail artist at work at the Fireside. Add great prices, cool vibe and comfy atmosphere with all kinds of wonderful people, and what's not to love? They deserve to be busier. Hope the word gets out 'cause this place is a jewel.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Blue S.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1259712000000,
        "ReviewContent": "1996-1999:This was like a second home to me.  It was a dive.  It had a beautiful Budweiser Billiards Lamp fille with dust and a old Telephone booth. THe bartenders were far from friendly, but that added to the ole' character of the place.  We sang karaoke on certain nights and played pool on others..all while being completely plastered from their heavy-handed pouring.  Our saving Graces were the Doggie Diner and Nations Giant... It got tiresome when the bartenders would get more drunk than the patrons....I phased this place out cuz the abyssmal downturn wouldn't let up.Today:  Suddenly I'm hearing a lot about this place from people all over the Bay Area...I kept thinking \"they can't be talking about THAT Fireside!\"  I finally entertained my curiosity and looked it up.  Even the Pictures of the place weren't recognizeable to me, until I saw the ole' Firplace and The Sign.  Mind you, I've had NO reason to drive through Webster in the past I-don't-know-how-Many Years. Yep, it's THAT Fireside.  I might have to check it out now.  I'm guessing by the pics that the bartenders wouldn't even recognize me, because they were most likely not 21 yet when I hung out there!  Please be nice to me guys!  I'm a good tipper! =)  Oh, do you guys need a Karoke night there? hahaha",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Gio G.\", \"AuthorLocation\": \"San Leandro, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1255996800000,
        "ReviewContent": "This is my 1st ever review and may well be my last, but I had to write after reading some of the idiotic and false reviews about the Fireside. Who are you people writing about roaches and bad service and giving 1 star reviews??  You sound like bitter, angry, and pathetic people with too much time on your hands.  (Are you confusing this bar with the scetchy Shamrock or Wallys or the weird Pacific Island Club?)I have patronized the Fireside many times and have ALWAYS had a great experience. There is a huge bottled beer selection, a few really good tap beers, a friendly staff, and free pool. In addtion it is very clean! I have been to my share of pubs and bars and this is one of my favorites. Great ambiance, great people, with a nice local feel to it.  So ignore the angry reivewers and check this place out.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Eric F.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1255737600000,
        "ReviewContent": "As I was waiting for a sushi order, and I realized that in 6 years I have never set foot inside this place.   If you like free pool and an above average selection of beers (mostly bottled), you'll like this place. I had a Toña, which is from Nicaragua.  It went down very smooth.  And for $4, I felt that was about right.I would think this might be a good place to catch the Sharks and have some decent beersFor some reason, I had avoided this place (maybe because they showed up in the police blotter or something), but it was actually very, very tame on a Friday night (at 9 pm).    I don't know if they have changed ownership in the last 6 years, but I was expecting a crazy crowd.And, yes, they have a fire place.  Don't know if it is a working one.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Will A.\", \"AuthorLocation\": \"Raleigh, NC\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1254960000000,
        "ReviewContent": "Never coming back because the guy working Thursday nights is a douche.We went on a Thursday night after a softball game victory to celebrate.  There were only 2 other patrons there.  The 8 of us spent quite a bit that night on pitchers of beer.  At least one pitcher for each of us.  At around 1:30am we were ready to leave and I asked the bartender for a pitcher of water to help sober everyone up.  He flat out denied us water because he wanted to close up early and didn't want to wait for us.",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Sam W.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1252972800000,
        "ReviewContent": "When I first walked into Fireside oh, around 3 years ago, I was immediately struck with just how fugly the inside of the bar was. I mean, I love a good dive bar; but the metal band in the tiny interior was enough to make my ears bleed (my eyes were already bleeding from how it looked), so I wrote Fireside off my list o' Alameda haunts.Skip ahead to today, and you have a tastefully decorated, homey, inviting place with WINDOWS (which sure as heck weren't in the original Fireside), free pool, and bartenders with personality (and yes, I too, like so many of the others here, like Alan with a passion). Tons of very interesting beers, and at least 10 or so bottles of wine at any given time. Plus, I caught the tail-end of the Raiders/Chargers game yesterday (ouch) and the place was actually pretty rockin'!I will reiterate others' sentiments about how quiet the bar is, though. I hope the Webster Curse (see Aquacotta) doesn't wear off on Fireside! I'd love to see the bar full of patrons more often.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"wildhippychile d.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1251676800000,
        "ReviewContent": "I keep on wanting more and more people to hang out here, but it always feels a little flat.  Nice folks working there with great beers.  It's a bit on the pricey side and I wish they got the kitchen going as once planned.  A classic bar in the making.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"I love the East Bay p.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1248652800000,
        "ReviewContent": "I'm dating a nice boy who just might spend more time at the Fireside than in my bed.  But that's okay, because I love a bar whose proprietors have a passion, and at the Fireside, it's cultivating a vast and interesting selection of beer that would compel even the daintiest of girls to throw a few back. Five stars for coaxing me beyond Hangar for a change, and for the delightful company of Alan and Chris behind the bar.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Vanessa C.\", \"AuthorLocation\": \"Kensington, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1247788800000,
        "ReviewContent": "This place should NOT be as quiet as it is. I'm worried that it is not gonna do well enought to survive this economy....3rd time here and it's always empty, but the beer selection and nice decor make up for it. Just don't come here expecting a crowd of a selection of women to peep game at. I seriously wish my San Jo friends lived near this spot so we could give it more business. But it is near my house, so I'll do my part and hit up the various bottled microbrews...If anything, they could step up their wine selection, maybe bring in more females that way. I think our bartender was Alan? Nice guy, good service, I just wish it wasn't empty, maybe if it was on Park St?",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Taj A.\", \"AuthorLocation\": \"Los Angeles, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1246579200000,
        "ReviewContent": "This place is just a couple blocks from me so it makes it convenient to ride my bike to. They have an AWESOME beer selection and make some pretty awesome mixed drinks as well. They do have a pool table in the back and some cool couches and table to sit at with your friends. It probably would actually handle groups really well too.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Tracy W.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1245628800000,
        "ReviewContent": "Great place for Alameda. Decor is neat and the place is redone. They have a HUGE selection of beer. The place is easy to miss though unless you are looking for it. Parking is easy, got a spot right out front. There are some pool tables in the back, and neat furniture in the front. One of the few cool going out places in Alameda. Nice bar. Would recommend.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Ahmed S.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1241913600000,
        "ReviewContent": "Wow. Executed perfectly. Places like this make me want to move to Alameda. The modern decor, the sleek intimate tables, the chill hang out area in the back with the pool table make it perfect for a date, or for a group, or a must pit stop if you're doing an Alameda pub crawl. The vibe is relaxed and yet hip without even trying. The blues jazz playing in the background complements the super diverse crowd. The scene is set for some good times. Once inside, if you don't find any of the beers on tap that entice you, which I doubt, make your way to the back of the room where they have the coolers. The coolers are where they stock their beer collection that even puts Bevmo to shame. You just need to point out which one you want to the bartender.All sorts of Trappist ales, organic brews, local brews. I opted for the Rochefort ale. The bartender said it must be served in the traditional goblet, I obliged and walked around with my goblet and felt like a million bucks. Jean Claude Van Damme aka The Muscles from Brussels would approve of the Belgian brew selection here.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Earl G.\", \"AuthorLocation\": \"Burlingame, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1240358400000,
        "ReviewContent": "Ahhhh, yes, my new neighborhood bar.  Friendly warm and welcoming as their namesake suggests.  For a beer lover like me, it is a small haven on an otherwise lame street.  The free pool is just a bonus.220+ beers in bottles, and another 10 taps with constantly rotating kegs. I don't know if I should be proud or ashamed that I have a few suggestions for their cooler... Hmmmm...The only thing really missing from this place is a good crowd.  Oh, and perhaps an actual fire.  Friendly barstaff who remember my name, and have figured out already that I never really order the same thing twice, as well as pleasant ownership who are actually here, playing pool and hanging out in their establishment, enjoying a warm spring evening.  It is definitely a neighborhood spot. I hate to shuck off a star due to the lack of a crowd, but perhaps this review might help that.  Much like Alameda itself, the Fireside is an unknown little gem in the Bay Area.  One part of me hopes it will stay that way, and another hopes that I can swing by on a weekend night and see more than a dozen faces drinking and being merry.  Just because I'm a beer drinker doesn't mean that I overlooked the full bar... they have firewater for you boozehounds too!  Oh, and free Wi-Fi... I'm actually here now writing this over a nice pint of Drakes IPA, but if you want one, you better head down because next week there will probably be something new in it's place... I just wish they would have kept the Denogginator, as it's one of my faves.If it's beer you crave, and like variety, a warm atmosphere and friendly bar staff... pop through the tube or over the bridge and make your way down.*protip: If everyone who stuck their head in the door and decided it was slow chose to stay for a pint, it would have this place rockin', so don't just poke your head in, stop in for a pint.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Shawn S.\", \"AuthorLocation\": \"Austin, TX\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1240185600000,
        "ReviewContent": "We stopped by here on a Thursday night and it was crowded at the bar but plenty of room over at the table. It is a beautiful space, not at all what you might expect on Webster St. I'm giving it two stars because my drinks seemed expensive for 1) Alameda and 2) Webster St., and for the price, they were very small. They were matched in size to the votive candleholders on the table! Also, the drinks sucked. I got a drink from each bartender and each was awful. Either too strong or too much sour mix (got a Midori Sour and a vodka cranberry). If you're a beer drinker, then this is your place. They seemed more reasonably priced and they had a ton of selection.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Latisha D.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1240099200000,
        "ReviewContent": "Wow, this place has changed since I last passed through the door.  For the better. It's now a fairly serious bottled-beer bar, with a loft-like open design that makes the place seem a little barren when not crowded, but helps absorb the noise once a crowd picks up. The bottle selection is conventional yet extensive, but what matters is that the folks running the place are serious about beer. Want to talk homebrewing and the ins-and-outs of how second-tier brands are distributed? Want to figure out the best glass for an Alt? Come in during off hours and talk about the product.There's a lot of potential here. Add some wild cards to that beer menu! Go for the Euro stuff that's harder to find in California, especially the British bottles and more of those great German imports. Take the customer on a world tour. Yeah, our local stuff is great, but we need the New England-Britain Axis and the German-Czech Conspiracy to really represent in the East Bay, and this place is in a position to make it happen.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Matt R.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1239926400000,
        "ReviewContent": "Fireside Lounge has it going on! Perfect location on Webster, but be careful, you may miss it. I'm not sure if the sign lights up or not, but it took a second for us to realize where it was. Once inside, the guy at the door checked our IDs, and gave us a super friendly Fireside welcome. The atmosphere is on point: perfect lighting, comfortable room temperature, just the right volume for the music, and a great bar & staff.They have an amazing selection over 200 beers, along with wines and spirits, and all the BEST kinds. I love that they have a great selection of microbrews and local craft brews, not supporting the conglomerate giants that are Bud-Miller-Coors, though I did see one Bud in the cooler, I'm not sure if the rest of them were. The best part, is the prices aren't bad for GREAT beer.Make sure to check out the Fireside if you're ever in the area, or want to visit a really rad bar. I will definitely be back, soon!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Mace M.\", \"AuthorLocation\": \"San Lorenzo, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1239926400000,
        "ReviewContent": "That's one helluva beer selection.I mean, seriously.Damn.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Gwen H.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1236470400000,
        "ReviewContent": "Classy and chill. This bar is welcoming and well designed. I've been in quite a few bars and this one has something the others don't have, but I can't quite put my finger on what it is. The pool table is free...that's a big plus for me. The drinks are reasonably priced for how well they're made.Bartenders are friendly and pretty good about serving in the right order.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Dominic M.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1236470400000,
        "ReviewContent": "I feel really really bad for this place.  Fireside has reinvented itself as a nice, classy, comfortable place to drink and mingle with good people.  UNFORTUNATELY it's on Webster.  Now...I live near Webster and love Webster for the dive bar shit hole gas stop that it is.  However, I would never ever think of making a night here.  If Fireside was on Park Street then it might have a chance.  As it is...I say good luck, I hope you do well, but me planning on going there is a low 15%.  Cheers though....",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Sean S.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1235952000000,
        "ReviewContent": "AMAZING bottled beer selection!!!! I just wish they would hurry up and get some kind of bar food in there. The food they had back when the owner was cooking, wasn't anything exciting and over-priced, but now they don't even have a snack for while you're at the bar! I still LOVE the atmosphere and is definitly my favorite bar on the west side. I'm not the biggest fan of the new bartender. There use to be a couple guys and girls, but now it seems to be just the one guy and he has no personality and no patience.........give me some food and a more lively bartender that's a little faster and you'll definitly be a 5-star! They have pretty good deals occassionally too!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"K.A. S.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1235865600000,
        "ReviewContent": "When I was a kid, my parent's local was a place in our good old Capitol City called The Fireside Lounge. This was back when folks could bring their tykes to the bar, set them up with a few quarters and a tabletop Ms. Pacman and go to town on their Manhattans, Martinis, and Tia Marias. Drinks were served in tiny old fashions and skinny highballs. The bartender could get your folks a good deal on a side of beef, wholesale. And of course, everybody knew your name. Which could end up being a problem sometimes, I suppose. We had my dad's retirement party here, after his 45 years of servitude as a newspaperman in a dying trade. I ate my first lobster tail here in celebration of my 2nd place win in an essay contest. This place was witness to the first time I got drunk with my mom not long after my dad passed away. And it was witness to the two of us stumbling home together to compete for first rights to worship the Porcelain God. Sadly, that Fireside has been replaced with a Starbucks and a One Hour Martinizing. Yes, it's true, you can't go home again...So I suppose I stumbled into this Fireside with a few nostalgic notions in my mind. Happily, I was not disappointed. We were immediately greeted by a friendly bartender who let us taste a few beers on tap before we made a decision. No offer for a wholesale side of beef, but that was okay by me. My Martini was dry, icy, and well-shaken. We played a friendly game of pool, during which I am happy to say I did not embarrass myself. The music was cool - Johnny Cash, Curtis Mayfield, and some other stuff that made me happy but did not intrude on our stimulating conversation. The bartender politely closed our tab, asked us our names, and shook our hands on our way out. Then we stumbled across the street to Lucky JuJu and spent the rest of the night drunkenly multi-balling away. A nostalgic night to remember.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Delilah P.\", \"AuthorLocation\": \"Vallejo, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1234828800000,
        "ReviewContent": "Dope ass bar, tastefully remodeled within the past year.  The beer selection is outstanding with many local beers, a good wine list, and an even deeper bottled beer selection.  The owner, Patrick is super cool, and I feel at home in the Fireside!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Dick N.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1234742400000,
        "ReviewContent": "My wife and I became big fans of this place during this past summer.  We just moved to Alameda and were looking for that place we can go after work for drinks as well as on a Friday or Sat. night or to watch a game.  This is that place!!  We went for Super Bowl Sunday and had free BBQ provided by the Fireside, drink specials & great Beer!!  I am from NYC and am a bit of a bar snob so I am so happy to have a place like this to come to where the service is great, the drinks are awesome & cheap and they have FREE POOL!! I decided to have my B-day party there last week and I have to say it was Great!!! DJ, Great Food, Drinks and Dancing.  If your thinking about having a B-day party for some close friends, this is the place.  Cristi and Patrick were accommodating and very giving.   OK I can go on forever, this place is great!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"John F.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1233360000000,
        "ReviewContent": "I'm kind of bummed that they changed the atmosphere of Fireside to add the Gastro Pub.... Fireside use to be a hip little joint and now it's got more of a restaurant feel. More under raps and quiet.... The menu looked interesting, but I wasn't there for food... I was there for drinks and was craving the coolness that was the Fireside. Oh well.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Martine F.\", \"AuthorLocation\": \"Ventura, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1232582400000,
        "ReviewContent": "One star for free pool, one star for EXTENSIVE bottled beer selection. That's about all this bar has going for it. When you first walk in Fireside Lounge looks really upscale, think lounge room in a mansion(that's right they have crown moulding in a bar...) until you look a little closer and see that the place has big unpainted sections in the middle of walls and missing sections of crown moulding. No big deal though right? I mean maybe they're just in the middle of remodeling and want to remain open throughout... Then you see the three large cold cases in the back stocked with just about any beer you can find at BevMo and then some. BEER HEAVEN! All is forgiven! However, when you order shots for your friend for her birthday you will find that the bartender is a huge tool, and doesn't know how to make most shots you order. A red headed slut is that hard to figure out?! Well yes, but not when we're talking alcohol. ZING! Bottom Line: If you're lucky(or early) enough to get the single pool table locked down, you could have a good time here... Just as long as you don't have the beertender do anything more complicated than shake your appletini or pop your beer top. For me? I'd rather make a run to BevMo and buy the whole sixer for the price Fireside charges for one bottle...",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Greydon U.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1231718400000,
        "ReviewContent": "My friends and I were about to stop in to have a drink at the Fireside and shoot some pool, and when we got there it was was closed and it was on a Sunday night around 8pm.  I don't know if its every Sunday or what but it was weird to see a bar/lounge closed on a Sunday night.  I would love to go there when it is open and it said on the review it is open on Sunday but when we went there last night (Sunday) it was closed.  What's going on here?",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Dale Y.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1229990400000,
        "ReviewContent": "I've only been once (stopped in and had a Linden Street Ale! Wow! That was good...) I'll be back for sure. They have what looks to be a nice selection of wines, they specialize in cocktails, but when I went in back and saw their bottled beer cooler - man, I started hyperventilating. The atmosphere seems nice... Check it out.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Peter A.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1227398400000,
        "ReviewContent": "I never knew about this place when it was a dive, but it's quite nice now.  High-top tables, pretty glasses for your beer (a very large oatmeal stout for $5?  SWEET) and pool tables.  You can see the remnants of the dive-y-ness, but it's a fun place to hang out wtih some friends when you'd actually like to be able to talk to one another over the music.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Caitlin M.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1220227200000,
        "ReviewContent": "So the Fireside used to be one of the most disgusting bars on the island, considering it smelled like vomit and the people there looked like they were on the verge of homeless-- if they weren't already. But after a closing period, it re-opened with a thick coat of fresh paint (that didn't get rid of the vomit smell), some new fixtures, and a single man that was so rude I'm surprised his ego fit through the door. Let me tell you, it was nice that the bar had a pool table and all, though it wasn't plumb-- it leaned to one side and was a wreck. The beer was cold, yet overpriced. Don't even think about the liquor there, if you were being served by the Owner/bartender extraordinaire there was hardly any in the glass and I think he charged some people less than others! On one occasion I asked for a fruity drink selection and he quipped back with a snide remark about the \"extensive imported wine and beer collection\" if I couldn't find something there, go elsewhere. So I did. (Another bar with a similar name on the island recently opened, I find it enjoyable!) Needless to say, I went back once and still hated it. This weekend when I was driving past the place it looked as if the Fireside had a little run in with some, um, FIRE! Oopsie. Looks like the place had a little bad karma!!! Maybe it was in some hot water and won't open up again!!",
        "StarRating": 1,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"katie a.\", \"AuthorLocation\": \"San Pedro, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1218153600000,
        "ReviewContent": "True story- I thought someone died at the table next to me.  So I'm drinking my drinkie, talking to some asshat about something, and the dude at the next table over is slumped in his chair, left arm lethargic on table, and drool pouring down his tie.First thought- uh oh, some dude died because of absinthe.Second thought- tell someone.  So I told the lovely bartender, who told what apparently was the owner (and also an EMT or something), who called the paramedics, who whisked the poor man away.  Then the bartender gave me a free drink for bringing it to her attention.  That's great customer service.  Drinks are so-so, but it may have been the distraction keeping me from remembering anything stellar.I want to go back.DYL, anyone?",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Pam S.\", \"AuthorLocation\": \"Boston, MA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1217635200000,
        "ReviewContent": "Much more classy interior than its outside seems to indicate. Only one pool table so don't go planning on pool unless it's an off hour.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"douglas s.\", \"AuthorLocation\": \"Berkeley, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1217289600000,
        "ReviewContent": "Vino, vino, vino!!I spend way too much time with friends at bars which cannot supply a decent version of my beverage of choice - fermented grape juice.  Thank god the Fireside is close now.Leave it to Alameda to provide me with a semi-dive bar with a halfway decent wine list.  Add to that good service, a comfortable atmosphere and a scary-close proximity to Nation's (wait...), and this becomes a 4 star place.  Add this to the things I love about Alameda.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Suzanne B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1217289600000,
        "ReviewContent": "i'm such a geek.(text alert)boy: yo it's ___! wut up, i'm in yo set. come to fireside. b here til midnite.me: really? yay, i wanna see you. why are you chilling in a tire shop for that long?boy: what??me: what??(10 minutes later)boy: fireside is a bar, fooh! i think u mean fireSTONE! hahahahame: oh! hee. okay be there in a bit. do they serve chimay?boy: what??me: what??(5 minutes later)boy: nah, they don't serve any food.LOL!anyway, i get there and lo and behold, there is a pool table and a chill vibe. the bartender was attentive and the crowd is fairly mixed, which i love. and anyone knows that a motley crowd DEFINES a good dive bar. also, the mexican restaurant next door has slamming carnitas tacos (al carbon). ooh, and that night i met a former member of the delfonics! or was it confunction? ahh, balls. anyway, he truly blew my mind that time, yes he did. always a good time with great people!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Vanessa D.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1216944000000,
        "ReviewContent": "If you have not been to the new Fireside (1453 Webster St # AAlameda, CA) it is a great place to settle in to have a Cocktail. The old Fireside had a lot to be desired but new owner Patrick has cleaned (that's a first for this place), painted, remodeled and made it a great place to stop after work or any night of the week.My first encounter with the Fireside was 1980, long ago when sailors still roamed Webster Street and Ladies of the evening were hailing distance from the Fireside. I was 15 and it was a place that would serve me a beer. I was so nervous that the only thing that I could order was a Bud. Patrick now serves probably 30 types of beer now and that choice no longer has to be an option.See my complete review: http://cocktailcocktailscocktails.blogspot.com/2007/12/fireside.html",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"John O.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1215648000000,
        "ReviewContent": "I LOVED this place!It's not too bright, not too dim. It's clean, but still feels like a bar. There's a dance floor and there was live music the night I went (my birthday - I got a song dedicated to me!). The bartender was fantastic and really nice. I went for the absinthe, but the white russian and the miami tea that my friends ordered were both delicious.Basically, this place is awesome. Yes, it looks like a dump from outside and then it's really clean inside. I like cleanliness. It was really rad.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Kyran M.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1212624000000,
        "ReviewContent": "I really liked how this place looks like a dump from outside, but then when you go in it's actually slightly classy. Props for having a million beers displayed in bottles on the light up bars.  My friend's Grolsch was big & cold.On a recent Friday the bartender did not know how to make a drink to save her life. She almost poisoned my friend with the amount of Chambord she added to her sparkling wine and my whiskey & ginger was watery as all get out. Some of the crowd here was annoying, especially the drunk guy who would lift up his shirt and flick at his nipple to distract his friend while playing pool, then go make out and dance awkwardly with her and her friend. The crappy phoned in R & B was too loud and all the pictures of sailboats from the 80's was just, weird.Good try Fireside.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Cory G.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1212192000000,
        "ReviewContent": "Sweet brew of the gods.  They have some great draught selection in here.  And check out the lambic on tap!  Do not, however, be fooled by the display of bottled beer they have at the end of the bar.  They do not have them all.  Theres a decent mix of people here, young locals and some trendy hipsters.  Some older folks sipping wine.  Swanky decor, comfy leather couches and not too loud not too soft music, one standard pooltable with free play and some pro looking cuesticks.  A stately fireplace at the far end keeps the bar true to its name.  Artifacts of note include the historical map of Alameda above the fireplace.  All in much in contrast to the divier Shamrock pub at the end of the street.  Post last call, there is always Nation's for your drunken hunger pangs.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Marjorie B.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1207353600000,
        "ReviewContent": "They have Lambic \"pomme\" ale !They also have HINANO Tahiti beer !Olivia is an awesome sweetie cutie pie bartender !Love this place !",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Mark Z.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1205625600000,
        "ReviewContent": "Just discovered this spot when I attended a birthday get-together there.  We actually drove right by it the first time since the spot has no windows or clear signage.  Literally had to park the car and find it by looking at the individual street numbers on the neighboring shops.  Once we found the place, we stepped up to the door and thought we were about to step into a total dive bar.  Upon swinging open the heavy door, we were shocked by how totally hip and modern it was.  I guess it was once a dive, but underwent a major rehaul not too long ago.Spot now has high ceilings, tasteful dark stools & furniture, a nice toasty fireplace, warm lighting, good tunes and a well-maintained pool table in the back.  Most importantly, the specialty drink menu is off the hook. We sampled the Blueberry Mojito, Strawberry Banana Caprahina, and Honey Lavender Martini (my personal fave).  All the drinks were extremely tasty & were served up with a smile.So if you happen to find yourself in Alameda, Fireside Lounge is definitely a nice spot to grab a drink and just chill out with some good company.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Justin L.\", \"AuthorLocation\": \"Stanford, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1205452800000,
        "ReviewContent": "this is probably love at first sight. so many bottles of beer(imported) on the wall, at least 99! and an interesting draft beer selection, some at $2 a pint at happy hours. the bartender who gave me some samples of draft beer.was cool. they have many wines including coppola and rosemblum's zinfindel. patron is also in the house as is boutique vodka brands. not to mention this is a full bar. they also have a pool table and 2 flat screen tv's this place is great for small networking parties.i don't get people who go into bars and complain about the decor. these people should go to art museums...i go to bars to get semi legally almost drunk, period. that's the truth, officer, i had only 2 small ones at fireside.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Victor G.\", \"AuthorLocation\": \"Hayward, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1204502400000,
        "ReviewContent": "The decor is cool but the music is SO LOUD!!! do not go here if you plan to actually have a conversation with anyone. It's so ear splitting loud, my friend and I were still screaming at each other when we left. Not the best place to catch up with friends or actually want to talk to someone.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"HR L.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1202083200000,
        "ReviewContent": "I see some of the less than flattering reviews that it seems like it *should* be a dive but is more like Martha Stewart opened a bar in Alameda, but having been a customer of the previous incarnation of Fireside, this is much better.  Finally a place on the West side of Alameda that I is clean, well stocked and takes credit cards!  A place I can take my wife without some overly drunk slob slobbering all over her while I get her a drink or she walks to the bathroom.  Finally a place we can relax without having to be sure I look at the chair first to be sure the chair is clean.Thank you for having this place here for the West-side professionals.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Greg R.\", \"AuthorLocation\": \"Clayton, NC\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1201824000000,
        "ReviewContent": "I was really expecting a dive when I approached this bar. The neon sign was only half lit and the solid wood door seemed to say \"watch your back\" as you approached. What a sham. This place was nice. Nice and full of 30somethings with button down shirts and expense accounts, oh, and that one guy at the end of the bar who probably doesn't even own a button down shirt, umm, and the older guy who probably was a regular back when it was a dive, this hot edgy guy I picked up at happy hour a few weeks prior and myself, who transcends any sort of 30something categorizing since I often act like an adolescent. In short, the Fireside is clearly geared towards a crowd that likely decorates their place to resemble a model home (in fact, the decor of the bar sort of looks like the the living room of a model home, except that there is a bar taking up one wall). It seems that you do not need to fit that mold to drink here and still feel like you are welcome. The selection of libations is good and my companion found a new favorite beer that we promptly ran out and stocked up on for home use.Still, I would have preferred that this place was on the inside what it appeared to be on the outside.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Drue C.\", \"AuthorLocation\": \"Seattle, WA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1201219200000,
        "ReviewContent": "Nice place with a really chill vibe.  Christy--besides being very friendly and engaging--really knows how to mix 'em.  Thanks to Fireside Lounge, I'm now hooked on absinthe drinks.  I asked for a recommendation and she made one with whiskey and bitters that was quite tasty (one of their two signature absinthe drinks).  Being among the first to serve absinthe again in the area, others around me at the bar were interested in my drink.  It was a kind of glowing bluish green color.  After Christy told them what it was they wanted to smell it...kinda bizarre, I know!  But I indulged them.   Despite their interest, I don't recall them ordering one.  I guess they were scared off by rumors that absinthe can make people hallucinate or go mad.  Pfffttttt!  Down the hatch!A friendly couple next to me (with whom I chatted away for most of the night) kept asking me to tell them when I started hallucinating or if I was about to levitate.  I told them unless they were both figments of my imagination, I think I was fine.  They also later pointed out that one of those sniffing my drink was the mayor of Alameda.  Nice!  I must say, the crowd at this place is quite diverse, both culturally and age-wise.  You never know who you'll run into. And the interior really is Pottery Barn-ish.  A little dark, a little flickering flame, and then BAM!  a pool table!  But it all comes together quite well.  I gotta hand it to the owners for turning this place around and giving it a comfortable yet upscale feel that you usually have to cross the bridge to find.  Will have to make another visit soon and see if I can't raise my review to 5 stars.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jeff H.\", \"AuthorLocation\": \"Castro Valley, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1200960000000,
        "ReviewContent": "My friend Cristian M. has been telling me to check out the \"new\" Fireside for months now, but I only managed to get there (with him) last week.Wow, do I feel like a jackass for waiting so long. This is a *great* bar. For a variety of different reasons:AmbianceThe room has nice furnishings and a sophisticated feel, but lends itself to many activities-- lounging with drinks, playing pool, watching sports on the TVs above the bar (I can't tell you how happy I am to have found a bar that isn't a dive but still allows me to catch some ACC action), or dancing on weekend evenings. The crowd seems to be very friendly, with a good mix of regulars and visitors.StaffWhen I was there the owner's girlfriend Cristi was bartending. She was friendly as all get out, managed her crowd well (always making eye contact with people trying to order, even when she was busy, telling people she would be right with them), and EXTREMELY knowledgeable about their offerings, from beer to wines to spirits. I spent a lot of time quizzing her about different drinks and spirits and was very impressed with the amount of analysis and thought she had put in to the bar's selection of alcohols. Since her boyfriend is mostly interested in beer, Cristi is in charge of the cocktail menu (which changes seasonally), and has come up with some excellent drinks. I was also very pleased to hear that she makes their own mixers herself, since she can't stand most of the crap mixers on the market. This is a woman dedicated to making a quality drink, which makes her my type of bartender.DrinksFirst, they have an excellent and very wide selection of beers. I'm not a beer person but was impressed by the variety. The wine selection was good, and included some good local (and by local I mean the Bay, not Napa, people) choices. Hard liquor included lots of quality labels and numerous local products (although not Hangar One-- and with good reason, as it turned out. But I'll let you ask about that your ownselves). As importantly, the \"signature\" cocktail menu had some creative and as it turned out quite good offerings that Cristi had put a lot of thought in to. And, as I mentioned, the drinks are made with quality mixers that Cristi makes herself (who doesn't like a woman who declares her hate for commercial sour mix?)Really, I can't overstate how stupid I feel for not getting to the Fireside sooner, or how happy I am that I finally stopped in (thank you Cristian!). What a great bar. I can't wait to go back.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Catherine H.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1200182400000,
        "ReviewContent": "As my delicious companion and I noted last night, if Restoration Hardware and Williams Sonoma Home fucked and had a bar as a love-child, this would be it. I dig the decor, but it's not at all what I expected from the outside, much less the area. It way out-classes it's neighbors.The Fireside Lounge is spacious, comfortable, and friendly. And they serve what just might be my new favorite beer: Kona Brewing Company's \"Pipeline Porter\"-- a coffee brew. So, so good. And the prices, judging just on the two drinks we had, seem reasonable: $6 for a pair of 10oz beers. A larger, 20oz size is also available. There's a pool table that looks like brand new, or at least very well treated. The clientle appear to primarily be of the 40-or-older professional white male set, but nobody seemed to mind when this 32-year-old mohawk'ed whippersnapper entered.I should give this place a solid four-star rating, but in the time that it took me to finish my beer, they played the Black Eyed Pea's \"Get It Retarded\" twice. I dig the track, daddy-o, but keep the rotation fresh! Sorry, I'm a music snob.I will be coming back, not just for the Pipeline Porter, but because this seems like an excellent place to relax with some of my button-down-shirt-and-pressed-slacks coworkers.  OK, maybe just for the Pipeline Porter.",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Paul B.\", \"AuthorLocation\": \"Denver, CO\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1199923200000,
        "ReviewContent": "It's great not having to go into the city to find a classy spot.  I'd been to the 'old' Fireside, and believe me, it's nothing like owner Patrick's re-incarnation.  And he found a gem in Cristi, who makes the insane cocktail combinations behind the bar.  Cinammon chai martinis, absinthe drinks that are strong, but not overpowering, plenty of beer, and WINE!  Having joined (or been forced by my girlfriend) into the wine snob category, I'm starting to appreciate wine more and more these days, and when Patrick found out we loved wine, he started bringing stuff out from the back and having us test it out.  Very heavy pours, great service, nice floor plan, everything is perfect.  Do it!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Brian H.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1198022400000,
        "ReviewContent": "My boyfriend and I decided to drop in for a drink since it was close to home - GLAD WE DID!!  We immediately made conversation with some of the patrons and ended up having a great time!  Christy's concotion (something with bitters, ginger ale, and vodka?) was yummy!  I can't wait to stop in again!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Betty D.\", \"AuthorLocation\": \"Concord, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1197936000000,
        "ReviewContent": "UPDATE 3/17/08: Still 5 stars. Celebrated my birthday here on Saturday night and had a blast! Thanks to the bartender, Jeff, for keeping the drinks and smiles flowing. (Sorry I kept calling you Kevin at first, but it was pretty noisy.) The joint was pretty packed at one point and he held down the fort all by himself. Also, they play music off an iPod and Jeff swapped in my iPod which I brought with me. So my friends (and all the other customers) were listening to my personal playlist all night. A birthday to remember. Note to self: tried absinthe for the 1st time and don't need to have it EVER again. Nasty sh*t that tastes like black licorice and will eat your brain.Original review starts here: YES! Alameda needs a joint like this (I think that about a lot of new places). A fresh, not-divey bar for 30-40-somethings. Yes, at 36 (37 in a few months!) I'm showing my age. Call me O.G. The Fireside Lounge has no windows so it's easy to miss. I overheard about the remodel and new ownership while dining at Asena one day. One of their waiters is also a bartender at Fireside, and he was raving about the makeover; been dying to check it out ever since. He said the former old-timer regulars would poke their heads in, see the new digs and leave. That's a good thing in my book.So the decor is Pottery Barn-ish (in a good way): tasteful dark wood furniture with a dash of retro cool. There are a nice mix of regular tables, bar tables, leather sofas, plus the bar seats. It's airy and cozy all at once. The walls are lined with vintage magazine ads for old cars and Tab cola. There is a pool table in the back, right by the fireplace (yes, Fireside has a real fireplace with real fire). The music was on the loud side, but not horrible (no louder than you'd hear at Old Navy in the mid-afternoon). I'm probably more sensitive to the sound level now that I have 2 kids and don't get out much. On a busier night, I probably wouldn't have noticed at all.Lastly, the drink menu was creative and reasonably priced (not cheap). My wife chose the Caramel Martini which she liked, and it came with a little caramel candy on the side. I had a Fireside Hot Coffee with coffee, Bushmills or Jameson (can't recall) and some kind of Baileys-like liqueur. At 10pm on a chilly Saturday night, it hit the spot. Bottom line: I like that Fireside is roughly the same target demo as Forbidden Island, with slightly cheaper drinks and more spacious. Also a good step above Z's for liveliness but that ain't saying much.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Keith L.\", \"AuthorLocation\": \"Fair Oaks, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1197763200000,
        "ReviewContent": "What a find!  While I can't speak to its former incarnation, the new Fireside Lounge is inviting -- from the tasteful decor to the creative cocktails, unexpected wine offerings, and most of all the enthusiastic and personable staff (owner Patrick and cocktail queen Cristi). They made the b/f and I feel most at home and talked to us at length. Patrick was stoked to find fellow wine buffs to share notes with and hearing about Cristi's amazing journalism career was another surprising twist to the night.Stiff cocktails and very generous wine pours in oversized glasses that really let you appreciate the nose on the wines. Would give it five stars, but the music was odd (super random shuffle setting, anyone?) and a few details were overlooked -- a prohibitively dark corner, underused fireplace area, etc. But Patrick's love for his watering hole is apparent, and he has plans to outfit the front with windows and a Dutch door, so I'm confident his place will only continue to improve. While we live on the other side of the island, I do believe we've found our \"neighborhood\" bar. :-)",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Megan L.\", \"AuthorLocation\": \"St. Helena, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1196294400000,
        "ReviewContent": "Great bar, great vibe, friendly employees, close to my house and Trumer Pils on tap. Overall, this place is wonderful.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jen R.\", \"AuthorLocation\": \"Austin, TX\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1196208000000,
        "ReviewContent": "The last time I visited the Fireside was in 1995.  A friend told me it changed.  Yep, it did.  Swanky? Hmmm, not really the term I would use, but  a really nice neighborhood bar & lounge.  I like the fact that there is a split between the lounge area and the pool table area.  The bartender was friendly to chat with and shared some great cocktail recipes.  Alameda's hip factor is still pretty low, but places like this make me want to stay on the island.  The comments about the furniture are pretty funny to me.  As a designer, form is important to me and I am willing to pay for it for ambiance and setting format - but for these prices and this neighborhood, who is thinking Le Corbusier?  I think they did great job with the interior design and selection of furniture.  It matches the target customer.  Hopefully, this and the reasonably priced drinks will make many Alameda residents feel welcome.My only suggestion, is lower the lights - darker is always better.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Bethany S.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1194825600000,
        "ReviewContent": "Great place. I only glanced inside before the redo but I can tell the owner/barkeep put a lot of effort into making the place comfortable, tastefully decorated and good quality beverages ranging from cocktails to wine and bubbly (a couple good choices). Not too expensive. They have pool too.It has a sophisticated sports bar feel, but I'm usually put off by those places and this place has no pretention. They keepin it real.Can't wait to take friends!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Cristian M.\", \"AuthorLocation\": \"San Francisco, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1194825600000,
        "ReviewContent": "About a week before the Fireside Lounge opened, my boyfriend and I were walking to get something to eat and ran into the new owner.  He invited us in to take a look around even though they weren't finished with everything.  Immediately, I knew that I would love the place.  Friendly owner AND an updated classy bar - count me in!We went there for the 2nd time on Friday night and I was excited to see an addition of a drink menu.  They had a beer special, where they put their extra beers that they have limited quantities of in a bucket and sell the individual bottles for $2.50 - bargain!   I even got one for free because a guy at the bar said he would buy me the beer if I tried the one without the label.  I lucked out, it was an amber ale!  We also tried the Pumpkin Martini, very delicious, a nice fall drink.Definitely give it a try - you won't be disappointed!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Sari O.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1194307200000,
        "ReviewContent": "I've only been here once. I was taking a friend home and we wanted a beer before we called it a night. The atmosphere was chill and trendy and...not what I was expecting from the outside. As I sat down at the bar I saw my favorite local Pilsner on tap. Ohh trumer how I love you. I can only really find it in 6packs at bev mo, so I was very excited about seeing it, and that is really the only reason why I reviewed this place. Round of applause to the fireside for having delicious beer on tap!",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Betty W.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1191456000000,
        "ReviewContent": "OK, I get it that Alameda is sooo starved for nice bars but come on. This place has a weird vibe. Its looks like a dot.com bachelor pad--where someone just bought a bunch of stuff from Pottery Barn and tossed in a pool table. It lacks any soul or personality. It's a 40+ crowd on the prowl. And what kind of bar won't let you start a tab? A place that doesn't take credit or debit cards. You've been warned! It's safe to say I'll never step foot in this place again.",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Valerie M.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1188691200000,
        "ReviewContent": "Stumbling distance to my house +2 pointsWeird mix of 40 something women wearing go-go outfits, who have had no business wearing a mini skirt in about 20 years, and men in full suits at 1am, or others looking like they just stepped out of a wham video -2 points for weirdness +1 point for the people watching benefit.Cool ambiance +2 pointsThe lack of thriving businesses in west Alameda, coupled with the seedy history of this bar, +1 point for gumption of the owners to give this place a go.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Annie D.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1188345600000,
        "ReviewContent": "Ok the OLD fireside I was afraid to set foot in! In worry I would get robbed or stabbed or somthing worse!But now.....Wow! what an improvement! Patrick (the owner) is awesome! great conversation, good people, relaxed atmosphere, beautiful leather furniture, high table tops and ceilings!LOVE LOVE LOVE IT!!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Nicolette F.\", \"AuthorLocation\": \"Pleasant Hill, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1187136000000,
        "ReviewContent": "**UPDATE 9/11/07**I just had the COOLEST semi-private party here 9/8/07 and I have to say a huge \"THANK YOU\" to Patrick and his exceptional staff for making my 40th a fabulous event.  I hope I didn't drive them crazy with my constant meetings with the DJ, florist and photographer, tasting wines, creating my signature drink (Red Hot Hottie...Thx Larry!)...but despite my OCD, everything was handled so smoothly and professionally.  It was a totally stress-free evening for me because I knew everything behind the scenes was being taken care of, and it was indeed.  In fact, looking back, I probably should have gotten slobberingly drunk knowing how perfectly everything was being managed.  Oh well.  (I'll make it up to you guys!)Regardless, every single one of my guests told me how much they just Loved the \"new\" Fireside and how much fun they had.  Can't beat that!FYI, since my last post and reading the older reviews, I just want Yelpers to know that any minor \"issues\" previously mentioned have been worked out, so you can just ignore them.  It is a new venture after all.  For example, that ladies room door (Tracy A)?  It's very secure.  In fact, it closes all by its magical self and on my way out, it almost hit me in the ass!**Orig. Post**Luv it!!  The Fireside has it all and then some.  It's a beautiful open space inside.  Cool people, great drinks and a really comfortable vibe that's inviting and relaxing.   You can play pool, listen to cool tunes, meet some new people and you can even hold a real conversation with your friends.  The ladies room is so cute and clean.  (Thanks for the purse hook in there!)  I like the sturdy glasses too, for clumsy ones like me.  Go check it out!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Latteliz P.\", \"AuthorLocation\": \"Las Vegas, NV\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1186444800000,
        "ReviewContent": "I must start by saying that The new Fireside Loung is a huge improvement over hte old Fireside and I am thrilled to have a decent bar on the West side of Alameda, which happens to be the side of the island that I live on, and the Fireside Lounge is conveniently located only 2 blocks from my house.The atmosphere is warm and welcoming, and has a feeling like you're in someone's living room.  The decor is very tasteful, and I love the new raised ceilings.  Another plus is the vast beer selection - a great many bottle to choose from, also some great tequilas.Now the bad stuff - the bartenders pretty much suck.  They are not bartenders (and have told me as much), but are learning.  Hence, they have no idea what they're doing, ehich makes getting a drink take a lot longer than it should.  Also, the music is HORRIBLE!  Music is essential to any bar, and the Ipod regae/soft rock thing is not working.  Get some upbeat DJs, etc.I see room for improvement in the Fireside, but for my money if I want to go to a loungey-type bar in Alameda it'll be The Hobnob ... much better all around.I'll keep my fingers crossed for the Fireside, though, and maybe update my posting soon!",
        "StarRating": 3,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"MonkeyPants S.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1186012800000,
        "ReviewContent": "wow! i haven't written a review in ages but thought the fireside lounge deserved attention. this place with its old world charm gives alameda a hint of sophistication it has been sorely lacking. i have been a few times now and find the clientele diverse and refreshed with the fireside upgrade. i overheard numerous people exclaiming that this is exactly what alameda needed and I couldn't agree more.  i love the fact the owners kept the original bar and phone booths from the 40's and removed the false ceiling to reveal the full length of the fireplace. it's always amazing to see what imaginative good taste can do to a place whilst still preserving its authentic features.i am a huge tequila fan and am pleased to see the selection continue to grow. the beers on tap rotate almost weekly and there is a huge bottle selection - the ones from france and belgium are stellar. the wine menu is also ever expanding.minor drawback - the owner keeps saying he will finish the crown moulding and hopefully soon -because it would really complete the place.if you live in alameda you can walk here or ride your bike (i've done both). i plan to go here for one cocktail and end up staying for three more! I also keep noticing the same faces when i go to visit - that speaks volumes about the future of this place.   i say....check it out!!!!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Sally C.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1185667200000,
        "ReviewContent": "first impression through the door, woah.  nice.  we (the wife and i) sat down, got some drinks.  second impression still good.  nice pool table.  nice decor.  interesting folks.    bar looks well stocked.we talked a bit about how the place is indicative of the increasing age of the hipsters.  we're having kids, moving into more suburban settings and the places we are used to are slowly following us here.but...  this place does not belong.by the time we were ready to leave we've decided we would not be back.  on our way out the door we looked at the desperately retro phone booth at the entrance and realized what was so wrong about the Fireside Lounge.  this is a place that tries to transplant the soul of san francisco to alameda, but it achieves in bringing over only the vain outer skin.  a sad attempt at \"hip\", one of countless soulless clones without any hint of its own character.way way over rated...",
        "StarRating": 2,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Jules C.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1185062400000,
        "ReviewContent": "After a few hours of sweaty pinball at Ju Ju, I needed a beer.  The closest bar was the Fireside Lounge.  From the outside I totally expected a dive but once emerging from the tiny opening we walked into a totally Pottery-Barned-out establishment.  There were a few unfinished things like the women's room door frame from the inside was not finished and to secure the door was this flimsy little hook and bar closure.  I also heard the bartender tell one person that the wine list was coming.We were happy to see 2 great IPAs on tap: Drakes and Bison.  They had a large selection of bottled beers too including some 20 ouncers, which I love.  The tap beers came in 2 sizes: small and large.  The small was really small like a 10 oz. glass.  The large was more than a pint, I am guessing a 20 oz. glass.The next time I get my Ju Ju on, I know I will be back!",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Tracy A.\", \"AuthorLocation\": \"Oakland, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1184889600000,
        "ReviewContent": "I was surprised when I poked my head into this place. I was expecting a dive bar and it's been newly remodeled. There is a beautiful bar, nice lounge feel and pool table. They are planning to open up the front with a picture window once they get funds from the city. They had a sign for salsa lessons on Thursday lessons - will check it out and give a review. It's drinks only right now. Hopefully they will have food but definitely a touch of class on the West side of town.",
        "StarRating": 4,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Cece L.\", \"AuthorLocation\": \"Sacramento, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1184716800000,
        "ReviewContent": "When you first walk in (through the very tiny door), you can't believe it. They have completely revamped the place. New leather comfy couches and very cool decor. Love the flatscreens and the bar. Larry the bartender was great. Very cheery and nice. This will definitely become a regular hang out - let's just hope lines don't form outside. It would be cool to have food there, maybe that's coming.",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Linda P.\", \"AuthorLocation\": \"Danville, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1183334400000,
        "ReviewContent": "The place is still great and my friends cannot believe how good the prices are for quality beers and cocktails. Keep it coming!I went to the opening of the new Fireside this weekend and to say it is improved is an understatement. It's been completely cleaned up and the decor now has a sophisticated timeless/retro feel to the place. The bartender and wait-staff were EXCELLENT and the atmosphere of the joint seems targeted to the mid-20's to late 30's crowd. I'm not sure what the future holds for the music but they had a DJ there playing cool background music that was just a bit too loud for conversation. Later, the dance floor opened up and the DJ was willing to listen to requests for different types of music, including Latin. The alcohol selection was great and I know the beer selection is a work in progress. Please keep the Trumer's!Overall, it blows anything else on Webster Street away and instantly rates as one of the best in Alameda. I say check it out...",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"dana C.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    },
    {
        "ReviewDate": 1175126400000,
        "ReviewContent": "UPDATED VERSION AS OF 7/13/07Ok so I went back after this dive bar was revamped. From the outside is still looks like the same dive. But the second I walked through the door.....Holy Crap! This is exactly what Webster St and Alameda need. Nice lounge. High ceilings, Nice tables. One pool table. Zero riff-raff.This place is going to do very well. The only issues were the cocktail waitress that couldn't hear and needed to write down our drink order on her note pad. a-b-s-o-l-u-t and soda. m-a-l-i-b-u and coke. It was funny. Also, no credit cards....yet.I'm keeping my original review below though, just for shiggles.************************************************************I've deleted the original review 'cause the new owner told me he was catching crap for it....The place is cool and the owner's got some really good ideas on the horizon...",
        "StarRating": 5,
        "ReviewType": "Yelp",
        "Metadata": "{\"YelpName\": \"Fireside Lounge\", \"AuthorName\": \"Patrick G.\", \"AuthorLocation\": \"Alameda, CA\"}",
        "VenueName": "The Fireside Lounge",
        "venue_id": 7
    }
]