[
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 14, 2024",
    "review": "Actually such a gorgeous venue. Located right beside City Hall. It's a small and intimate venue with a bar and a second floor. The staff were really patient and kind. I went to see Olivia Dean earlier this year and atleast when I went the venue and staff had an organized process going and everyone seemed to have a great time."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 10, 2022",
    "review": "Cute small venue with friendly staff and bartenders. I love that you actually get a good view of the artist, and there's a tiered balcony upstairs.Bathrooms were super clean.$10 card minimum.Affordable drinks for the area! About $9-12 for cocktails.Just docking a star because the sangria was pretty gross -- it tasted really vinegary and sour, as if the wine had spoiled."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 26, 2023",
    "review": "Pretty nice venue! Went here to see The Breathing Room on Aug. 25, 2023 around 8pm (amazing!) with some friends and the audience that it attracted was great.However, the bouncer was very rude. I, unfortunately, didn't have an online ticket and they only accepted cash for walk-ins. Thankfully, there was ATM inside past the bouncer. When I tried to walk toward the ATM to get my cash, he forcefully yanked me away and told me I need cash to pay for a ticket to do so.How am I gonna get cash to pay for a ticket if you won't let me walk towards the ATM? I had to ask others to go to the ATM for me just like this other girl next to me while we waited.Understandable that they want to ensure no one sneaks in, but invading my personal space with unwarranted physical contact was rude and unnecessary; a simple verbal warning or compromise/agreement would have been much more appreciated.Visuals were great and the venue was pretty packed but it was nice to have different levels to watch the performers! Bouncer overstepping boundaries definitely hurt my experience here."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 10, 2023",
    "review": "I'm not sure they are booking or doing concerts? I haven't heard anything this in the way of an update from management. Hopefully they engage soon!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 23, 2022",
    "review": "Two-Story Venue. Affordable Drinks for SF. No Tax on Drinks if Paid Cash. Doors Open One Hour Before Show. COVID-19 Vaccination Checked. Free, Street Parking After 6PM Around Venue in Hayes Valley & Civic Center."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 22, 2023",
    "review": "Great venue and atmosphere. Bar staff I have no complaints. All helpful. Not enough surface or trash cans options. I saw a huge soul say before show started and the building wasn't even 1/3 full. Kinda wish staff did a walk through they would've seen a huge spill on even floor. Bathrooms are decent. Overall good time and experience."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 29, 2023",
    "review": "Great place love the drinks and prices. They sure bring in some great entertainment too. The crowd is awesome. I mean yknow even if you're in your own zone you still want cool people around you. I saw raye in concert here. I also saw a band I am now a fan of that I haven't even heard of before. Rock on Rickshaw!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 19, 2022",
    "review": "Came here for a show last week, the energy and decorations (minimal decor but love a disco ball) were great. Bar was fully stocked and drinks were reasonable. My only critique is that it seemed like this place was well over capacity, people were packed in like sardines on both floors and on the first floor the crowd made it all the past the bar (and was crowding the bar). Curious what capacity actually is and how many people attended the show..."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 24, 2023",
    "review": "Went here for a comedy show, definitely enjoyed myself but was surprised with the $10 card minimum because my cider didn't hit it - got charged $3 for a soda water I didn't drink to hit the minimum. Ah well, pretty cool spot for a grungy opera house!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 15, 2023",
    "review": "Super cool venue in a pretty decent area. Only about a block away from market st. Felt and looked clean. Bar had a pretty good selection. Definitely want to return!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 24, 2023",
    "review": "Went here for a comedy show, definitely enjoyed myself but was surprised with the $10 card minimum because my cider didn't hit it - got charged $3 for a soda water I didn't drink to hit the minimum. Ah well, pretty cool spot for a grungy opera house!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 10, 2022",
    "review": "Cute small venue with friendly staff and bartenders. I love that you actually get a good view of the artist, and there's a tiered balcony upstairs.Bathrooms were super clean.$10 card minimum.Affordable drinks for the area! About $9-12 for cocktails.Just docking a star because the sangria was pretty gross -- it tasted really vinegary and sour, as if the wine had spoiled."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 19, 2022",
    "review": "Came here for a show last week, the energy and decorations (minimal decor but love a disco ball) were great. Bar was fully stocked and drinks were reasonable. My only critique is that it seemed like this place was well over capacity, people were packed in like sardines on both floors and on the first floor the crowd made it all the past the bar (and was crowding the bar). Curious what capacity actually is and how many people attended the show..."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 17, 2022",
    "review": "TL;DR - I love this venue The acts are always super affordable. I've seen bands like XYLO and Emo Nite here, it's always a good time. The venue isn't super big though. There's an upstairs as well - balcony that lets you have a great view!Drinks are affordable $10 min for card."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 23, 2022",
    "review": "Two-Story Venue. Affordable Drinks for SF. No Tax on Drinks if Paid Cash. Doors Open One Hour Before Show. COVID-19 Vaccination Checked. Free, Street Parking After 6PM Around Venue in Hayes Valley & Civic Center."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 26, 2022",
    "review": "I was simply walking by when this man took my drink and said I couldn't have it. Wtf???? I wasnt even attending the event. I was simply passing by and talking to my friends. I surely hope there's some sort of compensation to be had because that was $3.25 down the drain. I have never frequented this place and after the treatment I had, I will never come back. You have no respect for people or their personal belongings. You are disrespectful. I will never give this place any sort of patronage. I can literally see my drink on the sidewalk from this rogue bouncer."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 31, 2021",
    "review": "It was a nice, intimate venue. Friendly bar staff. Spacious general admission area, cool balcony up top. My only complaint is the roof was leaky. I kept feeling drops of water from the ceiling while watching the show. Otherwise a cool place"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 23, 2021",
    "review": "Just went for the Miley night. The dj wasn't very good. The workers were so focused on masks when their own staff wasn't even wearing theirs. Kind of annoying when they're tapping your shoulder every minute, but you look over and the check in people and dj weren't even wearing theirs. They should also focus more on the bathrooms and work on playing good music. Because that was trash. They had the opportunity to make it fun but focused on the wrong things. Hope next time is better"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 21, 2021",
    "review": "Terrible experience. Poor communication from the venue to the customers. Flew out to San Fran, spent well over $1000 in travel costs to see my favorite band, showed up with my vaccine card (as required) and was denied entry due to my vaccine not being the preferred dosage/type of vaccine. Ridiculous, staff was unable to provide help besides contacting the ticket service. That can be understandable, but there was no sincerity in the miscommunication and lack of communication. I wish I would have known and been informed of the expectations before spending my saved travel money to come here. Not worth it and really wished for better service."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 30, 2021",
    "review": "Decent music but terrible service. I've had better customer service from motels; the bartenders are horribly rude and snappy. I asked for a drink after just initially walking in and was immediately met with attitude from the get go. And it wasn't from a single bartender as 2 different ones i went to were extremely short with me. Not a terrible experience but the bartenders here wouldnt make me want to visit this place a second time."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 20, 2021",
    "review": "We here for multiple concerts. They were both so sick and fun. These types of venues are 10x better than a big venue. I am under 18 and they let me in fine with an x on my hand. Really sick spot."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 23, 2020",
    "review": "While I was waiting in line, the staff got into a fight with another customer behind me after the other customer made a comment about their ID/alcohol policy. He was not rude; just asked if he really needed to have X's sharpied on both hands to show that he was not allowed to buy alcohol. He was taken out of the line to the side.After my friends and I entered the first floor was packed, and there was no order. People were constantly pushing each other to get to the front. Then, half way through the show, a fight erupted on the floor where a man smashed his glass against a woman's head (I think because she spilled beer on him). Chaos ensued. The fight went on until the performer actually stopped and asked if something could be done. Then finally the security guard came to break up the fight....Police cars parked outside the venue as I left.Disgusting management from start to finish. I will never come back again."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 25, 2020",
    "review": "A great place for a smaller/ more intimate show! Came here for a concert and was able to get right at the front of the stage. You can either stand in the lower area or stand/ sit in the upper area--the lower area goes very far back so don't arrive too late otherwise you will be far from the stage. The lower area has a bar, where they have beers on tap and they also had a cocktail special named after one of the performer's songs. They also have an upper area which is a decent size--the regulars seem to go straight up there and grab a seat on the couches and chairs. The seats are good if you don't want to be down below where you will be tight standing next to people.I like that a Rickshaw Shop is walking distance from Civic Center bart! Maybe a 10 min walk. As always be careful walking at night and try not to walk alone. If you are looking for a dinner beforehand, Cala is right next door to Rickshaw. I have never been but I've heard good things (you should make a reservation beforehand).Enjoy!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 7, 2019",
    "review": "I have been living in SF overtone Year now but this place never showed up on my radar even thought it is pretty close to my crib. Never the less, yesterday \"The Make Up\" die a show there and it was super rad. The venue itself is just the right size, got a nice Balkony and a good cheap(for SF) full Bar, they accept all kind of cards but it will be cheaper if you pay cash. The whole interior is very chilled and feels just right burning you want something posh, this is the wrong place! I will devinetly check what bands are playing there in the future, cause I definitely come back. Ohh one word of advise, the cocktails are strong like really strong !"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 19, 2019",
    "review": "Been here a few times for several different shows, so it's finally time to write a review.Rickshaw is definitely one of my favorite venues considering how intimate it is. Since it's a smaller venue, you'll be close and cozy with other folks. The bartenders are chill and the drinks and strong(and reasonably priced). This place has a divey and gurngy vibe, and I wouldn't want it any other way."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 10, 2019",
    "review": "A smaller venue that doesn't feel claustrophobic. We came by when doors opened for Emo Nite but we were told that they weren't quite ready and to circle back later.When we did come back, there was a small line but it moved by pretty quickly. Once in we were stamped to indicate that our tickets were checked and we had wristbands placed on us for being 21+. Once you're inside you can pretty much see to the end of the venue with the main stage at the back. To the right as you walk in are the restrooms and there is a bar on this floor as well. There are a set of stairs to the left and there was a sign indicating that there was a bar upstairs that was open and that coat check was also located up there.When we got up there the bar was definitely not functional. There was a rack where you could hang up your jackets and take a ticket but there were no staff monitoring that so someone could in theory take your jacket. The upstairs area has some couches and has a lower level where you can watch from upstairs.I didn't drink that night but they did have a spout with water to the left of the main bar so you could help yourself.All in all it was a pretty intimate venue. The event didn't seem too packed so maybe that's why there was still a decent amount of room to move around. I think some of the hiccups may have had to do with the event organizers rather than the venue."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 17, 2019",
    "review": "The grungier the better! I dig small intimate venues. It can get packed like sardines on the main floor so if you're short like me, head to the second floor for the best view of the stage! Also there's a few lounge chairs upstairs if you're into sitting. Saw one of my favorite artist here and it was lit!! LOVE YOU LOLO ZOUAI!! She is a Bay Area native and a rising star so don't sleep on her!!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 13, 2019",
    "review": "Had an absolute banger of a night, atmosphere, sound and lighting were all top notch. Friendly staff even went the extra mile to help me get a signature. If you looking for a venue, this is the place."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 22, 2019",
    "review": "Chill quaint venue but very SF.  Went there to support a buddy's band - which was basicallly a compilation of 9 different musicians (yea the stage was a bit crowded) but the music was on point!  Drinks were VERY reasonable and the Bowie & Prince renditions were surprisingly REALLY good.  Id go back."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 26, 2019",
    "review": "Four stars for the interesting rotation of events they put on, from Nerd Nite to live music. Bar is quite basic - nothing too positive or negative to say about it."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 15, 2019",
    "review": "This is a great intimate venue. It's just a short walk from BART. I saw Crywolf and would come back to see another show."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 8, 2019",
    "review": "This venue had pretty good acoustics and a really chill vibe. We went to see Badfish, a Sublime cover band. This place has a full bar, and I found the bartender to be pretty friendly. They had ADA seating for us, but it wasn't very comfortable. I appreciate that they gave us a good view of the stage. Overall I liked this place, but didn't like what people were doing inside of it. I hate to sound like a weenie but smoking of all kind should be outside. Some of us are really sensitive to smoke and wish ordinances would be followed. Otherwise, the casual seating was really cool and the bathroom was really nice compared to other divey places. There is room for improvement with the decor, but I understand it's supposed to have a certain look. I'd go back if it weren't for a stoner band!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 3, 2019",
    "review": "What a terrible experience! The most rude and cold blooded bar tender ever. I was there Friday night, and the bar tender was serving whomever she wanted, while completely disrespecting the fact that some people got to the bar earlier (much, much earlier) and were not served. Then she takes a shot with of her friends, makesSome jokes while the rest of us were still waiting. Then went on to serve a guy who just jumped to the bar, i told her we have been waiting for a while and we got there earlier, she said with cold devilish smile \"you will have to wait more\". So we simply didn't buy any alcohol"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 14, 2019",
    "review": "Came here to see 4th Ave and the staff here kept everything organized! They were really kind throughout the day. The venue was smaller than I expected but I had no problem with that, and I love the sound system as well!! :) Definitely one of the best experiences I've had with a venue and their staff."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 20, 2018",
    "review": "Love this spot. The vibes feel like a really well thought out drama club party. I have come here for both a concert and Nerd Nite and both seemed worth the price for me :) The venue is really small making the events intimate--at Nerd Nite, someone even got on stage and read a speech for her husbands anniversary present. It's nice to have a space in the middle of a city that feels like a tight knit community."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 17, 2018",
    "review": "I had such a great night at the Rickshaw Stop! It was a little bit drama-filled, but I really appreciated the staff and their devotion to maintaining a safe atmosphere. I was pointed out by the bar staff (let's face it, probably with good reason) for having one too many, and then was asked to take a break outside. From there I had a small discussion with a couple members of the managerial team and they were the very best, super understanding and allowed me to go back inside and dance as long as I rein it JUST A BIT (I'm a talented and spirited dancer). Anyway, this team is fab and I appreciate all of them and I look forward to visiting again with less drama next time."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 16, 2018",
    "review": "DO NOT SUPPORT THIS VENUE. The bouncers were horrible and rude. All my friend did was throw away an EMPTY beer bottle and they refused to let us in. We literally didn't even drink it there. They were incredibly rude about it and they didn't even provide us with a reasonable answer on why they couldn't let us in or provide a solution/refund. My friend and I were so sober and they treated us like garbage since they had no empathy from kicking us out. And then one of the bouncers started YELLING at us and I told him yelling was unnecessary since I'm just talking to him and then literally 3 other guys who worked there started YELLING such rude ass shit at us. There was no need to gang up on my friend and I when they were  already ruining our night. Nothing bad would have happened if they let us in, they just wanted to be bratty and ruin our night. They were all middle aged old cis white men who clearly didn't care about people or the music scene. They prob just enjoy pissing people off cuz they have a sad job of standing next to a door all day."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 16, 2018",
    "review": "WORST EXPERIENCE I'VE HAD WITH A VENUE Venue bouncers/management didn't allow my friend and I entrance inside, even though we had our tickets bought in advanced, because he saw us throw away an empty beer bottle in the trash?!??? He insisted we were intoxicated when we actually sober. Had 0 proof we actually drank the empty bottle. Security and other employees also yelled at us basically attacking us. Provided no refund or other alternatives. Completely unreasonable. Nothing but ASSHOLES who are unhappy with themselves and their jobs who feel the need to talk down on young girls"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 1, 2018",
    "review": "Attended the Mahalia show fri 8/31.STAFF: not quite the horror show that they are reputed to be, just the typical gruff venue employee typesINSIDE: stage in back of room, bar off to side. there is a small upstairs balcony. it's a small space but didn't feel overly crowded. good set lighting. BATHROOMS????: YES. there are men+women bathrooms. women's had 2 stalls, decently clean for a hole in the wall venue. PARKING: we were able to get street parking on franklin very easily-and bc it was so late we didn't have to pay! Mahalia and Kiah both put on great sets, and it so cool to see them in such an intimate setting. I would come back to Rickshaw again. *one thing I will note is that if you're a person that has any type of issue w/ smoke or asthma or just breathing, a lot of people were smoking/vaping. and in such a small space, it was kind of heavy-so that wasn't too fun."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 8, 2018",
    "review": "I saw a sold out The Hold Steady show here.  Bad experience.  I've been to 100+ venues around the country, and I've never been so crammed into a tiny club that to watch the show I had to stand in the back of the club, literally 5 feet from the bar's center, directly under bar lights shining down on me.  Talk about a terrible way to see a show.  All lit up, constantly bothered by people trying to maneuver to buy a drink, and with all the bar noise.  There was no way to move forward--the place was that inappropriately packed.  Also, the temperature inside was too warm -- running one large fan in the balcony area doesn't cut it, people -- and the small balcony has some stupid garage door-type thing pulled partially down that blocks much of the view of the stage from the balcony.  Awful, like nobody gives a sh!t who works there.On top of the issues I mention above, the staff lack common sense.  After showing my ID, they stamped a VERY large \"HOT\" stamp on the inside of my right wrist.  It took me 1.5 days to scrub this off of my skin, and it looked far more like a \"HOT\" tattoo than a club stamp.  Thanks, guys--how about using some discretion in your stamp selection.I ended up leaving the show after about six songs despite being a big fan of the band, as I just didn't feel like dealing with the nonsense.  The show two nights earlier at GAMH was night-and-day more fun to attend.  The Rickshaw Stop may be a decent place to see an unpopular, uncrowded show, but I will never return for a show that I feel might be sold out."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 24, 2018",
    "review": "Went here last night for a concert. Unfortunately, my phone died so I couldn't take any pictures. This place is very white and very cis. The bouncers are rude and the space is small. There are some nice couches on the second floor and the drinks are relatively cheap but that's the only thing keeping this place from getting one star. I was not impressed by this place at all"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 19, 2018",
    "review": "Just a warning: don't count on the kitchen being open.Went to a concert at 8 and figure I'd just eat there, but the kitchen was closed.  The bartender told me it's sometimes open for a half hour after gates open and they serve what they might have left over.I had to run to subway during the show.  Wish the website would have said something about kitchen hours.Otherwise, this is a great, intimate venue and Ted Leo was awesome."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 8, 2018",
    "review": "Idk why this revue is sooo sketch. Not sure why an independently owned company has such corporate-like policies?? My friend was not allowed in simple because her EMPTY canteen smelled like wine and she was not 21(at least not for less than a month longer.) She bought a ticket in advance and they refused to let her in. I'm thinking this place once had a lawsuit on their hands that made everyone who works there now a narc. There is one good thing, though, the manager gave our friend $12 back for the ticket price she paid (disregarding service fees) while she was crying on the sidewalk outside of the venue waiting for her uber.  She would not have even gotten that refund if it weren't for my friend and I heckling the manager. I really hate doing reviews like this because I work in customer service and deal with the absolute worst people but seriously, what gives???"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 8, 2018",
    "review": "Small venue. Reminds me of the places I loved in high school. If I were an 18 year old kid again I'd go to this venue every week. Now I like a few tiers on the floor or in the balcony. Tickets were cheap though so you get what you pay for. I'd much prefer the Fillmore or Orpheum. Sangria was watered down and signature drink was way too sweet. Nice sound system though."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 25, 2018",
    "review": "Came for a Lauv concert last night. The venue was sold out and packed!! Although it is relatively small, it was able to comfortably hold a lot of people and has two floors. I sat on the couch on the top floor the whole night so I was away from most of the crowd but still had a good view of the stageRegular priced drinks. The downsize is that there is a $20 minimum for credit cards.. but if you're broke there's free water on tap on the side of the bar"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 18, 2018",
    "review": "This review is for NERD NITE Only  at Rickshaw stop:THIS IS A  quintessential SF event . A hip yet unpretentious, dive-esque bar packed with a lot of character sets the stage for 3 'talks' roughly 20 minute each  about interesting and exciting topics. Talks- they are funny, they have character, they are animated speakers giving a run down of their respective field with purpose. This night we got the history of SF's Trans culture, 20 math mysteries with graphics and dancing in 20 minutes, and how a physicist is working to understand dark matter. Each was beyond entertaining, captivating, and educational without feeling talked down to or watering down the content to much. And you walking away learning some really cool stuff.This happens the 3rd Wednesday of each month and this was the 92 hosting. Great date night, or solo event, don't bring a crew this thing fills up. Get there real early if you want to have a chair or a couch space, otherwise we did the floor up front and it was pretty nice. Cash only"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 10, 2017",
    "review": "Best place to dance and hear newer independent music in San Francisco. Unique and fun venue, walking distance from Hayes Valley restaurants and SFSymphony, etc.. There are a couple actual rickshaws inside, hence the name. They have a coat/back check upstairs. There is a balcony, bar with fun specials and great sound, lighting and film effects for some events I've attended."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 7, 2017",
    "review": "This reminds me of a Bottom of the Hill.  An intimate venue to watch talented musicians give there ALL. Next to Cava, I could not help but hear the music pouring put into Fell Street. Stopped and talked go the bouncer and he escorted me in with great service to explore the venue.   If your type of music comes to this venue, you will love it. I remember watching Coldplay at the Warfield there first year. You may stumbnle accross the next big artist before they were famous.  5 stars all day."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 26, 2017",
    "review": "You get an award for rudest bouncer of ALL TIME. Came here for Popscene/Frenship  on the hottest night ever (75 degrees at 7pm?!) and I happened to have a water bottle in my purse with like 2 ounces of rose left (from earlier in the day) in it.The bouncer asked to see my purse, I said ok, totally forgetting about the rose. So he saw my water bottle, took it out, and said \"THIS IS PINK\". Right, ok, so...? I said \"can I drink it? I can step out of the line\" And he didn't care at all that I said anything.He then threw the water bottle to this scary looking possibly homeless guy in a wife beater across the sidewalk and the wifebeater guy dumped the rose on the sidewalk, then threw the leftover bottle to a nearby trash can. Bouncer then said to me \"you can purchase alcohol inside\" Yeah, really? two ounces of rose would have cut back your revenue by how much? $2?Normally bouncers would give you a chance to drink it or go to back of the line or like, give you a chance to even respond. Obviously I wasn't trying to sneak it in.. the water bottle is a huge Dasani bottle! thanks for treating me like a criminal. Btw, you didn't even check the rest of my purse after you made a scene out of my water bottle. You didn't even thoroughly do your job."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 5, 2017",
    "review": "This place is low key and decent for comedy shows and a place to hang out.  Due to poor acoustics and the fan at full blast, it's loud and cold.  The saving graces are the exceptionally helpful and friendly staff as well as their amazing grilled cheese sandwiches with a selection of your favorite toppings (e.g., basil, bacon, onions).  Parking can be tough on the street.  However, it's a few blocks from MUNI at Van Ness."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 16, 2017",
    "review": "If I could give this place 100 stars for customer service, I would. Came here last night to see the early A R I Z O N A after paying a premium on the resale market for the early 7pm sold out show. My friend left his ticket in our Uber on the way over, so we spent the first half of the show outside trying to get that back. By the time we made it inside, we were only able to catch the last two songs. On our way out, I found myself venting to guy by the door about what had happened and how I was disappointed we missed the majority of the show. Turned out, he was the owner, and asked me and my friend to come over. He pulled out wristbands for us to attend the 10 o clock show, and told us to have a good night. We were the first to enter, and caught every song from the very front along the stage. The opening act Glades pointed the microphone at us at one point, asked us our names, and gave us a shout out. To the very generous owner who turned our night around BIG time - thank you SO much for your generous hospitality. Last night will be hard to top, but I will most definitely be coming back to Rickshaw stop again."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 14, 2017",
    "review": "Nice small venue for independent and relatively new artists."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 9, 2017",
    "review": "Nice intimate venue. Street parking can be hard to find but there is a parking lot around the block."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 30, 2017",
    "review": "This place has a nice atmosphere for such a small venue. Sound system is decent. I've seen Powers here twice and the venue made it easy to get close to the stage. It's such an intimate venue, it was pretty easy to meet the band after the show and chat for a bit.My biggest problems are that finding nearby parking is difficult and shows start soooo late. From my experience, the headliners often don't go on until after 11. Overall, a cute quirky place to see up & coming bands!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 19, 2017",
    "review": "Thuggish bouncers. Impolite security. Mean vibe. Terrible drinks. All my friends had a bad time."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 12, 2017",
    "review": "I entered the club as the show was finishing. I paid the 10$ cover. They didn't say anything to me. I saw people leaving 10s after I entered.I went straight ahead to the entrance and ask if I could get my money back and leave. They refused although I entered 2 min before."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 24, 2017",
    "review": "Went here for a concert for Oh Wonder and it was such a quirky, little venue. The front is a huge purple mural and you won't actually see the venue's name outside. The venue has a general admission floor and a balcony upstairs with sofas and stools. I would definitely say that the center front stools on the balcony are the best seats in the house. For someone 5'0\" tall, it's always godsend to be able to see the entire set. With two bars on each floor, you won't have to struggle getting drinks either. What I love about this place the most is the intimacy you'll find here, watching your favorite band or whoever. The place can still hold a good amount of people, but the intimacy factor of it isn't reduced. If you're familiar with other venues in SF, this place is larger than Brick & Mortar, and similar to The Chapel. Also, Aaron Axelsen is here on Fridays and he seriously made the wait before the concert and in between bands poppin'. He's also on 105.3, but I'm not too sure when he's on exactly. Usually later in the evening. Anyways, I feel like he's always bringing out the dopest remixes and he's such a good source for new music. I was really stoked to find out he was the one DJing."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 12, 2017",
    "review": "It was a great event! The bartenders were fast! But they truly looked like they hated me. I tipped every time...but the hate ran deep...? I didn't fart or anything, soooo...I can't say it was my fault or anything."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 2, 2017",
    "review": "This is a cute little venue and I was excited to for the show I went to here. I do have one warning if you are under 21. Be very careful and don't get too close to alcohol. As soon as we got inside, one of the bouncers was staring us down and following us around. My friends who are over 21 ordered drinks, and even though I didn't get a drink, he took the first chance he got to kick us out. He was very rude and aggressive about it and so were the other workers on duty. They didn't even want to hear our side and were acting like power hungry assholes. Beware if you are under 21, you will be watched like a hawk. I don't even know if the show was good, all I can say is the bouncers are terrible."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 27, 2017",
    "review": "If I could put 0 stars I would. Worst experience I've ever had at a show. The door men and managers are the most rude, obtuse, pompous, pretentious, narrow minded, petty, Inconsiderate, unsympathetic, insensitive, ignorant, and underwhelming people I've ever met. I drove 20 hours from Colorado to see Rainbow Kitten Surprise in San Francisco on spring break. I have followed the band since their first album in 2013 and couldn't have been more stoked to see my favorite band on their first tour. I purchased my ticket months in advance for the show. When we showed up at the door my ticket wouldn't scan. The manager came over and told me I bought the ticket for the earlier 5 o clock show they had and that I'd have to buy another ticket to get in. Ticket says 5pm-2 am. Never have I heard of a venue playing 2 shows in the same night. After pleading my case and telling him how far I came to see the show he told there was nothing he could do. (Meaning he's just a lazy manager) And subsequently kicked me out because he just decided he didn't want to argue with me."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 22, 2017",
    "review": "The female bartender tonight was AWFUL, rude, but mostly slow.  If you want to make $$$ for yourself and your fellow bartenders, learn how to multi-task or fuck off.  It's not that hard.  If you hate what you do I garentee everyone around knows."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 4, 2017",
    "review": "Do not bother to come to this place. First the security is the most rude Guy in the world. Very small place, super hot. the drinks are awful."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 20, 2017",
    "review": "First time at Rickshaw Stop; didn't really know what to expect. I went there to see LÉON. I took BART in so I didn't have to deal with parking. Was about 8 mins from Civic/Downtown to Fell and Van Ness so super easy to get there. From the person checking ID's, to the stage crew - every single person was very nice, friendly and up beat. The balcony is cool, the couch in the back is comfy, the wooden boxes to sit or stand on on the sides of the room are a great touch. The sound system is awesome! Not too loud and high quality sound! I had a great time to see an awesome singer. The beer was reasonably priced and the bartenders are way hot! Would not hesitate to see another show there - I had a great time!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 13, 2017",
    "review": "great venue, great music always, great crowd always , always professional and respectful security, bartenders really helpful"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 10, 2017",
    "review": "Great venue! A smaller club, but actually lots of space! I like to go upstairs to the balcony, there are usually some chairs there and you can lean against the railing and see the show perfectly. There is also a bar up there as well as the coat check. Lots of parking lots with reasonable rates nearby."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 21, 2017",
    "review": "I can't say that I'm still a fan of the Rickshaw Stop. I like the small intimate size. And I like that the restrooms are by the door and there's hardly ever a wait. Drinks are pretty cheap and I like that the water is self-service at the end of the bar. But the shows start late and go really long. The doors don't open until 8 o'clock, and the first act doesn't usually go on until 8:45. And don't expect the main act until well after 10. At the last show, there was a half hour wait between the two. The place was full, the stage was set, and everyone was antsy and ready to go. Is it a ploy to sell more drinks? It might not bother me if it a was the weekend but on a weeknight when I still need to take public transportation home and get up at 6:30 the next morning to go back to work, I'd like to wrap up at a reasonable hour. Subsequently. every time I've been here, I've had to leave before the main act was over which sucks. Another thing is that sound system isn't very good. I didn't realize how bad until I saw a couple of shows at The Independent for a few dollars more on the ticket price. I could hear every word the singers were singing. At the Rickshaw, the bass is really low and throbbing sometimes to the point of ridiculousness. Even in the intimate moments of songs, when the artist is playing the keyboard and singing, the sound is muddy and distorted. Not OK! They do have a balcony with a few seats but they'll be taken early by people who know they're in it for a long haul."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 25, 2016",
    "review": "I saw Mako here. I can't complain much -- it was a small, intimate venue with hipster vibes, which I really liked. You get a great view of whoever's performing no matter where you are on the floor. The crowd, thankfully, isn't too unruly. The tickets were also very, very cheap - $36 for two tickets after taxes/fees and everything!I only have a few minor complaints. The sound system could have been better -- when a violinist was playing, I could barely hear that part, which was sad, because the violinist is a big part of the song. Though I'm not sure how much of that is the performer's fault vs. the venue's fault.The ticket also said 8pm, but Mako didn't start playing until much later -- probably around 10. I was a little annoyed at the time, as I didn't know how much time I was allotted to skip the opening act to finish up a task I needed to do. I'd have liked a little more transparency in terms of when the acts started/finished.But those are only minor issues. I totally recommend this place for concerts, and I wouldn't mind going back at all."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 20, 2016",
    "review": "Saw Hayley Kiyoko here. LOVED the sound quality. Pretty friendly staff at the bar and door and great meet and greet experience."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 19, 2016",
    "review": "Place is super small. Sound system could be better. When they turn on the AC starts leaking from the ceiling so we was super uncomfortable having water drop on top of your head. If you plan on getting super drunk here just don't throw up because once someone throws up.... its hard to escape the smell cause the place is so small."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 4, 2016",
    "review": "Saw Lewis Del Mar here and they were amazing. I think the tickets were $15 after fees which is unheard of.This venue is a gem for shows, it's small so it's very intimate. There's an upstairs that has seats but I didn't venture up there. There's a bar on the first floor and they take cards, and there's a $20 minimum. We got there around 8:30 and we were right up against the stage. Chill venue with very friendly staff, I can't wait to see someone else there."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 4, 2016",
    "review": "This place seemed quite disorganized and poorly run. For a concert supposed to start at 8, the line didn't even start entering til 8:20. Once inside we waited, listening to bad DJ music, for a pointless half-hour until the opening act showed up, so it was nearly 9 before anything worthwhile began.The opener spent far too much of his set rambling aimlessly instead of singing, and repeatedly/effusively thanking us for showing up. After his set we waited through another 45-minute nothingness for the headliner, who performed for barely an hour.This kind of entertainment ratio is insane. Worse yet, the place has almost no seating to speak of, save for a dozen or so wooden cubes around the edges. We won't be back."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 3, 2016",
    "review": "Had an amazing time here for a Calum Scott concert, his first time in SF! Love that the rickshaw is such a small intimate space and can bring in artists like Calum Scott who are so talented and genuinely excited to be performing.Only downside for me is...It's basically standing room only....and I'm not as young as I used to be."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 12, 2016",
    "review": "The venue itself is cool I like it there I went for emo nite n had alot of fun. My issues were with staff. Couple of the bartenders are rude and most of the people working seem to hate their jobs. More specifically, someone broke a glass by the stage n my friends and I tried to move it out of the way so nobody would get hurt. As an employee was walking by collecting glasses, I stopped him to let him know one broke. He didn't stop or even look at me just replied with a snobby attitude \"I don't have anything to clean it with\" and just walked away. YES I CAN SEE THAT BECAUSE I'M NOT BLIND I was letting you know so someone wouldn't get hurt because you kinda work there don't have to be a douchebag. Anyway, some of the staff is my only complaint otherwise it's a cool venue."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 22, 2016",
    "review": "Nerd nite - venue will be packed and seats will be quickly taken.  Seats are hard.  Our experience was saved by the 20,000 Leagues Under the Sea presentation which was fantastic otherwise it'd be 2 stars."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 26, 2016",
    "review": "I love this venue! I came to see Reeve Carney, who was absolutely amazing, here last night. Been here for a couple other shows in the past. The venue is very intimate, the ambiance is nice, and the layout is very open for it being such a small place. The guy working the door was super funny and the bartenders were friendly. Can't wait to come back again for the next show!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 26, 2016",
    "review": "This place always seems to have the best upcoming indie acts. Bigger venues like The Fillmore and Bill Graham might have some of the bigger names, but whenever I discover a really great new indie band and see they're playing in SF, it seems like almost every time they're playing at rickshaw. I go to a concert at least once a week, and over half of them have been at Rickshaw, and it's not like I try to go there I just kind of end up there after looking for shows I'll like. It's a small, intimate venue, and much more relaxed than places like the fillmore. I've seen people standing on benches and even sitting on the piano (down on the floor, not the stage) and no one seemed to mind. This could be handy if you're short, especially since it's a fairly low stage so if you're shorter it can be a little harder to see (it's not too bad for the short folks out there though, in addition to standing on the furniture you can pretty much show up 10 minutes before the music starts and secure a spot in the front, or go off to the side if you don't mind the awkward angle but still want to see).The sound system sounds great, though I'm not audiophile so I cant really say much about the quality other than it seems perfectly fine. I can say though that they've probably got the best lighting system of any similarly sized venue in town, and they've just put in four brand new high tech led spotlights that look fantastic, and this is in addition to what was already a really nice looking set. Once the music starts it looks absolutely gorgeous on stage, and unfortunately your phone camera will never do it justice.The shows always are listed at 8, but they always start the music 40-50 min after, it seems to be a rule that the artists wait until at least 8:40 to start. The headliner will usually start at around ten.I don't drink, so unfortunately can't tell you much about the drink quality or pricing. They do always have a drink themed on the band that'll be playing, so it's kinda fun to see what kind of drink related puns they come up with.My biggest complaint is the lack of box office hours, you can only buy the tickets online or at the door of the specific show (can't buy tickets for a different show). I've heard you can buy the tickets for there at the independent and some other places, but I've never tried it. Also it's cash only, which is kind of annoying. But hey, buying the ticket is always the worst part of a concert right?This is a great venue, very conveniently placed (right smack in the middle of town and two blocks away from bart/muni underground), cheap tickets (usually around $14 at the door), great sound and lighting, and most important of all always having the best acts, I plan on returning often"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 12, 2016",
    "review": "This place is the best. They book amazing bands. They have one great bartender and the red velvet curtains make me want cake and the stage is the perfect height to scope all the cute bois  and the I stood and a/c all over my face, great air circulation and even though one of their strands of Christmas lights was out I can forgive them bc the fog machine was sooooOoOoO dank. All in all five stars"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 24, 2016",
    "review": "Came here to see The Drums and it was a perfect size for an obscure show like this. That is the aspect I liked the most about this venue, how you can get very close to the stage and everything is cozily compact without making it feel uncomfortably crowded or hot. The acoustics are great too!There is a bar to the right of the stage and a small seating area to the left. Also, there is some outdoor seating which is convenient when waiting for doors to open. Whether you know the musicians or not, the people, location and size of this place makes it so easy to enjoy an intimate show for an affordable price. Plus, the performers are clearly displayed on their front sign which I always enjoy scoping out when along Van Ness. :)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 18, 2016",
    "review": "Love the venue. BUT last night my friend got jumped by a group of about 8 guys. They claimed he knocked over one of their drinks. Security (pink hair) held him in place while they repeatedly punched him and made him defenseless. He did not help stop the fight he made the outcome much worse. Another security guard was friends with the violent group. After apologizing to us for what had happened they asked us to leave. We wasted money on the tickets and drinks. Also got charged $40 at the bar and only ordered one drink."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 17, 2016",
    "review": "Really cool place with horribly rude staff. I bought tickets in advance to Jerry Folk with my significant other. I went into the venue and I am a few weeks out from my 21st birthday while my significant other is 24 years old. Neither of us bought drinks the entire night, being that we were only there about an hour. Someone came up to me that worked there and accused me of scrubbing the x'es off of my hand that indicated I was under 21. In all honesty I DID NOT do that. I used the bathroom about four times while I was there and washed my hands each time so the x'es of course washed off slightly but you could still see them on my hand. He asked me to go back to the bouncer in the front to re-mark my hands in which I was completely cooperative with, even after feeling very offended and  accused. The bouncer asked me what had happened and again I repeated to him that I had used that bathroom several times that night to which he accused me of drinking before hand and would not let me back into the rickshaw, AFTER I had paid beforehand for the specific DJ playing that night. With no protest, my s/o and I left and I feel extremely upset at the way this situation was handled tonight and will be letting ALL of my friends from college know that this place sucks going out to. I will let them know that that staff there is unfair and rude to those who may be underage and in general. I will let my friends of age know to never give there business to a theatre that accuses innocent customers of doing something wrong."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 12, 2016",
    "review": "Worst customer service ever. The bouncer said he was \"too stressed out\" to answer our questions about ticket sales. Shouldn't you be prepared for much more stressful situations if you've chosen a career as a bouncer? They were extremely rude and dismissive and seemed totally unprepared to handle a big event. Would not go here on a Friday or Saturday night. Or ever, for that matter. Will never come here again!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 14, 2016",
    "review": "As an SF native, The Rickshaw Stop is my favorite venues in the city. Come here to see unknown bands before they get big. Ticket prices are reasonable, they have games like foosball and skeeball, and it's walking distance from Hayes Valley, which hosts many wonderful bars and restaurants (some of my favorite being Two Sisters, Smuggler's Cove, and Domo Sushi). I would 100% suggest buying a ticket to a band you've never heard of and attending with an open mind :)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 27, 2016",
    "review": "Great little venue with awesome sound, look and ambiance."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 19, 2016",
    "review": "Pretty sweet venue! Not huge and not grossly crowded either. There's an upstairs and downstairs and you can see the performer pretty well in either area. $20 min for card I believe for the bar. It was like a $20 cover fee too when I went."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 15, 2016",
    "review": "The Lukas graham show was fantastic!!! The girl at door taking the tickets was unnecessarily rude though :/"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 30, 2016",
    "review": "I've been here twice! Once for Mikky Ekko, and the other time for Oh Wonder. The place itself is fairly small. The bar is located on the right side and there's also an upstairs area for stage viewing. There's also a bar upstairs also. For the performances, the crowd literally starts at the edge of the stage. Gives off an intimate vibe with the artists that I really enjoy. Comfy and cool place overall."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 19, 2016",
    "review": "Came here on a Friday night to see Crywolf. The price of the drinks was reasonable for the amount of alcohol. We got 4 whiskey shots with chase and 2 irish car bombs for 60 dollars. The place was great for Crywolf concert! We got to be very close to him. The bathroom there was also decently clean. Definitely recommend this place for small venues."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 16, 2016",
    "review": "I was here again for Nerd Nite where they have 3 speakers talk on a subject they have expertise on. Tonight's topics were stem cell research, architectural history, and the prison system. I had a nice time, but this venue was too tight for all the people. People were sitting on the floor or sitting in chairs. There was beer sloshed everywhere. It was just too hectic. Nerd Nite should be in an office space, church, library...anywhere with enough space for people to sit."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 16, 2016",
    "review": "I attended a concert here. The tickets had sold out weeks before, it is a small venue so need to act fast.  Enjoyed the drinks and the cozy environment. It is not a big venue although still lots of space to dance and it does not feel like cramped quarters. We had a major issue with the air conditioning that made it pretty bad after the first three songs. They fixed it mid concert but the downstairs back area never got any better, closer to the stage was ok."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 17, 2016",
    "review": "For Nerd NiteKey tips- Buy tickets ahead of time (as in a week ahead of time). They do sell out. They sell 30 tickets at the door but even when buckets of rain were falling from the sky there was a line of people who had been waiting 30+ minutes for these standby tickets.- Line up ~6:30p if you want seats and a clear view- Come with an open mindThe venue was easy to find by Van Ness and Fell. Plus there will likely be a long line forming anyway. The location itself lacked seating leaving many on the floor and uncertainty whether there was a clear escape route (say if I needed to visit the ladies room). Thankfully people at the floor sat down and my view from a chair was perfect. They serve food and drink if you are hungry but I personally didn't feel like throwing $8 for a grilled cheese. As for nerd nite itself, I appreciate that there were 3 different topics; however it really is a hit or miss. It is best to buy a ticket if you have interest in at least one of the topics because otherwise these are volunteer lecturers and not professional speakers."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 24, 2016",
    "review": "There's no doubt about it, the Rickshaw has been my favorite venue since I was in high school. Not too far from Civic Center of you don't mind trudging through the  Burger King favela, you'll find yourself at this oasis on Fell, a place with cheap drinks ($10 card minimum guys, sorry!) and the best artists, be they well-known or relatively unknown. The place has one charming quality that I can't seem to find anywhere else-- intimacy. To come as close as you can to your favorite artists, completely in their element, there's something raw and authentic. Someone will miss a note or botch a cord and nobody feels shy about it, artists feel a certain openness here that is unfound anywhere else I've been. When I see a show here, it's always a chill crowd and an honest, interactive experience. And at be end of the night, I stumble through the homeless encampment with my stolen band poster (sorry again Rickshaw!) and grab some chicken fries before I hop on BART.   The to-go spot."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 17, 2016",
    "review": "Rickshaw Stop is such an intimate venue. It's VERY small. I've been here twice now for two different shows -- one was for a sold out show (Oh Wonder). The merch table is usually set up by the front door, near the restrooms. There's a bar downstairs. $20 minimum on cards. A beer & a jack & coke was ~$14. The stage is set up downstairs and it's literally the smallest stage I've ever seen. There definitely isn't very much room on the stage, but the dancefloor is decent sized. It makes the shows very intimate since you can get right up close and personal with your favorite artists. There is also an upstairs balcony area, which is nice when you go to the really packed shows. If you're short like me, it's fantastic being up there because then you can still see LOL. Sound quality is pretty great, since the venue is so small ya know, it's not too hard to see/hear everything very well. What else is there to say? Great bar/venue to see some of your favorite artists in a super intimate setting. I would definitely recommend checking out a show here if you get the chance!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 16, 2016",
    "review": "It's a nice small venue. Went there for the first time to see Oh Wonder. Despite the small size, the venue can still pack quite a number of people, so if you're attending a sold out show, go early if you want to be close to the front. There's a balcony as well. I didn't get a chance to check it out, but there are seats up there (ground floor is standing room only). The people working there were nice, and I'd probably go back if there's ever an artist I like performing there."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 23, 2015",
    "review": "Cool little spot to see a show.  Good prices on booze and easy to get drinks.  Only downside is the artists go on very late. We showed up around 10 or 10:30pm here to see Reptar and the opening act had just started playing.  Good thing we were not planning on taking the Caltrain back to Palo Alto - Reptar didn't go on until after 11:30pm."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 15, 2015",
    "review": "RE: Party venueThis venue was recommended to me through a colleague and as soon as we visited the space, we were sold. Thanks to Dan, Harp, and their team, we had the best corporate holiday party our staff has ever had! Dan was incredible to work with and made sure we got a great deal. He was easy-going, helpful, and genuinely excited about the event which made planning so much more enjoyable. They made setup and cleanup a breeze, allowed us to move things around to fit our party's needs, and even helped decorate with the holiday vibe we were going for. You could tell everyone wanted to help us have a good time and keep things running smoothly. The drinks were good (they let us have 2 custom drinks on the menu which was fun and popular among guests), the bar service was fast and easy (we used the drink ticket approach), and Dan was fast and easy to communicate with throughout the entire process. Parking and safety were non-issues, there was plenty of space for our 150+ guests, and again the vibe the space lends itself to is just right for a trendy mingling and festive atmosphere.If you're looking for a hip, cool place to throw a party, this is it! Seriously, give them a call."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 15, 2015",
    "review": "I loved the vibe, I loved the band, I loved the venue.....except for THE SOUND. It was so loud that you could not distinguish one guitar from the other...the bass was this huge thumping drone, and forget about understanding any lyrics. At one point (on 12/14/15) Murray Lightburn from the Dears was onstage with just an acoustic guitar doing a beautiful song with quiet dynamics, and it was still so loud that everyone kept their earplugs in. It's just ridiculous. In an intimate atmosphere you should be able to hear EVERYTHING. I actually went up to the guy at the booth in between bands and politely said it was too loud. He just shrugged. The same deal at the Bottom of the Hill...volume to the point of mandatory earplugs and total quality distortion. Disappointing....because the venue is great otherwise."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 13, 2015",
    "review": "If a new band books a gig at Rickshaw, you can bet they're going to start making it big in due time (Ellie Goulding, Lily Allen, Bastille, Sam Smith, The Wombats, etc.) Overall, i love this venue and the hidden crazy gem that it is. Rickshaw is small enough so that if you get there early, you can literally be inches away from the performers, but it's also large enough so that you can get down and groovy upstairs and in the back. However, it does get insanely packed, so be warned if you're going to a sold out show. If a show is sold out and you are kicking yourself in the butt for not getting tickets in time, have no fear! They usually sell a limited number of tickets at the door, so get there early if you want to score tickets. There is also an open dance floor after the gig is over, which is always fun. The performances are always fantastic and if you're from the bay, I highly recommend seeing a show during your time here. It's definitely a bucket list venue for the avid concertgoer."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 6, 2015",
    "review": "You're an idiot if you rated Rickshaw 3 stars or less.  This small, cozy venue is pulling in some serious talent.  The tickets are cheap, the drinks are strong and cheap, and staff is attentive.  What's not to like? Idiots."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 4, 2015",
    "review": "I've been here multiple times and every time I go the bouncers are assholes. I was physically and verbally assaulted by a woman bartender for accidentally bumping into her on the dance floor. They are very strict on underage drinking, and every time I go I see young women/men getting kicked out way too aggressively and unnecessarily yelled at.I understand wanting to enforce an important rule, but it seems like all it's doing is giving the people that work there leeway to push around and LITERALLY throw out paying customers.  Overall though, the venue is mediocre, the crowd is alright and the drinks are okay."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 2, 2015",
    "review": "Great venue for intimate shows with up-and-coming artists, nice staff, and pleasant atmosphere. I saw Mikky Ekko here in October, and the whole experience was delightful (despite the intoxicated girl in front of me staggering back into me every two minutes). After the show, Mikky Ekko and Transviolet (opening band) stuck around to meet fans, and that was awesome too. I would most certainly come back for more shows."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 11, 2015",
    "review": "Rude people spilling drinks on me despite my polite protests. Bar tenders are great!  Crowd was rude and undesirable considering the offender was literally pouring his drink on his friend next to me multiple times during the night."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 3, 2015",
    "review": "Rickshaw Stop is a great venue to see the latest upcoming artists before they make it big.  It's also the best place to see upcoming artists before they never make it big.  It's also a great place to get a pint of red bull and vodka for $8 (WHAAAT?)I'm a bit of a concert fiend, if you will.  I find myself at all the hottest venues seeing all the major acts before they become big (humblebrag?).  Rickshaw is one of the great places to do this.  In truth, you don't know what you're going to get at this place, but it'll probably good.  In truth, I had a friend whose purse got stolen here and that was kind of a bummer.This city needs more venues like Rickshaw Stop.  However, beware dear reader that some shows are 18+ and some are 21+ and you might not be sure which one you're about to go see (gasp)!  If you're a 21+ kind of person then double check before you agree to get down with that musak.One of the major pluses of Rickshaw is that you can get so close to the stage you can practically smell the sweat of the performers, if you're into that.  It's intimate, small, with good acoustics and great acts.  There's a bit of a swindler crowd that likes to prey on the vulnerable, but if you come lightly dressed you should be okay!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 3, 2015",
    "review": "Great atmosphere, solid drink prices, and rad DJ's/themed nights. Club 1994, thoughhhh! Also, free hair styling for Bardot-A-Go-Go. Nuff' said.The bar staff is super chill, and the redheaded security dudes are some of the nicest people I've met. Not even kidding. If I have questions about late night places to grab a drunken bite, they always give me good options. Some of the events seem to sell out hella quick, so my advice is getting tickets in advance/arriving earlier. Love this place!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 26, 2015",
    "review": "Been here twice for some indie shows. Sound is good. Walls are soft and comfy..."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 24, 2015",
    "review": "Took out $60 from their ATM before watching a friends show, and woke up the next morning with $45. Drinks are cheap, music is good, it's not so oppressively crowded that you can't go to the bar or the bathroom and make it back to your spot in the audience. Couch space available for anyone that needs to take a seat, too. Best part: CLOSE TO BART. Yay."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 22, 2015",
    "review": "My homie lost all of his stuff but an employee who looked as if he belonged to the band that is Tame Impala helped him return his belongings Thanks rickshaw stop"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 19, 2015",
    "review": "My first yelp review because that's how bad this experience was. I've been an avid Nerd Nite attendee for over two years now and absolutely love the presentations. I've always known it can get a bit full and you need to get there early to secure a seat or a spot on the floor. We arrived right at 7 when the doors opened, grabbed a seat at a bench upstairs near the rail. At 8 when the show started we were told we couldn't sit at the bench and needed to find a new place to sit. After an hour of securing that spot. There was no place to even stand and half the people standing near the bar couldn't see the presentations. They pack the bar in past maximum capacity, the staff is unbelievably rude and it is no longer worth going to nerd nite because of how crappy the venue is."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 18, 2015",
    "review": "My friend and I were drinking sunny d in line for a free show. The guy carding everyone took our sunny d bottles and said we weren't getting in. He didn't explain anything. He just took our bottles, tore off my wrist band, crossed out my friend's X's on her hands and told us we weren't getting in."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 23, 2015",
    "review": "I went here with my boyfriend to watch O and Astronauts, etc.!!  This venue is pretty small but has a mezzanine where you can sit and not be so stuck in the crowd.  We were standing at the front of the stage...and it was FREEZING!!! But we stayed at the front because we totally thought we were gonna see toro y moi (according to bandsintown he was gonna dj) ((but it never happened))... anyway, the room did not get any warmer for me and my bf even when the final act came on and the crowd actually started to move around and dance more.  if u want to be at the front where the stage is, then wear 10 jackets or dance constantly so u dont freeze to death.  otherwise, i suggest staying in the middle of the crowd, on the balcony, or anywhere else where the ac wont be blowing straight at you."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 7, 2015",
    "review": "My experience was very good,They had good music,Drinks were ok and well priced they had two floors last night there was plenty of space on both but still not a dead club"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 30, 2015",
    "review": "Went here for my first time to see Brandon Flowers 2 weeks ago. Its small but intimate. I was so close to him! *dreamy sigh*. Anyway, It's a small venue with an upstairs area that I didn't go check out cuz I was too close to the stage to want to go venture off lol .. Affordable stiff drinks and good music. Will most likely go back for a night out."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 17, 2015",
    "review": "Such a great venue!  Great staff, cool area and the drinks were stiff! Had the most amazing time enjoying the concert and dancing to the DJ all night! No matter where you stand you will have a perfect view of the show!!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 2, 2015",
    "review": "My first time I'm San Francisco,  I was looking on Yelp for a cool place to watch some bands play.  It was $12 to get in.  The venue was a good size. Very beautifully decorated.  The people here were chill.  Some people were too comfortable to be near me but it's alright,  the more close the merrier. The bands were awesome some kind that was enjoyable.  I would come back here again.  Looking forward to it again sometime in the near future when I come  back again.  Until the next time"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 8, 2015",
    "review": "...came out of Uber and steeped in the line to attend \"kafana balkan\" and the security guard out of nowhere started to be rude on me ant the girl with me, we didn't even say a word when he started yelling for attention!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 6, 2015",
    "review": "Fun great venue just not a fan of how they drag out the headliner's perform time."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 1, 2015",
    "review": "Popscene is really fun!  I saw a great band here but the lineup was really late. Seemed like the drinks were good. Balcony was great for some seating."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 6, 2015",
    "review": "If you want funky,  come here,  if you want electro swing, come here,  if you want artists you've never heard of and don't want to tell anyone about because there so good,  come here.  The vibe is always good,  the amount of people can be much at times,  but the music never disappoints"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 6, 2014",
    "review": "Rickshaw hosts some really fun events, but use cash; DO NOT use your card at the bar because the bartenders will take liberties with your tab."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 18, 2014",
    "review": "To put it simply, Rickshaw Stop is like an insane asylum, with a stage. It's just a huge box of a room, with cushion-like walls. If not for the stage, the lights, and the bar in the back, I'd think I'd have gone crazy. Instead, you've got some great tunes to go crazy about.Been here just a few times now. Saw the Fratellis and Monarchy here. Sound for each band was pretty great. I think they could have kicked it up a notch when it comes to the loudness, but then again we don't all wanna be deaf right? The venue itself is small enough for you to get a pretty decent view of the band from wherever you are. They've also got a pretty nifty little upstairs balcony if you want to have a seat as well. Perfect for those post-25 concert vets whose knees can't take standing for hours on end.They've got themselves a bar, but that's about it when it comes to that. They usually have a few nightly specials, but other than that it's just a kinda small bar. The Rickshaw is a pretty fun spot for concerts. Yet another reliable venue in the city!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 20, 2014",
    "review": "This club venue has potential. The inside is fairly small and when it gets crowded, it can get pretty humid with all of human body heat. Its lack of ventilation makes it hard to dance on the dance floor for a long period of time without breaking out sweats. The one particular event that I go here is Gameboi, they have a great crowd and  a lot of pop music. They even play occasional K-pop. It is a 18+ up place, those over 21 will get a wristband to show they are able to drink while those under that age group will be \"X\" (permanent marker X on both hands LOL)."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 30, 2014",
    "review": "Sosh made me think the ping pong night would be fun. I was miserably disappointed.  Dirty hipsters, 1 ping pong table, \"around the world ping pong\", sad decorum. +1 star for lack of food poisoning."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 25, 2014",
    "review": "I was finally able to see a show at Rickshaw Stop just a few weeks ago. I nabbed tickets for Cathedrals' EP release party for Popscene. We arrived around 10:15ish and there was already a long line out the door. It was packed for a Thursday night. When we walked in, we decided to take a look upstairs, where there was a small bar and a balcony with a view of the dance floor and stage. The ceiling was pretty low on the second level. Back downstairs, we bought a couple drinks (there's a minimum if you wanna use a credit card) and made our way toward the stage. The sound was pretty good. Props to the lighting guys too. There wasn't much decor except for the velvet curtain that wrapped around the venue and the visuals that were projected onto the screen behind the stage. Ladies room had 2 stalls..it wasn't super clean, but we survived. There was one spot on the floor where a fan was blasting..good if you need some air, bad if you're trying to keep your DO in one place.The cool thing was that the performers could only access the backstage area by walking through the left side of the dance floor, so we were able to say hello and grab a photo with Brodie as she walked by. Total fan girl moment.I was stoked to finally get tickets to a show at Rickshaw Stop since it is a pretty intimate venue. Expect anyone that performs here to blow up within a couple months..i.e. Jessie Ware, Sam Smith, and pretty soon Cathedrals!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 9, 2014",
    "review": "Background: I went here for the Berlin Pingpong event hosted by....Sosh? I don't know who hosted it but I saw it on Sosh.Positives: diverse demographic, CHHHHEEEAAPPP drinks, takes credit card, they host events like Berlin ping pong...Negatives: the demographic is dirty hipsters,  they play (or at least when I went) did not play the best hip hop music, it was very underground and very awful, the atmosphere is just poorly decorated and poorly up kept"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 8, 2014",
    "review": "Funky lil spot on Fell for a casual dance-party in what feels like your weird neighbor's garage. Have now been to Rickshaw Stop twice and each time feels like a hipster house party. (ie-you leave feeling a little bit cooler than you came.) The venue is very small, or shall I say \"intimate,\" so definitely a place you could come to alone. There is also a lounge type area upstairs with VERYYY comfortable couches if you're tryna take a quick snooze.They tend to cater to quirky but SOLID indie bands and tickets are cheappp so even if you're not super familiar with the band, chances are you'll have fun, or at least enjoy a nice sit on their couches."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 24, 2014",
    "review": "I go here for Gameboi and love it. The single stage and dance floor keep things centralized and for those who need to get out of the crowd, the upstairs is a lounge area. Drinks are cheap and the bartenders are quick."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 23, 2014",
    "review": "This and the Bottom of the Hill have become my two favorite spots to catch a concert in the city.The venue is located in Hayes Valley, which makes it super easy to get to from the Van Ness muni-metro and most buses. The location is also ideal for grabbing a bite before the show (try Rich Table or Chez Maman) and some cocktails after (try Absinthe or Brass Tacks).The space itself is large enough to get some great traveling bands, but small enough to feel very intimate. The stage isn't raised very high and there isn't any noticeable security or barriers set up so it's a great experience to watch the bands perform up close (just watch your head for any flying limbs from the circle pit at punk/metal shows). Btw, there's a mezzanine level with two levels of couches and benches if you want to stay out of the mix.Lastly, the shows are typically super cheap for SF standards ($10-20) as are the drinks. The bartenders are pretty fast and friendly as well, so that's a huge win."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 1, 2014",
    "review": "Cool little venue. Cheap tickets. Strong drinks. Clean bathroom. Good mix of people. Nice bartenders."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 25, 2014",
    "review": "Came here to see Sam Smith, great intimate venue, cash only drinks, great concert experience"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 15, 2014",
    "review": "The Rickshaw Shop is a nice little event venue located near the Civic Center.  I came here for the Kina Grannis concert and thoroughly enjoyed my time.  It has an intimate setting with both a top and bottom floor for the audience to watch.  There's a nice bar in the back with well drinks and beers for your to enjoy while you're at your concert.  Most importantly, the venue was well ventilated, air-conditioned, and never felt uncomfortable for the viewers.  If you have a concert here, you'll always have a great view and a wonderful experience!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 13, 2014",
    "review": "This review is for the staff. They had a horrible bouncer outside The Moth event yesterday. He harassed my friend because she had a paper driver's license while she was waiting on the plastic one to be sent. She is 29 years old, come on. When he checked my ID he didn't even see my birth date because it was in my wallet and he didn't even ask me to take it out. He was condescending, rude and just plain nasty!! After harassing my friend about a LEGAL paper ID that could be scanned to prove was real (he refused to try) he admitted the event was all ages and that he couldn't keep her from coming in. So he wasted 10 minutes of our time harassing her when he could have just let her in because it was all ages. We missed the opening of the Moth and we were just there to support the event! He marked her hands with 2 huge Xs in sharpie (very dramatic) and said you better not wash these off, you better not wash these off etc. We told him we weren't interesting in drinking we just wanted to see the show but he was relentless to show us he was on a power trip and in control. Horrible experience. I would not come back if he was the bouncer, I would literally turn around and walk away because who wants to deal with a hostile bouncer who is on a power trip."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 29, 2014",
    "review": "A really tiny venue so you're really up close and personal. We saw a really cool show with A Tribe Called Red. Even at the back, you could see them easily. They had looping movie scenes being projected on a giant screen on the stage. If you went to the bar in the back, there was absolutely no crowd. Our tickets said doors open at 8pm; A Tribe Called Red didn't start until 10:45pm, which we unfortunately didn't know until we got to the door at about 9pm - we actually just got our hands stamped, biked back home to the Mission, and came back out around 10:30pm. It was lucky that they allow reentry! I should've called ahead to find out when they were starting."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 27, 2014",
    "review": "Went to this place for a 90's party...it was awesome, drinks were decently priced, the music was good and they kept the party going till 2am. Not super huge, but big enough to have a good vibe and get your dance on"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 21, 2014",
    "review": "Doesn't answer phone calls or email. You're catering to a local crowd, so good for you - the problem is that I'm \"local,\" just not local enough to drive over there. Have fun on your island. PS, why bother having contact info on your website?"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 11, 2014",
    "review": "I expected a loud, hot, small, crowded venue when I found out the concert I was going to was here. I was pleasantly surprised when I got in. While it was an acoustic scaled-down set (with arranged chairs downstairs--I was told that is not normal and usually it's just an open space), there was ample non-assigned seating upstairs and a large bar downstairs where you could chill at the entire time. As long as I have something to lean on, standing ain't so bad. Bud was $3, which was incredible. I expected beers to be a minimum $6 since it's a concert venue, but that was not the case. A little annoyed a bearded bartender man bussed a half full beer I had on the bar (I ran to the bathroom, guess I should have went napkin over the top), but another bartender, upon hearing my plight, comped me a Dos Equis for the trouble, which was awesome. I'm sure they don't all run this smoothly, but definitely left satisfied."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 5, 2014",
    "review": "Can't tell what exactly the vibe is here, but this place certainly tops my list on SF venues because it gets all of it right:1) Cheap drinks (nice and stiff too)2) Unique vibe (you have corrugated metal and lights and vintage bikes and outdoor chairs everywhere... Maybe the theme is downtown Thailand?)3) Usually a good crowd4) Effective layout5) Nice sound system The acts that pass through tend to be on the underground side, but that tends to be the draw of this place. Go on a random night with some friends and you might find yourself with the next Lorde or LCD Soundsystem."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 29, 2014",
    "review": "What a way to spend a Thursday night!  Doors opened around 9:30 to a fairly empty club...however that changed pretty quickly.  A great DJ opened up the night, definitely got the crowd moving.  Then a two band set - Echosmith and Birds of Tokyo...never heard of them before but they are now on my radar.  Drinks were cheap and generous, bartenders cool and the crowd completely random.  Will definitely go back."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 25, 2014",
    "review": "Cheap drinks, cheap tickets, intimate venue and rock n roll. What more could you ask for? There is a great mix of people (rockabilly, motorcycle riding dudes, old dudes, yuppies (is that still a thing?), hippies, etc.) which makes for good people watching. Ended up standing during most of the show, which was nice. Much love to Rickshaw Stop for cranking up the A/C above the stage - vents facing the audience - once people started moving and the interior temperature started rising.Super friendly bartenders. The bathroom was as clean as you are going to find in a bar/music venue."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 10, 2014",
    "review": "The Rickshaw Shop, is a fantastic rock n roll club.  I traveled here to see Leslie and the Ly's from Iowa, While I was in town!  Funny I was seeing and Iowa band cause the Rickshaw reminds me a lot of the Vaudeville Mews in Des Moines, IA.. With the excellent stage site from the balcony!  The sound in the room was fabulous and the bartenders were wonderful!One of the bartenders saw my Minnesota Vikings credit card, and pulled her's out and said, \"You are drinking for Free all night!\"  This was not the case but lucky for me they did have some cheaper brews then most places I hung in San Fran.This place some might consider a diver bar, but I thought it was defiantly pretty clean and the bathrooms were well taken care of! All in all a stellar music venue and a must stop if your going to check out a show in San Fran!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 23, 2014",
    "review": "I've been to practically every single music venue in the SF bay area and somehow just managed to check out the rickshaw stop for the first time last Thursday to see an SF Popscene show.  Like other reviewers of this place I was a little discouraged to find out the super late starting time of the show (doors at 9:30!) but as soon as I walked in I felt acquainted with the pseudo-hipster yet unique vibe of this small 200-person or so venue.I'm a big fan of the 2 level upstairs balcony if you can manage to snag a seat before the show.  The sound quality is decent, the drinks are moderately priced and there isn't really a bad spot in the house.  Most acts that play here are relatively underground but that's part of its charm."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 18, 2014",
    "review": "I've seen a few of my favorite Indie groups here and have always had an enjoyable time.  There's seating upstairs if you don't want to stand all night with 2 bar areas.  There is no type of food served there so be sure to grab a bite before.  There is a girl selling candy for those with a sweet tooth though. haha"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 17, 2014",
    "review": "love the vibe and music played here. sick af. saw many good shows there. can get personal with artist. good drinks good company good time. always down to try things once."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 14, 2014",
    "review": "Just moved to SF from LA. Missed the LA indie music scene until I found the Rickshaw Stop. Great times - highly recommended."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 29, 2014",
    "review": "reasons why i love this venue:very small and intimateexcellent sound qualityno hard tickets sold - discourages scalpersnever a bad seat in the house given the sizecheap tickets - $15what i don't likeTHE SHOWS START SUPER LATE!!i'm talking like 11:30 on a tuesday.  i'm a working grandma, i just can't handle those kinds of hours.  so yeah, don't show up at 9pm for an 8pm show.  chances are you'll be wasted by the time the band shows up at 11.also if you are front row, watch out for flying drumsticks.  i took one to the eye a few weeks ago, right after getting LASIK no less.  talk about freakout!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 9, 2014",
    "review": "Random Wednesday I would drop by... and never be disappointed. Any bands targeting this bar won't be disappointed either."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 9, 2014",
    "review": "Love this spot.  Been coming here for years.  It has a very intimate, and dive feel.  People in here are cool cats.  Good chance you will catch a great indie band here.  I have seen a lot of good bands here, that end up getting super popular like a year or 2 later.  The people who book shows here know up & coming talent.  POPSCENE is great!.I took my 11 year old honor roll daughter here for a sold out Sky Ferreria show (All ages) last year at her begging request.  Don't get me wrong, I'm a super cool dad, and have seen, and done it all, but even I was reluctant to take my child to a late night music venue.Rest assured, we had such an awesome experience together, and every person in the jam packed house was super nice, and were even going out of there way to make sure she was comfortable in viewing.  My daughter felt the vibe fast, and fell in more love with the people of SF, and the regulars at this spot.This was our experience, and I thought it was worth sharing."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 7, 2014",
    "review": "Rickshaw Stop is, along with The Independent, one of the top live music venues in San Francisco. While their sound system is not absolutely amazing, it's more than adequate and the space lends itself to some pretty intimate experiences. I shook hands with Penguin Prison before he went onstage and thanked him for playing. I saw an amazing set by Tesla Boy (their first ever in the US) and was about five feet away from the stage the entire time. The Drive Tour was fantastic with Anoraak, College and Electric Youth all playing full-length sets.Rickshaw Stop has already provided me with memories that will last a lifetime and I hope there are many more to come. Definitely check out their regular Popscene nights where you'll be sure to discover a hot new act before they go on to play much bigger (and lamer) venues."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 30, 2013",
    "review": "Wanna hear some live music from your favorite indie band? This is the venue.It's a fun location with a GA area downstairs in front of the stage, plus a bar, while upstairs you have another bar and seating for those who don't want to stand/dance.You can have a balcony view upstairs or just chill on the back couches with the band playing in the background.The DJ has a set up on the side downstairs, where you can see the likes of Aaron Axelsen spin during his Popscene nights.Since it's a small venue, you can get up close and personal with the band, especially if they're selling merch at the table near the entrance, where a couch is also situated.The staff is really cool and they have a computerized check-in system if you purchased your tickets ahead of time online.*Tip: Bring your own earplugs, as they don't have any here.*Tip: Coat check is upstairs for $3.*Tip: Arrive when doors open if you want a sweet parking spot right in front of the venue."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 5, 2013",
    "review": "Gotta give this place props for great up-and-coming acts and interesting events with good variety. IT's a cool space. The skee-ball is a nice touch (though I keep not playing it, even though I feel like i will each time). It's chill, unpretentious, fun.Comfy-ish seating on the balcony. Drinks are very average, but fine. Snacks are good, approriate. It's an above-average, slightly-better-than-divey place. It's good to look at their calendar once a month or so and see if there's something that piques your interest. If there is, go. You'll be happy you did."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 21, 2013",
    "review": "Fun little small area to go to went there for GAMeBoi and had a blast the only thing that was a bummer was parking because it is in downtown n it's hard to find parking around there"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 1, 2013",
    "review": "The rickshaw is a great place to enjoy a concert. They host lots of great indie bands and each concert is always only like $15. Standing room with a balcony. Really up-close-and personal with the band.The location on fell is a little eerie at night, so bring a friend! Great Place, Recommended"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 17, 2013",
    "review": "Rickshaw is a good place for dancing and live music. They have a full bar, but I always felt like their drinks were a little overpriced. The women's restroom can be a nightmare. The upstairs is nice with plush seats and games. There is also a bar upstairs. I sometimes enjoy sitting up there when I'm there for a show, but you want to get there early to grab a seat."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 3, 2013",
    "review": "I used to love coming here when I was younger. For shows or just to hang out with friends. It has small intimate feel for shows, and good music for non show days. Great place for those under 25 to hang out. There is also a cool 2nd floor, but tables are hard to get, at least the one at the ledge. I usually tend to hang out at the bar downstairs in the back. Gives me a better view and away from the pillars blocking the stage."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 4, 2013",
    "review": "Good place for dancing and live music. They have 18 and over nights but you need to call and check or see if they have it posted online."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 1, 2013",
    "review": "funnnn venue, it's so cute how the second story also serves as a balcony to look onto the stage down below. On the second floor, you will find couches, chairs, a pool table, and other games/art that just gives this place so much personality. Concerts here are definitely intimate and awesome, so this venue is the perfect size to see your favorite artists when they come tour in SF. Drinks and beer are reasonably priced; I had a delicious glass of sangria that was only $5 and did not make my asian glow appear hahaha!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 27, 2013",
    "review": "As my first club, Rickshaw Stop has a special place in my heart. The venue isn't exactly the prettiest place - it looks rather sketchy from the outside actually. Even on the inside, it's rather austere, though the rickshaw is an interesting, nice touch.I cannot comment on the food or the drinks, but as a concert venue, it's amazing. The ground floor is rather large, so it's well-suited for the acoustics. If the show's ever too wild, there is also a second floor viewing deck. Though it may be case by case, when I went, DSLRs was allowed, so as a photographer, that was definitely a plus.I came here to see Boris and Deafheaven, both of which were amazing acts. For groups that had a really powerful sound impact, the venue and setup did them justice. It was an intimate affair, and I much preferred the atmosphere compared to a larger venue.The lighting of this place is also amazing, so props to whoever was manning the lights that night. My pictures turned out well, the atmosphere of the concert was chill, and even the people were very relaxed - much unlike what you may find at a more typical concert.If Rickshaw Stop ever hosts an act I'm interested in, I'll be sure to come back.TIP: DSLR Photography is allowed (or at least at the concert I went to), so feel free to shoot away!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 25, 2013",
    "review": "Fun little spot, for a younger crowd, staff is ok, sound is solid."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 19, 2013",
    "review": "Here's my tip for you: go for the sangria.  It's the alcohol value ratio by far.  Backing up:  went to the cool Movie Video Race event last weekend and loved being washed over by the hippity-hip-hip-hipsters. Even standing in line was awesome - \"hey - I went to a silent disco on twin peaks last night\" etc. Damn, the things you learn when you get out a little.  Got inside in time to actually get a spot with our backs to the bar to hold us up as the place filled up....and up.....and up. And we were right next to the free water station so once we were packed in like sardines, we got our body rubs free as people moved past us to get their free H20.Anyway, started with a drink special with tequila because they don't have a stout that sounded interesting. It wasn't so great and definitely teeny, so went for the sangria.  Hallelujah, I hit the motherlode!  $5 and the wine is laced with a hefty portion of brandy, so by the time I was two sangrias in and my friend showed up, I'm sure she didn't recognize my sentences as english.The bartenders were very friendly and the place reminded me a smidge of New Parish, for you Oaktown folk.  I could see the band that played fairly well, and the video screens were high enough up that even the amazonian people in front of us didn't block them too much. Seriously - hubby's 6'2\" and there were MASSIVE quantities of people taller than him in front of us. Is this younger generation living longer AND getting taller? Not fair man, not fair.Oh - final stamp of approval for the Boffo cart out front that sold the Yams. Holy sriracha sauce, them puppies are delicious!  And spicy enough that we shamelessly drank someone's open and forgotten bottle of IPA that we watched sitting there on the bar for 20 minutes with no one claiming it.  So there ya go - even got a bonus drink out of it. (Don't judge - you'd have done it too, I swear.)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 7, 2013",
    "review": "Richshaw is a great venue- tickets are really cheap, and even at a sold out show there was plenty of space.There is also an upstairs area to hang out with couches so you can listen to the band like a loser not next to the stage in the thick of it."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 25, 2013",
    "review": "I rang in the New Year at the Rickshaw Stop to see Turquoise Jeep.Drinks were cheap.Their house DJ is terrible.There is an upstairs area that I didn't visit."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 10, 2013",
    "review": "This is one of my favorite venues in San Francisco.  They have good bands that know how to put on a show but haven't blown up so much that there are a lot of jerks in the audience.  I saw how to dress well and sky ferreira last night; all in all a great show.  Sound quality is great though very loud!  Make sure to bring earplugs.  Nerd nite is pretty fun here too; though it gets extremely packed (haven't been in a long time because of that).  Also, efficient, good bartenders who make the drinks nice and strong."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 10, 2013",
    "review": "Bought tix on line a couple months in advance for my son and I to see one of his fav bands. I'd never even heard of RICKSHAW STOP..but, it was an all ages event (my son is 16), the location was decent, and the tix were only $12, so I took a chance. We arrived at 8 (posted start time) and waited in a long line outside. My ID was checked. My son was not required to show ID, but the back of his hands were marked with giant X's to signify no ID/underage. Once inside, we began to explore. Upstairs is a cute little room with a foosball table and a classic skee-ball game. Cool! Lots of chairs and couches for chillin upstairs. There are also 2 small tiers of balcony bench seating with a stage view. These spots were taken..so we went back downstairs. The staff was nice, and, although I didn't order a drink, the bar seemed organized and moving along at a good pace. This was a sold-out show (Sky Ferreira, How To Dress Well, and The High Highs) so I was pretty surprised we snagged a spot at the stage. Everyone was respectful..no cursing, drunken fools pushing up against us like at other venues. Sound system was amazing. Speakers took everything the bands could dish out with no distortion. Volume was loud, but not obnoxious. Watching each band set-up and tear-down inches away from us kept the 'down time' interesting. Security didn't trip when I snapped a couple pix (no flash) which was refreshing. The entire place (including restroom) was clean and well maintained. Can't wait to come back to this venue!!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 1, 2013",
    "review": "Such a small venue. But if you go when it's super crowded, there's a \"sweet spot\" house right that gets the best air conditioning. The balcony is also a fun spot to people-watch. Red Stripe is always my best friend when I'm at Rickshaw."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 29, 2013",
    "review": "We saw Youngblood Hawke and The Mowgli's here on March 8th. It was a truly great concert experience and one I'm not soon to forget. It is a more intimate venue, which could mean something negative, but it was extremely positive in this case. We were able to get seats up top and watch but then went down closer to the stage to dance and such. Drinks were moderately priced and very strong. Hoping to get back here some day!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 26, 2013",
    "review": "This a great small to mid-sized venue to see bands or djs.  Although it's essentially a big box, there's a mezzanine and the sound is great.  I've seen a lot of great shows here and am always pleased to actually be able to meet the bands afterward."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 15, 2013",
    "review": "This place is so loud. Tiny. Can get crowded. Hosts a lot of cool indie artists before they blow up. The bathrooms are disgusting and I saw two people drop their drink, thereby getting glass everywhere. Watch where you walk in here. Regardless, I'd probably go back."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 13, 2013",
    "review": "Awesome music venue! Most acts aren't \"famous\" but many of them will definitely get big. Like others have said, it's a great place to catch acts that will be selling out places at 2x the price a year later. The drinks here are pretty strong and the redbull/vodka's come in a pint glass!The balcony is cool and I saw that they have a foosball table in the back. Very limited seating, but who cares when you can be dancing! One negative is that the floor can get VERY smoky, I found it hard to breathe at times."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 12, 2013",
    "review": "Came here to see Jukebox the Ghost as part of Noise Pop fest. The upstairs is so much better than the downstairs. We actually found space on the sofas, even though downstairs was packed. Best seat in the house for an observer. Excellent show(s), however there really was something wrong with the sound board/mixer. There was some seriously annoying feedback. Overall though, it was a great show at a rad venue!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 8, 2013",
    "review": "Fuck this place. I hardly ever write yelp reviews but when a place sucks enough I feel then need to share with the public. Everywhere on their website and one the performer's website it sited that the show started at 9pm. well its midnight now and their headlining act hasn't even started. Okay I get it. Some super stars don't like to start on time. But 3 hours later? thats a bit much. I got fed up and decided to leave, so I went to close out  my tap. The male bartender scoffed at me and preceded to take 4 other orders before even trying to close my tap. I politely asked the female bartender (while I witnessed him serving 4 other people) to check on it and she gave me some bitchy attitude saying they're busy. I understand you're busy. I fucking work in the service industry and I get that thursday-sunday are your busy nights, but don't give me that 'holier than thou' bartender attitude that you think you're deserving of. Then I went to ask for a refund of my money, since I waited 3 HOURS to see someone play, all I got was attitude.Your venus is OKAY at best with your shitty acoustics. Your bartenders are less than personable. Here's a tip. Hire better bartenders who don't give attitude TO PAYING CUSTOMERS, and don't advertise for a certain time and start 3 hours later"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 7, 2013",
    "review": "This is such a cool venue. Very intimate, and there is no other place that I would like to go see bands perform at. They have some fairly big name bands come through so checking their lineup is a good thing to do every once in a while.I personally love the upper loft because who doesn't want to see some great musicians perform while you get to hang out on some couches?Also, this was my first experience ordering from a \"bar\" as I chose to come here to celebrate my 21st birthday. The bartender was pretty helpful at helping me pick out a drink as I did not know what to order."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 4, 2013",
    "review": "Great intimate venue for up-and-coming bands.  Saw Jukebox the Ghost plus Matt Pond and two opening bands this weekend, a great show.  Change over between bands was quick and efficient.  Matt Pond complained about some problem with the monitor mix, but it sounded good in the house.Some earlier reviews talk about how hot it was, but that's not true anymore.  They must have heeded earlier complaints and installed an air conditioning system that blasts cold misty air over the stage into the audience.  If anything a little too cold, but better than roasting.The grill upstairs isn't terribly impressive; perhaps they serve food to qualify as a restaurant that can allow entrance to people under 21.  If so, good on them, because clearly some of the crowd wouldn't have qualified otherwise."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 4, 2013",
    "review": "So here goes. I'm going to make this short.I love coming here. The prices are awesome, and the people at the door are great. I only have one problem, and it's quite a big problem.When I come here for the performers, there are a great number of photographers that attend as well. I don't know whether they are the performers' photographers or the venue's, but every time I have been at the front they end up jumping and standing right in front of the other concert-goers and I. They love to move their arms around to get every possible angle taken on their cameras, blocking the view of the people who were standing in the front originally, and it's an extreme disappointment for those who have stood in line outside and stood right in front for an hour waiting to see an artist that the photographer could care less about.I have had more than one photographer talk down to my friends and I, and I've even had one elbow me in the face--with no apology--while he was taking pictures at extreme angles.It's very unfortunate for everyone who paid to be there, and one could only hope something could be done about this."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 27, 2013",
    "review": "Recently came to Rickshaw Stop for the first time to see CAMPER VAN BEETHOVEN & it was an interesting eveningThis venue is super small & reminds me a lot of Red Devil Lounge.  It's skinny & narrow w/ a teeny upstairsSound was a bit distorted on vocals but instruments were okay - the band kept saying they were getting feedback on their monitors but we couldn't hear itSightlines are practically nonexistent - it's standing room only so you are a prisoner to fate & the short-people karma godsSince the venue was small (& sold out) we were standing literally shoulder to shoulder & there was lots of bumping & getting up close & personal w/ those around you....all thought of getting drinkys were thrown out the door since we knew for sure we'd have lost our place / view & it would have been too big a fight to get anywhere near the barNote to self to pick up drinkys before the show starts & the crowd descends en masse towards the stageI liked the fact the show started nice & early even though it was a Sat night so those of us needing to take Muni home afterwards had plenty of time to catch the last trainBut in thinking about the question of would I come back?  My answer at this point is maybe.....it'd have to be a really, really good band to tempt me.  Didn't hate the place at all but wasn't completely in love w/ it - middle of the road"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 21, 2013",
    "review": "love it here. never had a problem. it's a lovely venue. super intimate. i've seen Ellie Goulding, Hundred in the Hands, Oh Land, Penguin Prison, K.Flay, Foster the People, Grimes, oOoOO, Icona Pop, many more... it's an awesome place.i've never had a problem here. all of my friends have. issues with the bar, issues with the bouncer. I only had to leave one show early once for one of my friends. but my friends have all gotten pestered and questioned for the \"Xs\" and \"where they went on their hands\" amongst other things. i'm 21 now. but even when i wasn't 21, i was still going here. and i was strolling along having a great time and my friends were all getting crap, like when they came out of the bathroom or what they were drinking. weird shit.nevertheless, i have no beef with 'em. i think the venue is super fun and has an interesting little vibe and the age range there (even on all ages nights) is super vast. kinda creates a little diversity of ages."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 8, 2013",
    "review": "Over the past 5 years I have seen some spectacular, MINDBLOWING sets at Rickshaw: Charli XCXSchool of Seven BellsShiny Toy Guns The LovemakersDJ Aaron Axelsen (he books a lot of the great shows here as well)A close, intimate view wherever you are standing as the capacity can hold no more than 200 (if that), the sound is on point, the stage low, the drinks are strong, the crowd is never really a douchey gathering, and most shows are under $20. This venue and Bottom of the Hill are where Coachella/Outside Lands type acts play when they are just starting out. HIGHLY RECOMMENDED."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 29, 2013",
    "review": "Crazy that you have to pay giant srevice charges for tickets here.  $20 show is $8.90 charge per ticket.  otherwise, not a bad joint..."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 25, 2013",
    "review": "I definitely want to round this up to 4.5 stars. The past two years I've really had a chance to experience a majority of the different venues that SF has to offer for live music. I've been to the Fillmore, Warfield, Billy Graham, Great American Music Halll, Bimbo's, the Independent, Mezzanine, and last night -- RICKSHAW!HANDS DOWN my #1 favorite venue. I am all for intimate venues. This was such a hole in the wall venue and the fact that it was smaller made the event all the more meaningful. No doubt about it, I want Rickshaw to be my go-to spot from now on for live music. I was there to see Jessie Ware and you could tell that each person who was in there was a die-hard fan. Acoustics: TOP notch. The sound of the bass player & drummer were incomparable to anything else. It was literally like I had a private session with them -- that's how good their sound was live. On top of that, you can head upstairs where there's a beautiful balcony that overlooks the stage (perfect view if you're lucky to snag a good spot first), as well as a couch for anyone who wants to chill. My friend and I were posted there during the opening act. Only reason why I'm not giving it 5 stars is because of the heat. I was prepared after reading the Yelp reviews but I was still dying while I was in there. They need some ventilation :) But hey, we were in awe of Jessie's talent so it didn't bug me too much."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 24, 2013",
    "review": "I went to shows here on back to back nights.  The first night was to see a pop/dance artist at their Thursday night popscene show.  The second night was to see more of a rock/punk/grunge act.  Both nights were really fun.  The Thursday night show was kind of like a gay dance party and the Friday night show was more like a normal rock show.  The venue is small and you can see well from anywhere.  They don't mind cameras and while most the drinks are pricier than I prefer, there were at least a couple drinks each night that were affordable.  I was able to find street parking nearby as well."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 22, 2012",
    "review": "Decent club.Watched the band from the balcony.Neighborhood is sketchy, so was not comfortable parking and leaving the car."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 6, 2012",
    "review": "Rickshaw stop would get a five star if it weren't for their seemingly strict age rules. I understand this is at times an all ages venue but this being my second (or third) time going, I was kinda put off by the bouncer and bartender. I know I'm young and I'm Asian but I swear to you my ID is real sir and \"did you need something?\" doesn't seem polite when walking up to a bar. Other than that, positive reviews for this place cuz of the venue itself.. I love their video playbacks and the second story which is a balcony with couches for more tired and comfy couples. I believe there was more space and seating further back upstairs.. Only thing is, this place gets really packed, based off of the few times I've gone here.....But that's because of the awesome artists that come thru. There inbetween sets music is awesome as well. not so crappy house/electronic music that's more my style and the crowd varies from both young to old. Sound is great too (especially with Tom Krell's voice it was absolute magic)Bottled beers are $4 and there are in and outs only for 21+The shows themselves are fairly inexpensive... Paying only $14 to see How To Dress Well (i'd even pay more just to see him &) ) Overall, nice place.. For the few times I've gone, I've always wondered why I haven't gone more. Hopefully next time I don't get awkwardly started at for looking like a 16 year old :C"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 21, 2012",
    "review": "Rickshaw Stop is one of the best spots we've played so far.Reason #1? Sound.Reason #2? Sound.Reason #3? Sound!The sound on stage was absolutely superb.Most venues only care what the sound is like for people watching the show, but leave the sound on stage as an afterthought.  Normally it's just a cacophony of all sounds overwhelming each other leaving me guessing what's going on. But not at the Rickshaw, where the sound on stage was amazingly clear.  I could actually hear the guitars, the vocals, and my bass.The stage is great as well.  It's big, with lots of room to move around.  It's not too high or too low, so we have a good view of the crowd and feel like we're right on top of them. And lighting was fantastic as well.  It actually went along with what we were playing, mood-wise and tempo as well.It's a great venue to play a gig at, which in turn makes it a great venue to watch a band as well.  We hope to be back soon!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 19, 2012",
    "review": "My first time at the Rickshaw Stop, was a disappointment. I really wanted to see Paloma Faith, love her music, so a friend & I drove two hours to SF for the show.  It was supposed to be my birthday present to him.  I saw three different promotions for the show, they all said 8PM show.  It also said it would open with DJ music, so I guessed Paloma wouldn't start at 8, but hopefully not too late as we had to drive home the two hours so my friend could go to work the next day- but we figured if the show lasted til 11, we could get back home by 1.  Well, we stood in line out in the cold windy sidewalk for an hour, they finally opened the doors at 8:25...some guy kept coming out to look at the line, but wouldn't say when the doors would open.  OK, so we get inside at 8:45, get settled in upstairs and listen to the DJ play Motown 60's, which was great.  By 9:30, my friend is getting stressed about how late the trains run to get back to our car, and after 10 more minutes, said he isn't really in the mood to wait any longer.  The place had filled up long ago and we noticed some people were giving up their seats and leaving (mostly older folks, it was a really mixed crowd.)  It wasn't so much we minded losing out on our $15 admission, but we really wanted to see Paloma perform and felt like the 8pm time was really misleading.  As we left, I asked the doorman when Paloma would actually  play, and he said 10pm.  I guess my biggest gripe was the lack of clarity of the schedule- if I had known the show didn't really start til 10, I wouldn't have bought tickets.  I liked everything else about the Rickshaw, I only wish the venue would be more transparent in their timetable.  It gave me the feeling they wanted people in two hours early to buy more drinks.  Hey Rickshaw, would it really be so hard to say \"doors open at eight, showtime at 10?\""
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 19, 2012",
    "review": "The rating is the average for being a club (2 stars) and as a place to see live music (0 stars).As a club it is nothing special, kind grungy and dirty looking. The staff is nice and friendly, so that gets them a couple points.It is a horrible place to see live music. The sound system sucks and everything is distorted. By the time the live act comes on, the majority of the patrons have been drinking for 2 hours. Great for the club scene, not so great for the music scene.Basically if you're a fan of the artist or group, give it a miss, as it is not going to be a good show."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 19, 2012",
    "review": "Great selection of shows, especially new/emerging acts, but apparently the actual show times are left to the individual performers. Door advertised as 8pm; 10pm & still no performance. I don't appreciate my time being arbitrarily wasted. Set a f*cking show time & stick to it. Don't waste my time."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 17, 2012",
    "review": "You can cry about this being hipster central but whatever -- it's a really fun place to party and that's all I care about. I've seen all types of acts here from Nosaj Thing, to the Matches, to Katy B, to Flosstradamus, and soon Lianne La Havas -- it never disappoints. Great bar service with decent prices. Sound is blasting. The vibe is always really positive. I believe they have coat-check. Always plenty of street parking within a few blocks. Put on your dancing shoes and get ready to get sticky in that motha."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 16, 2012",
    "review": "Saw Dillon Francis here twice, once in 2011 and once this past Thursday.- Easy parking (and also close to Bart, I think Civic Center?)- Drinks are large, served in pints and not too expensive. Strong.- Coat check is upstairs, $3- Security is pretty strict.Overall, a lot of fun both times i've been but the crowd gets suuuper packed and pretty rowdy."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 14, 2012",
    "review": "God awful venue.And not even the size or that anything was wrong with the venue itself its jus the fucking staff.I saw Dillon Francis and Flosstradamus here and Flosstradamus killed it, Dillon Francis was killing it too and thats the only reason I was able to have fun. But furreal, the staff confiscated my friends prescription medication cuz he thought they were drugs. The staff is rude and stubborn and are fucking bent on strolling around trying to catch people doing anything. You can't go outside to smoke or just get fresh air if your under 21. They kick you out i they see you wash your hands for more than like 10 seconds cuz they think your trying to wash the x off your hands that say you can't drink. They just loooooooooooove to kick people out.But furreal fuck this place. Wouldn't be a bad venue if it had different staff."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 13, 2012",
    "review": "I've been here a couple times, and on Friday I saw my second show here (Sharon Van Etten), which was amazing. Granted, they had their own sound engineer, but all the levels were perfect and the songs sounded so crisp--even a bit better than my other favorite little SF venue, Bottom of the Hill. The only drawback to the live show was being stuck behind a bunch of obnoxiously tall people--I wish more small venues like this had sloped flooring for us shorter people. If the opening band sucks (like this one did) see if you can snag the big comfy red couch by the merch table--and if that's full, traverse upstairs for somewhat limited \"mezzanine\" seating. Apparently there is a smoking room up there, so be aware if you're sensitive to that. They have a good drink selection and have cute specials that are themed after the performers (the \"Van Etten\" consisted of white champagne grapes and other yummy ingredients). I stuck with an Ace cider. This place is in a weird area, but it sounds like people actually don't have too much of a problem parking around here? I've had my car broken into too many times to trust it around these parts, though."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 12, 2012",
    "review": "Great place for live performances! I watched Sharon Van Etten on Friday night (Outside Lands weekend). Besides it being a major plus that they had such a phenomenal artist at their venue, it was a cool spot. There's a second floor with chairs, benches, and couches (early birds get the worm). I tend to get hesitant with public couches, but thankfully I didn't have any issues there. The main floor is also huge. It has a very convenient location, on Fell and Van Ness, with easy access for street parking."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 22, 2012",
    "review": "Tips and Tricks:The Big Ole and Big Dickel equate to three drinks anywhere else. Fantastic Deal, makes up for cover, even if it's for a great band at $15.Get there at least 20 minutes early to snag a good couch on the balcony.You can park in the dingy yellow almost-painted spots along the street at night.  (got a spot after someone in front of me starred at it for 30 seconds before going all risk-averse)Beware of anyone who's hands are conveniently covered by long sleeves and asks you to buy their drink. (seriously people, everyone knows that one Oxy pad will take off permanent marker like Mr. Clean Magic Eraser)Don't try and beat my top score on skeeball, you might throw out your shoulder. :-)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 17, 2012",
    "review": "So many great acts shimmy through this venue! Get your Indie Rock Pete on and see them here - before the covers they command multiply several times and you have to glue opera glasses onto your wayfarers to see them on the stage."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 6, 2012",
    "review": "I came here when they had a berlin table tennis / ping pong event. Summary: Casual clubbing with games and drink specials including special events with a cover.Somewhat big \"dance\" area with a crazy mix of music, hippies were everywhere!  I like how casual everything was, it really reminded me of a house party.Berlin ping pong - paddles are just laying around, a circle forms around the table, everyone pounds on the table to commence the start of the game, once everyone wanting to play has joined, the 1st player hits the ball and moves to the side, the opposite returns then moves to the side, the players walk around the table hitting the ping pong until they mess up.  Fun, easy, chill, can play while drinking, and awesome way to get to know your \"neighbor\".  Drink specials - changes all the time2nd floor: has a over view of the entire dance floor, has a rickshaw, skeet ball, and foosball (1 of the guys is missing feet), sofas, and chairs. LOVE everything about this.The atmosphere is very laid back, and if hippies are your thing, you'll love this place.  Not sure if its every day, but for this event, there was a $5 cover."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 17, 2012",
    "review": "I came here for Nerd Nite, which was totally five stars.The venue, on the other had... not so much.  By the time it was declared \"sold out\" most of the bar had turned into standing room only.  Also, the beer was $6/pint.  Too crowded and too pricey for my taste.The crowd and the staff were all nice people, at least."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 6, 2012",
    "review": "It was my first time there to check out Copperwire feat Meklit Hadero, they rocked the joint. Solid selection of beer..."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 3, 2012",
    "review": "This place is a little grimy, but they host the most fierce, competitive, and traditional sport in America. It mixes the athleticism of running, the hand-eye coordination of drinking, and the fun of inebriation. I went there for the Berlin style ping pong. It was a blast. It's coming up again and they're bringing another table along with foosball and skeeball. The drinks were pretty cheap. I feel like I can never gauge how much a drink is going to cost me in this city based on the decor of the place. But the prices match the setting which is nice because I'm poor and I usually have to slip in with a flask. Not so much here.The crowd is very mixed and get ready for hipster watching, and the occasional older ladies joining in on the fun."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 2, 2012",
    "review": "Apparently, musicians love playing here, and I can understand why: *The sound is really superb with strategically soft surfaces to smooth out the acoustics. The ceiling is so thoroughly draped, you'll want to sleep on it. *The space feels intimate but not claustrophobically so, with a large open downstairs and a secluded upstairs lounge that offers an ideal view of the stage and comfy seating. It's SO worth getting there early to snag one of these primo spots. *Full bar, with cute little cans of Sofia sparkling wine to sip from a straw! I like my beer straight out the bottle, and my champagne straight out the can.*Good flow between the three key areas: bar, bathroom, stage. It feels clean, not pristine; and hip, with just a hint of hipster. Overall, a great place to be entertained by some stellar local acts (Sea of Bees...I heart you so much...will you autograph my bra strap, pleeeeeease?!?)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 30, 2012",
    "review": "I'm updating my initial review (below) bc I've been back a few times and it's kind of hit or miss with the crowd. It is an 18 and up venue, which is a minus in my mind, but of course that's good if you're 18-20.... I like how the space has two levels, the drinks are strong, and they get good shows. Not the best venue I've been to, but it's usually a good time. Just be prepared to get (or throw) some elbows if you're concerned about your space.Initial thoughts: what a frickin mess. unless you are 18-20, i suggest staying away. idiots were pushing through all over the place, as if mommy & daddy had just let them out of the house. this place screams all-ages club filled with kids who don't know how to hold their liquor. not at all my scene, but at least i had fun dancing."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 11, 2012",
    "review": "After paying $10 to get in the door, the tiny $3 coat check was full! Go to Ikea and get a friggen rack.  I wanted to shake it and get down on the dance floor but was forced to carry lbs of jacket.  No, I will not leave my nice things unattended or hide them under your sofa and over 5 years of accumulated vomit stains.  For what it is, an open gymnasium with pretty great dance music, it had a large crowd and some good quality folks.  I just wish I could have enjoyed my experience without having to sweat so much."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 28, 2012",
    "review": "I've been here twice:Once for Cockblock with a dear bunch of friends who put the 'L' in LGBTQAS.Once for Leslie & the LY's.Both were occasions for a lifetime."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 22, 2012",
    "review": "This place is awesome but the booking agent here doesn't know how to do business. Emailed Dan a few times and he's not good at replying at all."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 6, 2012",
    "review": "After suffering through a douchebag NYE at Ana Mandara last year, I took the bull by the horns and suggested we go to Rickshaw for this year's outing.  Thank god!First of all, it was only $35 (at the time we bought tickets about 2 weeks in advance) and included a live show by the Limosines and and awesome dance party courtesy of some Popscene DJs from Portland who were amazing!  I like that they didn't ovesell the event.  There was actually room to dance and move around.This is a hipster paradise and I love it.  Saw some incredible creative and beautiful outfits that night!  People may hate on hipsters but let's be honest, they can drink and aren't afraid to wear face paint.  I'll take that over striped shirts, cuff links and black pleather dress shoes any day!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 8, 2011",
    "review": "I have countless memories at this venue and will always have a place in my heart."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 21, 2011",
    "review": "I would give this place negative stars If I can. The woman bar tender is a bitch. Seriously. She crapped on my whole experience.  Ugh!My friend ordered jack and coke and I ordered coke. She had poured only jack in the first glass and I said oh sorry, I want my coke without ice. She goes everybody orders with ice generally. I am like i know. Sorry. But she did not pour my coke without ice! She was not finished making the first drink yet when i corrected my order! And ofcourse has not charged anything. I was so shocked with her rudeness that I just accepted it. Now I am pissed. oh and coke was $4! The reason I am so pissed is that she went out of her way to be rude.  It's one thing if she already had poured the coke in the glass with ice and had to waste that coke to give me correct order.  I would totally understand. Even though most of the people would make a new drink to make customer happy. So in the end I paid $20 cover and four times the actual price of coke just to be greeted in such a \"nice\" way. Feels really good.About the music and actual club, it's ok i guess.  Nothing special, If anything the space is really small. Certainly the rude welcoming experience did not help their cause."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 18, 2011",
    "review": "UMMMMM....  :XOk, honesty is the best policy right? Rickshaw Stop is just NOT my scene. I didn't even know this place existed much less was located 1.5 blocks from the office. In theory, it would be the perfect spot to Party Like A Rockstar then crawl underneath my desk, wake up the next morning, and hope no one remembers what I wore the previous day. Ok, maybe not because I'm a lady after all.Rickshaw Stop is a club that has live band performances specifically Indie music. They also have Bhangra nights which is some sort of Indian folk dancing.  When we ended up here last night (not by choice) for a Popscene party, I pretty much sobered up after seeing shirtless men doing interpretive dances. A guy next to us then started throwing up all over himself while no one even seemed to care. That pretty much sealed the deal for me.  Now that I got that out of the way, I'll keep this to a venue only review. COVER$15-$20 (Depending on the performers, tickets can be bought online fro $5-$15)DRESS CODENoneCROWDVery mixed but mainly hippies and hipsters.MUSICIndie. I don't even know what this is so not even going to elaborate on this. BAR2 barsDRINKS$9-$10 for top shelf liquor. $20 minimum for CC'sAMBIANCE/DÉCORSmall, grey, and sweaty. Huge ceiling-to-floor red curtains added a splash of color along with the tv projection scene playing psychedelic images. The main level has the dance floor and stage. The upper balcony level has a couches, food bar, and a smoking lounge. There were also two rickshaw carts which I really wanted to crawl into to sleep but it probably would have broken into pieces. PARKINGPlenty of street parking. Beware of street cleaning though so make sure to check the signs. That is all...P.S. - This is a generous 3 STAR review because security aren't douchebags which most SF clubs employ."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 14, 2011",
    "review": "Unlike some venues in SF (ahem Slims), Rickshaw has a lot of personality. Located nearby to the deco ghetto, this place is definitely a destination of its own. It's a good medium sized venue, has great lighting and atmosphere with the curtains along the walls, and I like that it has an upstairs. This is key, because sometimes you just want to hang back and watch a band from slightly afar. Only downside is that the draft is almost always warm."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 5, 2011",
    "review": "Ahh I love this place .... !I just recently have been turned on to this place by a friend .. We usually show up to Pop Scene on Thursday for some good dancing fun ... Always a blast ...The space is great ... walk in bar to the right that leads to a big dance floor with a stage up at front ... There is a balcony over head that I believe has a bar and more seating as well ... And of course there are random rickshaws scattered about ... The music scene is full of variety .. I been to Dj shows, Rave type shows, Indie Shows, and etc ... It's refreshing and Just feels great to dance thursday night away .. Good stress relief .My advice is show up and just dance the night away .. and hey if you go Thursday maybe i'll see yah :)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 22, 2011",
    "review": "I liked the environment and the people ! Very diverse crowed !!! However bartenders weren't too friendly :/"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 18, 2011",
    "review": "Only been here for Popscene parties. Good music and cheap price for concerts!Alcohol is watered down BOTH TIMES I was here. I only buy bottle beer now. Kegs are not that fresh either, well the Sierra wasn't..."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 28, 2011",
    "review": "I'm really surprised by the overall rating this place has. I've only been here once but I truly feel that the rating for this place is way overblown. I went here back in July for a concert during the week. Everything as far as the staff, bartenders, and overall atmosphere were really nice. I especially liked the upstairs chill area - a nice place to go to get away from the bottleneck that is the entry way. Now for the bad. First off, this place was RIDICULOUSLY HOT INSIDE. It was retarded... no AC, and although they have tons of fans on the ceilings, they wouldn't turn any of them on. I've been to countless overpacked venues and this place was stupidly hot beyond all others. Secondly, the sound system SUCKS hard. sucks so hard that it's just laughable. What's with the arrogant DJ not turning down the sound for a second so the band can do a decent sound check? The band had to ask multiple times and the dude would NOT turn it down. They had to just start the show without going through a full sound check... which probably let to the multiple problems with the sound throughout the show. The tremble would knock out the speaker ever so often and the speakers would constantly crackle from the vocalist. It was sad.thankfully the tickets were super cheap, but that doesn't take away from the fact that this place blows."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 28, 2011",
    "review": "Small and sweaty just the way I like it.  Well not too small, but a really cool spot.  Bhangra night was so joyous."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 22, 2011",
    "review": "I've been the Rickshaw stop a bunch of times now so I think it deserves a review.  This is a great venue.  The staff is friendly and relaxed, the ambience is great, and the shows are darn cheap!If you are looking for a cheap show and you don't care who the band is, then do I have the place for you.  Generally the most expensive show they have will cost around 12 dollars, no service charge at the door.  The stage is a bit small, but the venue is a bit small.  You can get as close as you want because the floor is pretty big.  I saw Miniature tigers and Neon Indian here and that was the most packed its ever been.  So no worries about sweaty drunks shoving their elbows into you.  There are about three rickshaws around the place that you can sit on, along with more comfortable furnishings.  There are plenty of couches and chairs upstairs for people to sit on, but they get snatched up quick.  I do wish they had some more seating up stairs for this reason.  It is nice to watch the show from a comfy green couch or stare out over the crowd. They have Bhangra Dancing once or twice a month, but I have not been yet.  The shows they have here are generally pretty small, indie bands, so don't expect a huge crowd to show up.  The drinks are pretty varied and well priced.  (Jack and Coke $6)Parking is on the street, but i've never had a problem with it.  This is a great venue.  I've loved it from the big shows to the small.  They bring in great bands and you don't have to spend your whole wallet.  So pull up a couch, buy a drink, and enjoy a show at the Rickshaw."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 18, 2011",
    "review": "I come here for the Bhangra nights they throw on a Saturday. While I do like a good dose of bhangra, I'm hoping future DJs throw in some hip-hop as well - just like Punjabi weddings."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 12, 2011",
    "review": "We came here after Nightlife to see Skylar Grey.  She was AMAZING.  I'd give her 5 stars!  Rickshaw Stop, on the other hand, is just alright.  I think they water down their drinks, but it was a nice space for seeing Skylar Grey perform.  I'd come back if someone else interesting were performing.Didn't stay for the dance party though, since it was a work night . . .  Not sure how fun it would be since TONS of people left with us after Skylar finished performing."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 26, 2011",
    "review": "So, I had a blast at Rickshaw Stop.I went on a Friday night and it happened to be Bardot night. Swingin 1960s French music with Brigitte Bardot playing in the background and balloons floating around. Fabulous! Rickshaw has a huge dance floor and upstairs seating area with a balcony. Service at the bar is good, drinks are reasonably priced and everyone seems down to party. But it gets hot and you will get sweaty. Like, your clothing will stick to your body, your hair will frizz and you will walk outside looking like a complete disaster.But it's fun if you are in the mood to get down with you bad self."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 24, 2011",
    "review": "Rickshaw Stop has so many elements going for it to make it a fun night spot but somehow the overall experience comes up just short. It's a nicely-sized club that feels intimate with easy access to the bar where responsive bartenders pour you reasonably priced drinks. The dance floor is reasonably roomy and the lights are pretty awesome. Here's the thing that is a little odd for me though - folks on the dance floor seemed more intent on \"posing\" versus just dancing and having a good time. Very strange. Still I liked the music and had a good time with my friends. Not my favorite spot to spend the night but I won't be opposed to going back to Rickshaw Stop with the right folks."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 14, 2011",
    "review": "I only come here for Popscene. Music is Good.If you get hungry, you can purchase food here to munch on."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 14, 2011",
    "review": "This is one of my favorite venues in SF! I have seen so many great shows there. I like it because it is small and the stage is low to the ground, so the band is closer to the crowd. It's also fun to head up to the balcony and see the show from there. Tickets are always affordable and they book great bands. Sometimes if they sell out they'll release a limited number of tickets at the door. It's always a great crowd - I love this place!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 12, 2011",
    "review": "I love this venue!  They have a great variety of music and entertainment - everything from the science spectacle of Nerd Nite to the homolicious dance party Cockblock.The staff are laid back and fun while still being on it.  I especially like that they make a drink special for the band that's playing that night.If you go upstairs, you'll find a skeeball machine that even has instructions on how to up your game.  Pow."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 10, 2011",
    "review": "This is one of those hole in the wall venues, where if the door isn't open you wouldn't even know it's there. The is no sign, its almost like a speakeasy, i half expected to be asked for \"the password\" it's just that cool lol. The place it self isn't anything special. But theres a small bar, they have good music, and a good sound system. Not much more you can expect these days from music venues."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 8, 2011",
    "review": "Pretty cool venue, they've got a pretty chill upstairs area with a bar, my only complaint would be that when I was underage I would get upset that a number of their shows were either 18+ or 21+. But overall a cool venue"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 2, 2011",
    "review": "An intimate-type venue where you get a chance to mingle with the performers. I love how it's a block and a half away from the Van Ness Muni station, extremely convenient. The couch in the back is super comfy by the way.I came here last night with my sister and her boyfriend to see Sleigh Bells, Neon Indian, and Rosco Delrey. They were all amazing!I love how the stage is almost at ground level, but, it sucks being in the front when everyone behind you is going nuts. Prepare to get cuts and/or bruises on your thighs."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 30, 2011",
    "review": "Not a smoker, but yes they've got an INDOOR smoking room on the second floor.  Most recently went for the Limousines show (but they have also had a distracting amount of good acts and parties to frequent) and loved that (got the set list!) but also the special cocktail of the night, which they switch up all the time."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 28, 2011",
    "review": "this place is so much fun! the sound is good here and on Thursday nights for \"popscene\" they have amazing DJs and bands. drinks are priced well and the bathroom is pretty good. there is seating on the upper level.this is my favorite spot in sf i would definitely check this place out!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 9, 2011",
    "review": "Where the F is the box office, oh, the isnt one. What!?!?! you dont take credit cards?!?!? well, thank god i brought a 20!came here alone (pathethic i know) to see Lenka and Greg Laswell.Sat upstairs in the corner. Could see and hear everything fabulously. The lights hung on the ceiling are cute.I feel like they probably have highschool dances here or something, its got that vibe.Smelled a little like cigg smoke, but i didnt see anyone smoking,,,, did the smell come in from outside? no idea."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 1, 2011",
    "review": "Friendly staff, but illegal smoking upstairs stinks.  There is a \"game room\" where patrons smoke inside.  There is no ventilation so upstairs reeks of tobacco."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 27, 2011",
    "review": "I came here for the first time to see Memoryhouse, with no expectations. It had been a hectic few weeks, and I felt like when I went in to The Rickshaw Stop, all of a sudden everything mellowed out. The atmosphere was both calm and friendly. The red curtains gave the place such a nice feeling. Everyone seemed in good cheer and sharing that energy with everyone else, which was something I hadn't felt much since moving to California. The upstairs was pretty cool too, with the bike and the couches. The bar served reasonably priced and creative drinks (the special is always themed with the evening's features.) One of the staff asked me for my I.D. because I fit the description of someone who had apparently stolen someone else's purse, and then, unlike in most situations, when I tried to inquire and help, instead of being a jerk, he was cooperative and instead of what could have been a terrible experience, it was a pleasant exchange, and i made sure to let him know that and thank him for handling the situation so well.I came back for a bunch more shows, all of which were also satisfactory and beeming with good vibes.Lastly, I was so elated to find that Nerd Nite not only exists outside of Boston, but is so well attended in San Francisco!I loved living right across the street from the Rickshaw Stop for the brief time that i got to do so. I miss being able to cross the street to see a great show, enjoy myself without worrying, and then cross the street again and go to bed at a decent hour."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 10, 2011",
    "review": "It might have been because Rickshaw was spacious and I had the ability to walk around without bumping into anyone or the fact that all 5'1\" of me got to stand on a table so I could get an unobstructed view of the headliner (something I'm not used to at all), but I'm a fan of this place!  It's got a backyard patio feel to it with the lights hung on the ceiling and an upstairs balcony with adequate seating if you don't want to deal with the mosh pit that downstairs will eventually become.My only gripe about it was that it got very stuffy and hazey.  But I guess that's to be expected when everyone's jumping up and down, dancing.  Overall, a good time!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 10, 2011",
    "review": "I went here for strfckr and it wasn't so bad. When you first walk inside, it kind of reminds me of what an 8th grade dance would look like. Cheesy red curtains on the sides with lights hung across the ceiling and wooden floors. Upstairs there's sofas and couches for ppl to sit on and chill and a small smoking area. They seriously do have bad ventilation, it was so freaking smokey/foggy in there. But honestly, just because a venue is so-so isn't really going to stop anyone from coming to see their favorite band. Its no staples center but it still kind of has this cozy feel to it. From the outside, you can't even really tell it's a music venue or that its a really long building but it is!Some annoying things were a bunch of hs hipsters with their huge ass fake glasses and beanies with plaid or ripped shirts always seem to be smoking while waiting in line- i guess to pass the time. Its kind of a weird mix in there because there's barely legal high schoolers to ppl who look like they're fifty. eclectic group of ppl i guess.but I would come here again because it is really fun!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 9, 2011",
    "review": "The Rickshaw Stop is my third favorite venue in San Francisco after BOTH and GAMH. Even the lame acts seem better, more personal, and more connected in this spot. The upstairs is chill, the drinks are reasonably priced, and the crowd is always awesome."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 1, 2011",
    "review": "It seems to me that reviewing a venue is more like reviewing the time you had or the show you saw unless there was some horrible experience with the staff.  So.  Because I had a really good time seeing No Age here the other night, I'm giving it 4 stars.  There was a mosh pit, where a crowd surfer came about two inches from landing on my head, a young man who more or less head-butted me, and a head banging chick who kept violently running into me as she could not see through her mass of Cousin It-like hair.  The stage was only raised by about two feet, as evidenced from the two baseball sized bruises on my knees from being pushed into the stage by never ceasing, pounding waves of human bodies.  Needless to say, despite the near concussion and other injuries, it was a great time.Also helpful: I found the bartender to have supernatural hearing, an admirable quality when attempting to shout my drink order mid-song.  I couldn't even hear myself, but somehow, amazingly, he was able to ascertain the drink order and get the requested alcohol into my hand.  Amen."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 22, 2011",
    "review": "Ahhhh high schoolers making out all around me. I did not expect that, and it was incredibly annoying. It also made me feel old and lame - when did I become such an uptight adult?However, fleeing that scene led me to find the skeeball upstairs, which was pretty rad.  And even on the balcony you have a decent view of the performance and the noise level is perfect if you want to listen to the music while also being able to hold a conversation.So if you can deal with underage kids and like a laid back environment, this place may be for you.  Just don't forget your skinny jeans, ironic t-shirt and plaid. Not sure if they'll let you through the doors without those. ;)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 10, 2011",
    "review": "I went here with a couple of friends to watch happy body slow brain's gig. The place was packed. I love the awesome crowd, mellowed down by booze and sangria.The band also featured 3 other artists: Please Do Not FightBird By BirdThe Girlfriend SeasonThe place is a small loft, with a dim-lit stage, a few tables and chairs, pretty much it was a \"standing room\" which was spacey enough for the swaying crowd. The bartenders were nice and their drink mixes were incredible. I like how accessible it is for commuters like me and it was easy to find. It was worth the walk from the MUNI/BART station, that night. The slow brain punch made my night! smooth!I'll definitely come back for more indie group bands! oh lala! :)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 21, 2011",
    "review": "I went here for an event \"Nerd Nite\", and it was pretty cool.  I really liked the idea of people hanging out and listening to science put in a fun and creative way, like Zombie brains, where a necro-neurologist discussed real brain atrophies that could contribute to the Zombie brain, if existed.  I am a scientist myself, so I might be sort of biased. The atmosphere of this bike messenger hang-out is pretty cool, with a balcony looking onto the stage, and a Skeeball machine in the back. The bartenders were really nice and receptive.   I plan to come back and see a live show sometime.  Parking was really easy, or I got lucky. Cash only, but they have an ATM."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 26, 2010",
    "review": "This place is great! I love that there is ins and outs and easy parking. It's also close to BART. There's diverse events here too. The upstairs is chill. I LOVE the free Foosball table! I have played many games with friends and new found friends. There is also plenty of seating upstairs including ones where you can still see the stage. I don't like the smoking room upstairs, considering there's ins and outs anyhow, but I think it's convenient for smokers. However, there is now a SKEEBALL machine inside!! If you break 200 pts, you win a free drink! I also like the 2 rickshaws they have as decor! They make for fun, drunk photo opps. The sound system is decent and the red curtains on stage and around the venue are nice. The drinks are average priced and the staff are nice. The venue is large enough to have an epic dance party, yet still feels intimate. It's a great place to catch or show or dance your pants off."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 10, 2010",
    "review": "Came here not too long ago for a private event. It was pretty okay! Nice big venue.One downer: I checked on the website to see if there was a coat check before going. I happily saw that there was indeed a coat check! Then, when we get there, I come to find there is no coat check. If I had known there was no coat check, I would have brought a different (smaller) bag and coat. It was a total bummer trying to keep track of my coat all night.I liked the rickshaws all around! They were fun to sit upon. I'm surprised people don't break them."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 8, 2010",
    "review": "Small venue. Upstairs had like a smoking room (yucky suffocating) Came here back in January/Febuary of 2008 with a former roomie & her new friend."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 4, 2010",
    "review": "Went last night for the first time to see Moneypenny rock the Rickshaw Stop's fucking face off, and from the moment I came to the door, the guy taking ID's (who I believe was also part of security, but he was totally skinny and non-threatening, so I only imagine he possessed insane kung fu skills) was cool as hell.  I was amazed at the amount of close parking for a Friday night as well.  Lot's of really cute chicks, many single, some a little too wasted, friendly bartenders (when it was time to sober up and stop drinking, they gave me free Cokes), and just a really laid back, chill crowd. Only negative was the jackass who was so drunk he could hardly piss in the urinal.  I actually stood behind and to the side, as I was not in the mood to be saturated in urine.  It was like when you take a diaper off a baby and they piss all over the place.   Aside from that, I will definitely be coming back.  Popscene moving there in January only makes this place better."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 20, 2010",
    "review": "Pretty decent venue. Space is intimate, sound carries well. Coat check upstairs. Smoking room has foosball and skee ball. I didn't go in, but I eyed the smokers with envy as I'm a sucker for skeeball. Well, maybe it wasn't even skeeball.. I don't know. Looked like it from the outside looking in.If you like to sit, like I do, then head upstairs. No seating on the main floor.Upstairs has two levels. Both with various seats. My man and I snagged a love seat couch and yea, we made out. It was fun watching couples cram into rickshaw seats. If you want to ensure that you can actually SEE the band/stage then make sure you are on the lower of the two upper levels and bellied up to the rail. Because as we found last night (Freelance Whales and Miniature Tigers, vg btw) when the main acts come on stage people will come stand between you and the rail thereby blocking your view if you are seated. Upstairs bar has no tap and only bottled beers/Bathrooms were nasty! But that's normal in these venues.Crowd was very young. Lots of high school kids with back packs. Upon entry I joked with the bouncer that we (me and my main squeeze) would probably be the grandpa and grandma in the club. He took one look at my ID and said \"I think you already win that award by a long shot\". I would like to note that I saw at least 3 men in their 60's here. So we did not win that prize. There were also dads chaperoning their underage kids. That was funny, watching the kids ignore their dad as dad tried to engage said children in conversations.As far as local venues to see up and coming acts in a small setting. This one was pretty good. I'd go back, grandma status aside."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 14, 2010",
    "review": "Came here the other night to watch Toro y moi and Nosaj Thing. As a music venue, it's pretty big compared to some other ones I've been too in the city, but maybe it was because I was upstairs in the balcony area the whole time.  -1 star - for the smoking area. There is no ventilation whatsoever in the little 10x10 room. -1 star - for all the youngsters. Overall, it was a good show. If there was another good performer coming, I wouldn't mind coming again."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 6, 2010",
    "review": "2.5 stars, really.I proceeded with caution after reading other reviews. I didn't want to get vomit on my shoes or some unidentifiable stain on my clothes... so I mainly stayed toward the back lol. Regardless, I think my experience was a bit different, because I went for a CD release rather than to dance.This place definitely is a hipster haven. It's bigger than a lot of the other venues I've been to, and it's really hard to see the stage from the back. There were a bunch of drunk people dancing around the back and congregating around the bar, and this older man grabbed my ass. Awkward. Honestly, I think next time I'm going to a show, I think I'll stick with places like Bottom of the Hill or Slim's."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 4, 2010",
    "review": "I saw Aloe Blacc here last night, and I thought it was a great venue.  (Great show, too!)  The size of the place is good, and the bar was run efficiently, which is always a plus.  I'm a fan of the self-serve water on the end of the bar.  Easy access to water is a good thing."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 1, 2010",
    "review": "I'm reviewing Rickshaw Stop as a music venue, not a dance club or bar.  I have no idea what it's like as a club, but from some of the pictures posted, it looks like a lot of drunkies dancing with brightly colored beverages.As a music venue, I've enjoyed Rickshaw overall.  The place certainly has personality including random rickshaws placed around the space.  The bar is conveniently located on the side and is cheap.  The venue itself is a good size with a smaller balcony in the back for people trying to avoid the standing room crowd.My only complaint about the venue is the crowd sometimes errs toward the young'uns side, which can make me feel like an old creepy dude scouting.  Once I went to a show where the opening band was clearly from the local high school as the front of the room became heavily populated with kids with backpacks.  They began moshing to music that probably shouldn't be moshed to.Another time, I went to watch a Wavves show and a young man jumped on stage and started dancing like a chimpanzee on crack.  He tried to fend off a bouncer who was about 3x his size and ended up getting choke slammed off the stage.  Definitely worth the price of admission."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 1, 2010",
    "review": "Meh. Definitely for the hipsters. Pretentiousness is on full blast so beware. Most of the get ups are straight out of Us' \"What Were They Thinking\" page. Plus, I've been disappointed too many times by the music. I was expecting mash ups and other fun, dancey tunes, but the DJ never delivered. Won't be back."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 4, 2010",
    "review": "this was my friends and i spot freshman year of college. i remember having a blast here! have not been in a while but i remember good times. dancing on stage, smoke room, indian dancers, trying to get drinks under 21 haha"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 4, 2010",
    "review": "Second time I've caught a show at the Rickshaw and overall, I love this place. Has some definite drawbacks but not enough to ever prevent me from going to a show. Bar service is fast considering the setup is not ideal as it's in between the main floor and the bathrooms. Congestion happens but they seem to turn over customers rather quick. Smoking room upstairs can get pretty stinky and humid but they allow you to go in and out if you're over 21 for air. Major drawback is the lack of ventilation. Both shows I've seen turned into a yoga hotbox fart factory from hell. Main door in front is the only source of air, time to upgrade your systems yo."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 29, 2010",
    "review": "Blow-up! I actually had fun going to that club. Drink and DANCE! I kinda miss going to this club since I move-on to a different club when I turned 21."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 23, 2010",
    "review": "I come here for Nerd-Nite, which is always packed with nowhere near enough seatings for anybody. The drinks are a bit pricy. The place is a convention oven though, it gets so blazingly hot in here that it's too much. The Nerd Nite's are completely different variety and quality. The World Beard Champion was great but the talk about sex education wasn't that fascinating or funny, though educational."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 20, 2010",
    "review": "I miss Blow Up SF! Haven't been back since they stopped having it."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 5, 2010",
    "review": "Fun eclectic bands at affordabel prices! Good Accoustics, Great Bar staff always a good time!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 3, 2010",
    "review": "This place is great, both for concerts and DANCE PARTIESSSSS.Oops too excited.  But really...I came here with some friends for cockblock, and left with sore legs and a boosted ego.  Here's how it went down:We got to the club, went through easily.  The girl at the door was really nice (she later on came to us when we were taking a break outside and offered us gummies!).Inside, the music was pretty good.  I danced crazily because I figured, well, no one's gonna look at me anyway - it's a lesbian night after all.  But, lo and behold, a girl across the stage points to me and gestures for me to go over...First thought: \"It's a lesbian night!  What could she want from me?\"Second thought: \"Does she think I'm a lesbian!?\"Third thought: \"I REFUSE TO BE JUSTIN BIEBER.\"Anyway I go over and turns out it's her girl friend who's interested (read: drunk).  I politely interact with her (read: avoid being vomited on) to try and see if maybe she thought I was a lesbian, but alas, she did not.  Oh well, mission look-like-a-lesbian unaccomplished, but mission dance-your-ass-off?  Check."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 31, 2010",
    "review": "First and last experience at this venue tonight is sadly something that I won't soon forget.  Not only was I dismayed to find the cover at the door for the night was 50% higher than was advertised on their website, but the night got worse from there.I was invited by some friends to come out and see/hear this apparently great DJ, but when I got there the club was nearly empty, but my friends were there, and I guess that's what really matters.  I had one drink and then switched to consuming little plastic cups of tap-water.  I hadn't been at the club much more than a half an hour when I decided to go outside to check the BART schedule on my smartphone (due to crappy reception in the club).  I carried an almost empty little plastic cup of tap-water with me to the door.  The bouncer, or at least this very non-official-looking skinny guy by the door informed me that I couldn't take my drink outside.  \"It's okay, it's just water\", I said.  \"You can't take alcohol outside.  There's an open container law\", he replied.  \"No, it's just water\", I said again, thinking he hadn't heard me, and I attempted to walk past him.  Suddenly, he swiped the cup from my hand so violently that it tore in half and he started shoving me.  Of course, at this point I began to protest, yelling \"What the h*ll\", and insisting that I was only carrying water.  The 'bouncer' escalated his violence in turn, yelling and shoving.  He was quickly joined by a short young woman (who I believe was the one who had collected my exorbitant cover charge) in the yelling.  The 'bouncer' demanded that I leave and threatened to call the police.  I freely admit to yelling and hurling a few expletives at these two, but at no time did I do anything improper or touch either of them.  I demanded that they \"get out of my face\", but the shoving and cursing from them just continued.  Suddenly, they were joined by a third small young man in the yelling match.  I demanded several times to know who all these people were.  Only the small man answered me, claiming to be the club owner.  I was shocked by this, as he was clearly much younger than I.  He appeared to be not far from college age.  The yelling and shoving continued, yet at no time did I raise a hand to any of these three, despite my outrage.  I haven't been in a fist-fight since middle school, and I certainly wasn't about to stoop to that level again.  Finally, I turned and walked away.  I suppose the entire altercation couldn't have lasted more than one or two minutes.In conclusion, you should not give these aggressive a**holes any of your hard earned money.  The owners and employees of this club are the dregs of humanity and should be avoided at all cost.  Please find somewhere else to hear music and buy a drink with your friends."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 30, 2010",
    "review": "i hav been wanting to see something here. finally i went through and saw the Mynabirds.this was an early concert, we were out at 830pm. but the place was real stuffy upstairs, and i can see the walls sweating when it's at capacity (which can be good or bad depending on who you are seeing)."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 24, 2010",
    "review": "Because there is no signage suggesting the Rickshaw Stop's existence, I felt especially cool when I found it on a lonely block beneath a black awning. Grand Archives was playing; my boyfriend explained to me that when former band Carissa's Wierd (sic) broke up, some of those members formed Grand Archives, while others formed Band of Horses. So that new knowledge helped me appreciate the night's cleverly named drink special: Clarissa's Wired, containing gin, Grand Marnier, grenadine and lemon. I sipped it while exploring the upstairs seating area, envying the people who scored a spot on a bench with a snake face carved into one end.We took ownership over a wooden structure to the left of the high-up stage on the main level. When I leaned back far enough into the lush, red curtain, I was relieved to discover a wall. Usually when I have a few drinks, I don't act stupid or anything--I just become uncontrollably tired. Thus, after one Clarissa's Wired and two sangrias, I passed out on the wooden structure. My head rolled  around throughout the show because I wanted to stay awake so badly, attempting to nod my head and stomp my feet. But alas, my Clarissa's cocktail left me anything but wired."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 30, 2010",
    "review": "Let me say that I have been to many music venues the size of the Rickshaw, and the Rickshaw is definitely one of my favorites, mostly because of the vibe. It's laid back and not too full of itself, or full of unnecessary security, or inflated ticket prices.They have a bar in the back of the main floor, which I prefer to the side bar layout of the Fillmore, mostly because the traffic to/from will walk next to you going forward/back instead of constantly in front of you going side to side. The drinks aren't great, but they aren't high-priced either.Upstairs is a small balcony and a bunch of hipster-style victorian furniture. When we've gone it hasn't been so crowded downstairs that you really wished for a place to escape, but the couches do still provide a great respite from standing and getting bumped. All in all, you can go here and enjoy a show without the annoying crowd factors you get at some other places."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 27, 2010",
    "review": "The warm packed nights at Rickshaw stop have scared me off checking out Rickshaw Stop for intimate concerts for awhile now. I'm glad I finally decided to give Rickshaw Stop another chance - cause if you do it right - it's definitely what's up.All you gotta do - is show up early. Make a mad dash to the top floor. Find a big padded soft couch right by the balcony railing. Plop down. Kick back.  Take off shoes. And don't move for the entire night. Unless you have someone to save your spot for you.Where else in the city can you relax and lie down on a soft lovely couch, with a killer view of the stage, while listening to seriously on point music?huh?Trust."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 21, 2010",
    "review": "2 1/2 stars.  Decent enough, but by no means exceptional.  The stage is hard to see if you're standing anywhere near the back; other venues in SF seem to be set up better--e.g., the stage is higher, or the floor is slightly angled.  The upstairs seating/standing area was nicer, but tiny.  And the bartenders were kind of rude and served tiny, weak, very expensive drinks.  The whole place was hot and stuffy, as other reviewers have mentioned.  I'd only come back if I was pretty excited about whoever was playing (in this case, Junip and Jose Gonzales--good show)."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 16, 2010",
    "review": "Great venue for show. I have had some great times here. I would love it there was a Rickshaw down here in these parts of So Cal but then I guess going to the Rickshaw when in the City would lose its charm. Love the bi-level atmosphere, when venues do this it always earns points with me, that way I don't feel cramped up and can get away to a different spot.  I am not familiar at all with the dance nights that most people review about just only about seeing live bands. So I say if a friend hits you up to check out their band then I say go, you will probably have a decent time."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 7, 2010",
    "review": "Great small venue whether you're playing or seeing a show there. Awesome sound, good bar, friendly staff. They treat bands very well. It's always a pleasure to play there. Hi Waldo!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 7, 2010",
    "review": "Welcome to desi sauna on bhangra nights..they really need better air conditioning"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 6, 2010",
    "review": "Always way too hot and humid in here.  I will be trying to avoid having to see concerts here."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 4, 2010",
    "review": "Uppers:* Cheap (not unusual for San Francisco music venues).* Easy to get to - close to Muni (bus and rail), not far from Civic Center BART, and next to Van Ness, Franklin (and Gough) if you're driving.* Good sound.* Good drinks and prompt service if you're boozing. Pour your own water if you're not.* Unobstructed view of stage from almost all of the venue.* [Edit: coat check upstairs]Downers:* A little warm/stuffy.* No coat check (least not that I could find over Memorial weekend...maybe they'd take your gear behind the bar?) [Edit: coat check is upstairs. Ooops!]"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 3, 2010",
    "review": "I've come to the Rickshaw Stop for a couple shows (Mayer Hawthorne and Phantogram) and I enjoy this venue. It's a smaller venue which I prefer and the sound in this place is pretty dope. They also have an upstairs area with couches and even a foosball table. They also have a smoking room upstairs for the smokers. The Phantogram show wasn't packed at all so it was very comfortable however the Mayer Hawthorne show was sold out and it got seriously hot in there but it is a small music venue and this is what happens when you pack in a shit load of people into a small venue. It gets hot. Rickshaw Stop is cool but the Indy is still my favorite small venue."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 3, 2010",
    "review": "\"It's getting hot in here, so take of all your clothes. I am getting so hot, I wanna take my clothes off!\"Rapped by Julia \"Loin Dweller\" G, Lyrics by NellyOkay, I didn't actually take my clothes off but dude, it IS hot in here. Literally, I was sweating buckets last night while watching Local Natives (btw, they were awesome) in what felt like a really large steam room. The steam being other people's sweat evaporating off backs and foreheads alike. Luckily for Rickshaw it's a really cool venue with good energy and a nice intimate vibe. It does makes it worth it, especially if you see a good band."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 25, 2010",
    "review": "Great venue for live music.  Rickshaw Stop has many different live bands and events covering many genres and lifestyles.  What makes it so great is it is a perfect blank canvas for putting on these different events.  I love seeing indie rock bands and it is about as big a venue as I want to see a band perform in.  Still very intimate but can hold a few hundred people.  As a bonus you can always get a drink pretty easy.  Fun and friendly staff.  No stuck up bartenders.  With all this in mind there are events I would never attend there.  The underage events are sweat fests full of drunken amateurs."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 19, 2010",
    "review": "This is one of the worst places in San Francisco to see live music.  Avoid it like the plague.  The acoustics suck, the staff are rude, the neighborhood sucks.  Avoid."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 18, 2010",
    "review": "OMG!! This has to be the WORST club I've ever been to !!  Expensive, rude staff, aggressive crowd, and their bathrooms are less than sanitary...I came here last night (Non-Stop Bhangra) for a friend's birthday, and I have never had such a bad clubbing experience - in any country!  Summary on the night's events...-- $20 cover-charge for everyone!  Doesn't matter if you're with a large party or rock up late - it's $20!  I don't normally believe in paying a huge cover to enter a club, because they overcharge you on drinks once you're in there, but because it was for a friend's b'day, I didn't say anything.-- $3 to check anything into the cloakroom, and $2 each time you want to retrieve anything!  My friend was buying drinks & he was $1 short, so I asked the girl who had just checked my bag in, if I could access my wallet - she was going to charge me $2, to get $1 out of my bag!!  No way!-- The guys there are aggressive!  I don't know what was in the air, but my friend (John) nearly got beaten up trying to rescue me from this guy who kept trying to dance with me, even though I'd already politely refused him earlier.  I think the guy thought John was cutting in on him, so he started getting really pissed, until I assured him that John was a friend of mine.  Even so, the guy was like, \"Let's take it outside\", and wouldn't leave us alone until another friend stepped in to pacify him.-- The best part of the night was when they (temporarily) lost my things at the cloakroom when I went back to reclaim them... Not only that, but the girl was really rude about it!  First, she pretty much ignored me for 5 min., even though I was standing right there holding my ticket, and started tidying up/rearranging stuff inside; then when I asked if I could please get my bag out, she pretended not to have realized what I was waiting for.  Next thing I know, she starts texting on her phone!  What the?!?So I asked again (more directly) - \"Err... could I please have my bag - now??\"  And she said, \"We're having a little trouble finding it - I'm just calling the guy who was minding the cloakroom earlier - maybe he moved it.\"  How stupid!  Why would he do that??So then I asked if I could please come in to take a look, cause I'd recognize it - but she wouldn't let me and continued texting.Finally she asked me what it looked like; I described it; and after taking a 3rd look, she found it - it was right there the whole time!!But she didn't say anything or apologize for wasting my time - and my friends had been there waiting with me the whole time!Anyway, the night was saved by the fact that I was in good company, but I vowed NEVER to come back here EVER again!!! - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - EDIT: The next day, I discovered huge reddish-brown stains all over my JC velour handbag!! Can't figure out what the hell it is, but it has bleached the material, thus making the bag unusable.  Thank you very much to the crappy cloakroom staff!!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 10, 2010",
    "review": "I'm sure Rickshaw Stop is actually a very nice venue, but I had such a bad experience there a few months ago that I'm now scarred for life... I went for a Morning Benders show and was disappointed to find that all of the opening bands SUCKED, and the audience was a bunch of annoying hipster fucks who kept pushing me. One girl was so drunk that she broke a glass beer bottle IN HER HAND then proceeded to bend to the floor for about 20 minutes picking up the pieces of glass one by one, while her hands were bleeding everywhere. It was disgusting. Right after the show was over I saw some guy doing a line off his friend's hand right in the middle of the floor. Classy! But the worst part was some drunk bitch threw up all over my boots, and right afterwards didn't apologize or go to the bathroom to clean herself up or anything, just kept dancing. Ridiculous."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 3, 2010",
    "review": "By far...probably my favorite place in the city to party and have a good time. Why?! They used to have BLOW UP here BUT it has sadly been discontinued! BOO! Total party fowl! Definitely a different scene then downtown SJ. Blow up used to play electro, house, dance and just all in all shake your ass jams. They also had eclectic DJ's come in. I loved it and wish they didn't have to shut it down! This place is 18 and over so the crowd is definitely different from what I'm used to. It gets stannnnnnky, sticky and very sweaty very quickly! But if your sweatin up a storm your probably having the time of your life! Everyone I've taken to Blow up absolutely LOVED it! I wish there was something similar in SJ...but because its not in the city will it still be an adventure?! Most the time I came here I never had to pay a cover :) but once in awhile i did which was $10 for 21 and over and I forgot how much it was for 18 and over. It was about $5-$10 more if I recall correctly.5 stars for the entire experience and BLOW UP in general4 stars for the venue. Its a small place but who doesn't love red velvet curtains!? Hahahaha.  The upstair's lounge area was cool too. Definitely where I was when I didn't want to get hit on or sweated on!!!! And the smoke area is located upstairs but beware there are no windows! So if you have virgin lungs like I do, I don't suggest going in there! But for you smokers.......its perfect for you!Took one star off due to some incidents that I've encountered with SOME of the KIDS who are under 21 who are absolutely rude, immature and disgusting. Everyone is out to have a good time but fuck did you really have to forget your manners AND how to take a piss and shit like a normal person!! We are not camping! Gross.One more thing, OMG the coat check was expensive! So if you decide to bring a coat and all that good stuff expect to pay a hefty fee for it."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 2, 2010",
    "review": "There for a Zion-I show with quality opening act League 510. Parking was easy, door was easy, bar was easy with a full drink red bull and vodka not skimpy and reasonable price with very nice bartender and FREE WATER AVAILABLE instead of the $4 bottled water at many other clubs!  Nice open space and positive crowd like at any Zion-I show great uplifting hip-hop and drum-n-bass sound really should check them out.  Overall a very good night would go there to see a show again."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 31, 2010",
    "review": "I went to the Rickshaw Stop for the first time to watch Zee Avi on February the 25th. [rant]Event Organizers know people are coming to see someone who's musical genre we probably prefer, so why do they always pick openers that play a completely different type of sound? For my sanity and physical health (the ears were about to start bleeding) I had to step outside plenty of times between openers and even DURING a few. [/rant]It's smaller than other places, but for the size of the crowd that night: ideal. The rickshaws were cute, the ambiance much like the old-school dive bars I've seen in Bali, and the bartenders friendly. I had a few cocktails - two people made them delicious (strong yet sweet), another guy used the cheap stuff that tasted like mouthwash without the minty freshness.If you get there early, you could save yourself a seat in the loungey zone upstairs and hang out while all the openers do their thing. We got there at 7:55 and 4 bands + a little over 3 hours later, we heard Zee Avi. The highlight of that night was Zee Avi's performance, then running into her in the restroom and chatting with her for a bit."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 30, 2010",
    "review": "This place was great when they had club BLOW UP there. Minus the no AC thing. Gets REALLY HOT when people are dancing. But now that blow up is gone, not sure if there is anymore dancing there?The end."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 26, 2010",
    "review": "I've been going here for years for all sorts of event. From rock and roll spelling bee to LOVELIKEFIRE to Ambulette....It's a very interesting setup too. Just explore a little. They have some decent drinks on tap and I think we even had sangria last time! there is a second floor to watch events/music from, so come early and get a good seat. Also, if you hate society, and pay to see an indie band, but then hate being trendy so you don't' want to WATCH the indie band you just paid for, then there is foosball upstairs. You can play it while wearing an ironic shirt. You know who you are."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 26, 2010",
    "review": "Went to see Garotas Suecas at the Rickshaw last night. I've been waiting for this band since last year after a cancelled show due to visas being denied. Finally last night, I got to see 'em funky fresh in the flesh! To be brutally honest though, I didn't really care too much for the opening acts. The first guy sat there playing his acoustic guitar damn near had me ready to swallow razor blades. The next band, Lumerians, were pretty dope but I wasn't in the mood to hear anybody but Garotas Suecas, since that's who I came to see. They brought the fuzzy spaced out funk straight from Sao Paulo son! I met the guitarist who was real cool and he gave me the set-list (I'm such a nerd). Rickshaw's a dope venue coz it's got a nice sized main floor and the extra-dope upstairs with a balcony that has a perfect view of the stage, if you don't feel like punching out the next idiot who steps in front of you after you've been posted up front waiting for the band you been wanting to see. Real talk! Why does that shit always happen though.Big up to Chris the security guy for being a real genuine dude! I got nothin' but respect for security guys who hold it down without being douchey, nah mean? Chris is cool, and so is the O.G. cat checkin' i.d.'s (sorry, I didn't get his name but if you go here, you know who I'm talkin' bout). Keep doing what y'all Rickshaw Stop!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 23, 2010",
    "review": "Came here last week for the Non Stop Bhangra night. 20 dollar cover charge is a bit steep. The Bhangra instructor was quite effective but the lesson was really brief. It was only about 30 minutes and only the very basic moves were taught. At the end of the night I didn't feel like I have learned much about the dance at all. The music was fun. I have not been exposed to Indian Hip Hop much so I didn't know what to expect. The music was surprisingly easy to dance to. The dance floor was really stuffy especially when after it got really crowded later the night. The water dispenser was a life saver."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 16, 2010",
    "review": "Had the best New Years here!Saw Glassy Candy & Desire perform. Was covering press for the show. Was a little surprised it was sold out. It was AMAZING! Great vibe, fun people."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 13, 2010",
    "review": "I love the set up.  The crowd is hit-or-miss and when it's a miss, it really blows.  Sometimes I feel like I'm swimming in a sea of juveniles and it's kind of awkward.  They play great music and bring through some decent performers.  I haven't had the best experience with the bartenders here and that gets them 2 stars.  I've seen bartenders act very disrespectful towards customers here by yelling and giving serious attitude.  I've never witnessed bartenders act so rudely at any other venue or bar, and I'm a seasoned bar hopper so I know these things!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 29, 2010",
    "review": "I loveee to dance and theres always good music! The crowd isnt always the best! And I have been a witness to the ROUGH security carrying people out. SCARY! Although the crowd isnt always the best I feel like you should go with the mind set of having fun even if im sober and being annoyed by drunkies I just go with the flow! I'm there to have fun not waste my time getting upset over the stupid idiot trying to dry hump me for the 5th time! :D If you like good remixes and can keep up I recomend you come out!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 24, 2010",
    "review": "Super fun place to see a show! Like the fact that they have a coat check- always a plus. Affordable drinks, fun crowd! Definitely want to check out the other events here! Best part, affordable ticket prices for broke ppl like me!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 11, 2010",
    "review": "I had the worst New Years Eve of my life because of this venue. My completely sober 125 pound boyfriend was standing to the side waiting for Glass Candy to go on while me friend and I were chatting with each other. We each payed about 45 bucks each, a heafty amount for a venue like the Rickshaw Stop, just to see the band play, then leave and go to friend's parties.Some guy rudely bumps my boyfriend to move, despite the amount of space around him that the guy could walk through easily. Then the guy tells him to walk outside with him because he was a sercurity guy. My boyfriend refused at first because they guy was going to kick him out then agreed to sort out what was going on. They go outside and the guy walks away. My boyfriend walks back in confused then the guy picks him up and forcibly carries him outside (RE-bruising an old rib injury my boyfriend had last year). This all happens AT MIDNIGHT.I'm demanding to see the manager and demanding for my money back. What could a 125 pound, well behaved man do to get him kicked out? Standing still isn't grounds to kick someone out. He wasn't drunk (like everyone else), he wasn't high (everyone else was) and he definitely wasn't harrassing people. All he did was refuse to move when someone was rudely pushing him instead of simply tapping him like everyone else does at a show.  The \"manager\" caves after listening to me complain about how his worker is bullying my boyfriend who is clearly sober, no threat and the last person to pick a fight with. He even agreed that my boyfriend didn't look like a threat. The worker even LIED and said that he did tap him on the shoulder to make it sound like his actions were justifiable. We think he was pissed about something unrelated and just wanted to pick on someone smaller than him.Me and my boyfriend have been coming to this venue since we were teens (between 10-14 years). Between us, we have gone to hundreds of shows over the years without any drama and we have NEVER been kicked out of any venue.We are tempted to go back to the venue and tell them that they re-injured my boyfriend's rib. We are also seriously considering talking to the owners about this (we know people who know them). I feel like we spent 90 bucks between us just to have a shitty time at their venue.We used to love this place. It used to be awesome where you could watch indie bands play. This was pre-Blow Up club nights when it really was about listening to good music and not about getting wasted, watching girls do tons of coke in the bathroom and where the people who worked there didn't pick on the wrong people."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 6, 2010",
    "review": "Solid 3 stars, through and through. For every great show- there's some damn 19 year old begging you to buy them a drink. For all the fun parties- someone pukes on your shoes. For every game of fooseball, there's some weird aggro displaced marina kid who wants to fight a girl. (That might be an experience specific to me. Not sure...) For every great bartender- there's... well, never mind. The bartenders are just great.This place is the definition of give and take. The perfect place for a 3 star evening."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 2, 2010",
    "review": "Saw Rupa and the April Fishes, with conspiracy of venus/beards.  Acoustics were absolutely terrible.  No bass, no ability to turn up voice volume, etc.  All around me were terribly disappointed with the Rupa show because of that.  Rupa herself was disappointed too, asking frequently for volume changes, but to no avail."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 19, 2009",
    "review": "WTF happened to Blow Up?Ok, so I'm an avid YELP user but I've never actually written a review. This is my first, I made an account JUST to review BLOW UP @ The Rickshaw Stop.I went this Friday with a few friends. Had a TERRIBLE time. We're all in our early twenties but I felt like I was at a high school dance. HALF of the people there were children. Wasted, drugged, annoying, rude, obnoxious high schoolers. How do these kids get in?!It was Blow Up's \"100th Anniversary\" or something. It started off with some HORRIBLE 'performance' by two rapping lesbians. They were terrible. Despite the boos, they finished their act.I can't count the number of times I was pushed, shoved, and ran into without acknowledgment. At one point my friend and I were dance-attacked by some savage teenage girl on E. I had to push this bitch off of me numerous times!! Gays, forget it. I've been here about a dozen times and have never met any nice gays worth knowing. Oh, and I can never tell who's straight and who's hipster. HIPSTERS. Oh god! Don't get me started. So many weird, wanna-be indie hipster kids. So many v-necks, lense-less thick framed glasses, and skinny jeans, I wanted to kill myself.Also, if you DO happen to be underage and drinking, watch out. The bouncers here are ROUGH. I witnessed one of the male bouncers SCREAMING in this girls face after catching her drinking without a wrist band. He was yelling at the top of his lungs and screaming profanities for her to get out. And then a long brown-hair female worker there (bartender? female bouncer?) GRABS THIS GIRL BY THE THROAT and pushes her to get out. I couldn't believe what I was witnessing! Hardcore stuff.So yeah, in a nut shell. Don't waste your time on Blow Up. The ONLY saving grace of this event is the music... Not going to lie, its the only reason I lasted longer than an hour... Love the tunes! Oh, and if you go with some easy-going friends who love to dance.. you might be ok."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 17, 2009",
    "review": "not my type of place but i had an ok experience at the Wallpaper record release show."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 14, 2009",
    "review": "I've been to Rickshaw Stop quite a few times. You really have to come into this place with the right mentality. You have to know that a.) You will sweat like no other. I'm talking, you better be wearing your good deoderant/antiperspirant. None of that crystal stuff. b.) You have to have your dancing shoes on. Read: flats, sneakers...NO heels. c.) You have to expect your clothes to smell like cigarettes. Although, there is a smoking area upstairs, the smoke makes its way downstairs. So why was I surprised that I left my rainjacket underneath the lit christmas tree downstairs to find that it completely stunk of cigarette smoke? d.) You have to expect to be somewhat sore the next day...that and maybe a combination of sore and hungover. PLUSES:-I have never been disappointed. I have been to Blow Up, Cockblock and Rebel Girl. All great nights. Great music. Interesting people.-$5 tequila sunrise. Bar upstairs and downstairs. Not sure what the variety is like upstairs. -Upstairs, there's plenty of space to lounge around or just stand next to the railing. Please don't jump off.-Great photo ops. -When you go to 18+ events, you can find yourself as one of very few people getting drinks. Not much of a wait. Awesome.-Ins and outs allow for some breathing roomMINUS:-Please do something about the floor in front of the bar. That area is slippery as all hell. There really should be someone mopping/drying that area down. -18+ events, watch out for hot messes EVERYWHERE. You can tolerate this more when you have had 2+ drinks in you. You'll (almost) forget that they have pacifiers and glow sticks...again, almost.All in all, I never hesitate to come here. :)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 22, 2009",
    "review": "Came here on Friday for Blow Up and it was completely dead the entire time. Bouncers here are assholes. Some bitch working coat check pushed me out of no where and told me to leave. Really? Was that necessary? Crowd was awesome as always. I swear, ignore the other reviews, people are crazy nice here. The bartender was awesome though. Don't know his name but he was super nice and made sure we got home okay and everything. Thanks!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Nov 18, 2009",
    "review": "You'll either love this place or hate it, but I'll be fair and admit that it's a lot fun mainly because I come here for the music they play at Blow Up. True, lots of 18+ kids who party here probably attend the local art school wearing their most expensive & trendiest outfit that mom and pop financed but if you ease up a bit most of them are just looking to get to know others with the same interest. It's what some would call a 'hipster' scene, but who cares? That doesn't stop most people from partying in SJ's Motif or Suite 181 when I call it the 'ghetto' scene.Expect the young, fabulous, trendy, tattooed & pierced type here! If you don't like this type, then obviously don't come here to ruin everyone else's good time with your negativity and sniveling. What I love about partying here for Blow UP is they constantly have different artists & DJ's coming here to bring you some fresh indie & electronica beats to dance to  a la Steve Aoki, Dan Oh, Skeet Skeet, Designer Drugs, Micky Avalon, etc. Richie Panic & Jeffrey Paradise are the usual DJ suspects here.Once when I came here with friends during the summer it was so hot we literally left the place drenched in sweat. I know it wasn't the weather that evening, but rather it was caused by everyone's dancing and enjoying themselves.Definitely worth it imo. Don't forget to say \"Hi!\" to Ava Berlin, she is such a sweetie!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 18, 2009",
    "review": "I came for the fifth year anniversary of nonstop bhangra. We pre ordered our tickets online and saved about $5 a person and paid $15 plus a minimal service fee. It wasn't that crowded at first but around 945 the crowd started arriving for the class. I recommend standing in front so you can watch all of the moves.  It's actually pretty hard and some people need to learn to wear more deodorant. As you know, bhangra requires lots of arms up in the air and I smelled lots of BO. EwieAll in all it was fun. It gets pretty hot inside  so stay near the fans. Drinks are relatively inexpensive. They had a pretty good sangria for $5."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 11, 2009",
    "review": "LOVE THE RICKSHAW!!! My favorite night is the rebel girl, the music is always amazing! I have been going here since i moved to SF 2 years ago and it's still one of my favorite places to dance!! It can be so hard to find a place that plays good indie music that i never hear any where else! (CSS, le tigre, crystal castles, yeah yeah yeahs, basement jaxx, etc) Breath of fresh air!!The Big Ole is also a rickshaw staple, PINT size vodka redbull. I don't have to tell you that more than one of those can be dangerous!!They also have a projector screen that they play videos on. It sits up on the stage, which you can dance on right by the DJ.The upstairs is cool as well. They have couches and a balcony area that looks over the dance floor that's nice to sit at when you need a dance break. Free foosball table, coat check and another bar as well. The smoke room is in the back and so if its damn cold out or crowded by the door, you can just smoke upstairs. There is a cover, but when i plan to go to the rickshaw i always spend the entire night here anyway."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 11, 2009",
    "review": "This is my new favorite club. I love the vibe. People are nice and chill and the way they have it set up is pretty cool. After a while it gets pretty damn hot and stuffy but you're having so much fun you don't even care. The dj's are usually pretty good. I mostly go for the live performances which are always pretty interesting. Can't wait to go back!!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 9, 2009",
    "review": "This place gets you hot & bothered in the BEST way possible! The girls here are young & wreckless (probably intoxicated too), the guys are assholes (or fresh princes like yours truly B) ). The dance floor mayhem is at maximum most of the time. Glasses fog up here for a reason! This is the place to be on Blow Up nights!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Oct 7, 2009",
    "review": "After turning 18, the club scene in SanFrancisco really isn't all the great if your not 21. You could go to City Nights and feel like your back at a high school dance but if your at all into electronic music and just enjoy being around cool people with good vibes I would definitley recommend checking Blow Up out at the Rickshaw Stop. It was actually the first club I ever went to and I was not disappointed, the music is great with mixes bringing back the Jackson fives to Queen and Benny benassi. Not only that but the cover charge is only $15 for 18+ and $10 for 21+! The only downside is that after 11pm the line will go around the block so if your not trying to wait in the cold I would recommend coming a bit early and try not to wear too much makeup because you will sweat it off!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 29, 2009",
    "review": "I've been here twice.  It has good sound for live shows, an intimate setting, and a cool little upstairs with various areas for seating.  I'll probably like this place even more when my cousin turns 18, so I can drink here and she can escort my drunk ass home.  A rum and coke costs $5.  The cover charge is reasonable for the quality of acts they bring to the stage.It got a little too hot at the last show I went to, but it was sold out, and any dancey crowded place is going to get sweaty.  Oh, and multiple drinks were spilled on me...  After leaving here my shoes were covered in filth.All things considered, I'd go back!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 26, 2009",
    "review": "I went to Blow Up with some friends to celebrate my 21st birthday and had a blast! Loved the crowd, and loved the venue--they have a lounge and bar upstairs that was surprisingly empty. We only used the bar upstairs (there's one downstairs too) but were thoroughly impressed by the girls bartending. They weren't too chatty, but the drinks were well-made and the girls were generous. The only issue I have with this place is that the music felt very repetitive: a friend described himself as \"feeling as though [he] were listening to 20 minutes of one track, then 3 minutes of another track, and then 20 more minutes of the first track.\" The Tenderlions were playing, and it was a joy to watch them, but listening got old quickly. I'll probably come back again when someone else is playing and see what I think then."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 21, 2009",
    "review": "first off somehow i end up here way to oftenhowever there is always a cool crowdhot girlshowever if you do not like to be hot and sweaty then do not, i repeat do not come to this place its hot as hell by 1130i however like to get hot sweaty and dance my ass off to good music i do like to arrive here after i have had large amounts of drinks  so i do not care anymore that i dance like an idiot"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 20, 2009",
    "review": "Definitely a place you go after pre-gaming it. Fun place to bring under 21 friends on fridays(blow up.) Good music, kinda young crowd. Don't ever get your bags/coats checked... they lost mine. But the manager let me in free the next two times and along with sixty dollars. : )"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 11, 2009",
    "review": "I've been coming to Blow up about twice a month for the last year or so. Knowing that I can come here on Fridays to blow off some steam and burn about a billion calories dancing and sweating for a few hours is the only thing that gets me through the week some times. It's $15 for 18+ and $10 for 21+, and well worth it at that.Jeffrey Paradise and Richie Panic are the resident DJ's and are a couple of the cities finest. Let me make one thing clear: Yes, this is an 18+ club, yes this means there are a fair amount of 18-20 year olds there, NO this does not ruin the club experience. This is a hip club. Meaning it's mainly a bunch of hip-kids decked out in American Apparel, Urban Outfitters, and/or various thrift/vintage shop clothing. It wouldn't matter if these kids were 16 or 30, they all act the same.If you're looking for a lounge to sip cocktails and relax, THIS IS NOT THE PLACE FOR YOU. If you're looking a wall to wall dance floor to 'blow up and get down' while getting absolutely soaked in your own (and everyone else's, mind you) sweat, this is your new mecca. And don't worry, if there's not enough room for you on the dance floor, there's a stage and piano you're more than welcome to conquer."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Sep 7, 2009",
    "review": "First went here in March 2007 to see the Spinto Band during Noisepop. Enjoyed it immensely because I loved the Spinto Band at the time! Apart from that, no outstanding or horrendous things to mention that immediately come to mind.** Recently went here this past Friday, September 4th to see The Twelves @ Loaded, supported by the Tenderlions with DJs Omar, Aaron and Sleazemore also spinning. SHIT WAS CRAZY! I kid you not! Once we were in around 10pm, as soon as people started getting inside, they were pumped and ready to get down, busting out moves randomly, psyched for the night ahead. As people got comfortable inside and had some drinkies, the party was jumping way before the Tenderlions and Twelves even came on! At the end, a bunch of people, myself included ahah, got up on stage and started grooving right along with the Twelves. Saying that it was just a good night would be an understatement.**Entertainment for the night apart from the music?- A somewhat attractive, almost Casey-Affleck look-alike, drunk French hipster who was not pretentious! but rather like I said, just very drunk later on. He did not trust his friends with hats very much and knew how to bust a move...sober.- London-native wannabe playa who was the French guy's friend although he was kind of funny to talk to."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Aug 19, 2009",
    "review": "a decent venue, although if asymmetrical haircuts make you sick , this is not the place to go I highly recommend BLOW UP , Jeffrey Paradise and Richie Panic are defiantly  some of San Francisco's finest, and make it worth going if you can tolerate younger crowds (i'd rather hear them spin at a 21+ venue)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 26, 2009",
    "review": "What can I say?I love this place.The music is rockin', the people are good looking,But there are the occasional pretentious hipster assholes.But for the most part, people are nice.Other than that, the indoor smoking room is nice, just stuffy (obviously)Good electronic music!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 16, 2009",
    "review": "Been to the Rickshaw twice now, keeping this short and sweet I guess I'd say it serves it's purpose as a decent live music venue. It's got a pretty large open area with a nice sized stage which allows you to listen to music. Which is it's purpose. So yea, I guess that's a solid 3 stars right, simply functioning as intended with no real stand out qualities?The drinks were mediocre, yet another 3 star designation, again nothing to really flip out about. They have coat check which is a plus. Many events are all ages or 18+ which generally I avoid like the plague, but I'm two for two on not being completely over run by any rabid groups of annoying kids.That's all I got. Boring huh? Not my fault they didn't inspire me to write anything else... If a show is going on here that you want to see then hell yea, Rickshaw works, I just wouldn't make a spontaneous jaunt here."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 5, 2009",
    "review": "tried this place out the other night, doesn't seem big, but the staff was fairly friendly, i hear they do pack over capacity so that might suck if your not into packed venues. i do like this place and will definatly see shows here, the downsides, well. no stools at the bar, no coat check, roasting HOT inside, the smoking room smells like the fresh bouquet of homeless piss, upstairs while kinda cool, doesn't allow for full view of the stage. Pretty Good Sound though."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 4, 2009",
    "review": "This is the first time I wish Yelp had negative stars.  Seriously.I went to the Rickshaw Stop several years ago and it was fine.  But I went last night to see the Lovemakers and it was most certainly NOT fine.  I felt sick when I got there, so spent most of the opening band sitting and trying to feel better so I could stay with my friends (I was the DD).  I was cuddling with my friend on the couch and had a hand over my eyes to sort of meditate and feel better when the bouncer came up and told me i'd have to leave if i wasn't \"more energetic.\" i thought he was joking, but he came back 10 minutes later and said \"i saw you napping, i'm going to ask you to leave.  the boss said that's not ok.\"  i replied incredulously \"what?\" and he said \"did i stutter?\"  i told him i wasn't feeling well and he said \"that's too bad but i'm still going to kick you out if you don't start showing some more energy.\"WTF? since when is a club a pep rally?i suspect that they are running a shady deal where they pack their club past capacity, then pick out people to throw out for whatever reason so they can keep their money but not be *too* packed.don't worry, mr bouncer, i'll never darken your club with my floopiness again."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jul 4, 2009",
    "review": "This is the worst club/venue in San Francisco by far.  A few of the employees aren't just rude--they're horrible human beings.  I saw the Lovemakers with a couple friends.  One of my friends got sick while she was there (and all she had to drink was a ginger ale in this hot and stuffy club). She sat down on the couch by the merch table to take a short break, but apparently 'the boss' didn't like this. One of the employees came by--a stocky bald guy with terrible facial hair--and said that she wasn't being \"energetic enough.\"  My friend told him that she was getting sick and just resting for a second.  Rather than offering her some water, he said that he was going to \"kick her out if she wasn't more energetic.\"  The douchiest part: she said \"I'm sorry, what did you say?\" and he did a poor Bender impression and said \"did I stutter?\"I hope that the next time he gets sick and needs medical assistance, he only gets quotes from John Hughes' movies.Read all the other 1-star reviews, and you'll see that I'm not alone in this opinion.  I saw another bouncer throwing more people out tonight than I've seen at all the times I've been out at clubs in SF.I suspect it's a scam: the club was filled way past its legally allowed capacity (it's posted on the wall), and I think they throw people out so they can keep their money and pretend that they comply with the fire laws.Hopefully a fire marshall will show up one night, shut this place down, and put these douchebags their out of a job.  It's a shame because the bartenders seemed pretty nice."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 29, 2009",
    "review": "$10 to get in for 21+ and $15 for 18-20 yr. olds. I had a great time and the music was AWESOME, Electropop and the bar had good prices on drinks. I paid $8 for a redbull and vodka, mmmm. I'd recommend this place to non-dramatic, fun loving people :)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 15, 2009",
    "review": "If you are a business owner in san francisco and are in the nightclub business and run an 18+ venue you're in it for the love of it.  There are so few venues in this city, and anywhere for that matter, that are 18+ that have great security, good music and awesome programming.  If you don't like gay people, if hipsters threaten you because you still shop at westfield, don't come by and post your self-important yelps about how this club sucks.   There's a place for you on union street."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 6, 2009",
    "review": "Came here for the blow up, but if i could rename it--it was more like a crappy blow job. I heard about this place from a few friends who had yet to turn 21. We checked it out and it was like being at a hipster kid's house party. I swear, this is far the most i've seen in one place of cross over guy-girls (sometimes its hard to tell ;T )  in skinny nut hugging jeans, make up and faux-hawks. We go in and order drinks. I let one of the minors hold a drink while i get some thing from my purse and next thing you know some security guard flashes his pointer and is like you're not 21 and takes MY DRINk!! and kicks my friend out just like that? WTF YO!! he's 21 in like a month. WACK. So he's kickin it outside, and im like F that i paid a 20 cover. Me and my girl bop to some techno rave scene while observing these could be girls making out with hot girls..ugh weird.  I get another drank my infamous AMF, once again i let my friend hold it for a sec, and out of anowhere i another mother frodo vagina KICKS US BOTH OUT!!! it's a fricking hipster scene, it ain't even 21. I can't believe im saying this but KIDDY NIGHTS IS SOOO MUCH BETTER!! UGH in yo face, BLOW JOB!! Don't go here unless ur a emo hipster."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jun 6, 2009",
    "review": "This was one of the first places I checked out when I moved to SF. Tormenta Tropical was awesome, loved the techno-cumbia and the diverse crowd.Came here again tonight to see Tenderlions & Steve Aoki, and I remembered all the reasons I like this place so much. Cheap drinks (vodka soda in a pint glass for $5), a really cool mix of people, and just a really good vibe. It's not really indie so much as eclectic -- all crowds are represented at Rickshaw Stop. Yes, the ventilation could be better."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 26, 2009",
    "review": "I recently visited the Stop and as a venue, I loved it! The overall turnout of events could have went better (thanks Lady Sovereign, you rude cow). Doors were supposed to open at 9pm, but the line was still moving pretty slowly to get in; but major props to the ID checker at the front for trying, constantly screaming for everyone to get their IDs out and ready. Upon entering, you might have to fight through the bathroom queue to get anywhere. Ceilings are pretty low, but don't worry they shouldn't cave in--just keep walking, get your drinks and shake that thang! What I loved about the venue, was wether upstairs, downstairs, bathroom or bar, the ambiance was very home-y, almost an intimate gathering of friends (don't worry, I'm not an emo or a hipster). Drinks were awesome: great Tokyo Iced Tea. AND woot woot for the upstairs smoking room! The openers were fun--they really got the audience going. Then Ms. Diva Sovereign managed to get through four songs before walking off for a second and final time. Needless to say, everyone tried making the best of the situation, but one of the guards did not like it when a friend walked on stage and grabbed the rest of the Diva's crate of beer (Dos XX's but free is free). I understand that the Diva just wasn't feeling it, but come on. So, the jerk of a guard huffed and puffed and through us all out, even though the DJ said everyone could split her beer. Still managed to have an awesome time though. Glad/Proud we got kicked out of a place we no longer wanted to be. So, to reiterate, Yay for Rickshaw and poo on the Lady Sovereign (you should put that in your pipe and smoke it before your next show you sorry twit--oops, might still be a bit angry with her)."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 23, 2009",
    "review": "cute intimate indie music bar club scene i guess i'd say. loved the red glowiness and few strings of big bulby velvety orange lights, made me feel like a carnival lounge scene from city of lost children (that old great fairytalish french movie).  zee avi was great, but this whole early show business ends too early and walking out into the cold grey light of dusk is kinda a let down after a cool show and big drink. but i'm not whining."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 23, 2009",
    "review": "Ew, smelled like all bars with wooden floors smell like.  Like theres been so much alcohol spilled on the floor, its been absorbing it for years...It just STINKS. the place was not too big, but there was an upstairs.  People were WAY too intimate with me, like move over! and if youre in the front row, can you please sit down, or at least not be 6ft. tall? GOD."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 23, 2009",
    "review": "Saw Zee Avi here yesterday evening and had a wonderful time!Reasonable priced drinks, good atmosphere and again, Zee Avi was performing. :)"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "May 22, 2009",
    "review": "Went there with a friend for pop fest. Quite 'indie' crowd, but no one tried to start a fight, there was plenty of space, and tons of dancing.It's a small intimate venue and the bands were GREAT. suburban kids with biblical names, and three others. Stuff I never would've heard otherwise, but I absolutely LOVED.I'll definitely be back."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 27, 2009",
    "review": "Fun venue, great acoustics, friendly staff, generous pours, first rate bookings.  Recently saw Kimya Dawson's performance here.  But I guess it would be more fair to say \"Perspired through Kimya Dawson's...\"  Sheesh, it was so hot!  And zero ventilation. It admittedly was one of those record-breaking-temperature April days, but even still -- they need to install some fans at a minimum.  Better, a full A/C system.  Or at least a window at the back to generate a cross-breeze.  I'd love to attend the non-stop Bhangra nights, but the descriptions of heat and sweat are a real turn-off.  Okay, I'll admit I'm a baby... but I do have the not-unusual need for oxygen... breathing has become somewhat of a habit with me... though I'm trying to quit!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 26, 2009",
    "review": "Went here only once, to see Hollywood Holt perform, presented by 24karatmilkcrate productions... their first production.  Great show and I think  Rickshaw Stop was an excellent venue.  Got an adequate stage and a pretty good sound system. This night the ventilation worked well for a crowd of just over 150.  They can comfortably fit more.   I liked the upstairs arrangment but I think on a crowded night there would be a need for more seating.  The bar was reasonable and water was available too. you know how hot it can get with a thriving crowd.  Anyway, if 24karatemilkcrate puts on another show here, I'd be sure to go."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 15, 2009",
    "review": "whats up you crazy scenesters you. ya'll make me laaauuggh. ya'll so cool. you know it. hahaha!anyway. this place is fun. nice size, but that makes it kinda crowded. but what sweet clubbish locale isnt crowded eh? cool music. indie rock. electro. house. breakbeats, hrm  or maybe i just WANT them to play breakbeats? whatev.top floor has a chill seating area and a smokers room which is obviously filled with METRIC TONS of smoke. cough much? now you do.i have only been a few times and I gotta say I have had a good time. there is a small stage at the front of the place and it is damn fun to Rage and \"get down\" on said stage. recently i have not enjoyed the folks that attend. i have had to throw some elbows at dumb asses texting and drunkenly falling on me and the GF. cool DJs. sweet music.and le caslte vania has performed there.THATS A GOOD THING HE IS BADASS.rage onoh you scenesters, just stop, really, my side is spltting.haaahhhoh uh its like 15 bucks to get in? 10-2 AM ish? its fun.lots of fun."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Apr 9, 2009",
    "review": "I had a blast here last night, however this was not due to the bar. Had it not been for the performers and company I had with me, this joint would leave me in a haze.. literallyHAZE.. due in part to the \"smoking room\" upstairs.. really? Having a smoking section in a bar is like having a peeing section in a pool...  The rest of the haze was due to some mysterious fog machine they have. At one point my friend says to me, is my vision going bad or is it getting really hazy in here.. No, you are not going blind.. The joint could use ventilation.. The area in front of the stage is very open, and high ceilings, and despite this you still feel like ur in a sweaty basement. Good show... not so good venue... Bonus points for the crazy rickshaw bike upstairs."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 30, 2009",
    "review": "I have never been treated so unjustifiably poorly by the staff of any establishment in my life. The behavior of the employees here Saturday night was honestly shocking and really took me aback.Let me preface this by saying I was not that drunk. I know that sounds like the \"drunk girl's motto\" but I was very clear headed when dealing with the staff. Now, I had been dancing in the middle of the club with a friend, who, to put it simply, dropped me and I fell hard in front of everyone. I mean hard. Super embarrassing and probably made me look a lot drunker than I actually was. After my moment in the spotlight, I scurried away to the bar to avoid the stares, and that's when the fun started. I went to get my 2nd drink of the night (the first of which I shared with my friend), and essentially got cut off. He probably saw my fall. He didn't even say this, or anything for that matter, and when I asked for a drink he basically scoffed and said \"don't think that's happening,\" turned his back, and ignored me. I didn't understand what was going on.But whatever, it wasn't that big of deal and I didn't make a fuss. When I came back later in the night to close my tab (for the 1 drink I had bought), I asked him if he really thought I had been that drunk, to which he responded, \"yeah, drunk or on roofies, something is going on.\" Who says that? It was the most ridiculous thing I've ever heard, and he was clearly just trying to be insulting. When I asked him what his name was, I again got the silent treatment, and he went in the back room. The other bartender was also ignoring me and nobody would give any names. Maybe they knew I'd write a bad review? If you're going to treat somebody like shit, man up and give them your name.The place was closing down, and having been there with the band, I was waiting on the stairs for them to get the car and load up. You know the face that women make, and that tone of voice, where someone is pretending to say something nicely but really they are trying to be really mean? Kind of a like a little tilt of the head/smirk/raised eyebrows look? This little asian chick employee comes over to me (I'm donig absolutely nothing) and tells me I need to leave in the rudest way, with that face. I told her I was with the band and that I was just waiting for them, and she essentially said, again in a really venomous way, that she didn't care who I was with, I needed to get out. To which I replied, \"fine but you don't have to be such a bitch about it.\" Yes yes, I know I should've just held my tongue, and I am generally quite tame, but it was the culmination of the entire staff marking me and treating me like !@#$ for the duration of the night that did it. Of course she, and the 3 other employees at the bar immediately start screaming at me, 'YOU need to get the !@#$ out of this club NOW!\" Which, at that point, was warranted.And here is how you know it wasn't just me. The guys were loading up the van in front of the club, at 2:25 or so, and one of the angry bartenders (who was leaving to go home, not knowing that I was in the car), yells at one of the band members for parking in front of the club and having all of their shit around. He tells him to have some respect. HE'S PACKING UP! He just finished a show! It was crazy.It's unfortunate that the staff (at least, I guess, on a saturday) is so horrendously rude because otherwise the space as a music venue is not bad at all."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 24, 2009",
    "review": "The Rickshaw is a pretty cool place for live music and dancing. Upstairs is a mezzanine with chairs, benches, and couches, in case you don't want to be down on the dance floor and just want to chill back.Downstairs is a low level stage so you're not being towered over by the band(s) and have easy access to jump on stage and dance, if thats what you're into. The atmosphere is super fun and upbeat, and usually have some really good bands performing. They have a small bar, but serves just about everything. They have killer deals on drinks: $5 for a pint of redbull and vodka? YES PLEASE!Sometimes I think the cover charge is outlandish for certain nights and no name bands, but if you're willing to pay the price, you can still have a good time."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 6, 2009",
    "review": "I went here last night to see the Limousines---awesome band with that song on the radio called \"We are very busy people.\" Also saw the New Trust, and Har Mar---very very funny and talented groups.Ambience is super fun. Good beer on tap.They have Absolut Ruby Red.Crowd was pretty good.Parking nearby.Upstairs seating is great if the dancefloor is packed.Has a similar vibe to the Casbah in San Diego---which is a place I miss, so ya, I dig the Rickshaw---OH! and duh, they have cute rickshaws and bicycley paraphernalia you can sit on/in!!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Mar 6, 2009",
    "review": "Pretentious much?Get over yourselves boys and girls. Blow-Up SUCKS. Asshole bouncers, asshole staff, and photographers that seem to be everywhere. Not to mention it is expensive as FUCK.The last time I went here must have been about a year ago. My friend and I (we were both under 21 at the time) got kicked out because we had used the restroom and washed our hands. The place didn't have any paper towels(of course) so we were drying our hands off on our pants. A bouncer walked by and kicked us out because he said we were trying to get the \"X\" marks off of our hands so that we could drink, although they were still very visible because that is not at all what we were doing. We tried to explain ourselves but he was on a power trip and began yelling at us in front of the line. Keep in mind that we were not even drunk. My friend had checked his bag and coat in at coat check so he asked if he could go in to get his shit so we could leave. NO. We proceeded to ask a staff member to go and get his things out of coat check since we were not allowed back in. NO. We had to call someone we knew from inside to come out, get the ticket, and retrieve the belongings. This place is not worth your time and money."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 24, 2009",
    "review": "How could you turn down a crowd that gets their sweat on so profusely that as they turn, after the stage is completely taken over, the sweat flies off of them? I know I can't. It's right up my alley.Some of the crew and I rolled out deep for Non Stop Bhangra night at Rickshaw stop. Walking in, we were a few early, which was just fine. We got our drinks, posted up in the corner and put on our dancing shoes, ready to be taught some of the elegantly simple and artfully infused dance moves that are, well, Bhangra. I had never heard of it before, although I had seen that style many times in Paris. Nights flew by listening to raj music while in underground clubs by the Louvre as the locals went mad. The people that frequent the small club with an upstairs are die hards. It was incredible to see the different flavors of people jam packed in there literally letting it all go and getting their groove on. I sweated through my clothing, and for once, wished I had worn kicks instead of heels so that I could have really gotten down and dirty in it. No drama, no problems, just a ton of people all there with a common thread, they love to dance. The beat inspires them. What could be more perfect than that? I didn't get skeevy men dripping on my ass for once, no one attempting to take the two of us home that night. It was refreshing. Just make sure you're not claustrophobic, as it's as tightly packed in there late at night as sardines in a can. Oh, and wear something you don't have to dryclean, cause as a forewarning, you're gonna get drenched. If it's not from your own sweat, from those around you."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 24, 2009",
    "review": "i'll be back."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 24, 2009",
    "review": "Rickshaw Stop is a great venue. The event I am reviewing is Non-Stop Bhangra. What a great idea--good music, happy people, but.....(record scratches, music stops) I came here to dance. Isn't that what Non-Stop Bhangra is all about? The problem is that they pack you in there so tightly that you can't move or breathe for that matter, as the place can't hold enough oxygen for so many people. It is a popular event so have it twice a month so people can actually do what they came to do--DANCE!! Don't be a greedy club owner!! Luckily the Fire Marshall didn't get wind of this mess. I won't be going back. Too bad. But I love the Bhangra so I'll be planning to host an event like this somewhere else, where the profits don't trump fun."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 23, 2009",
    "review": "I had gotten mixed reviews of this place before I went here so I was nt sure what to expect of the Bhangra night I was here for. Minus .5 stars for the $20 cover charge - Thats effin pricey!Plus 1 star for the music which was pretty awesome. Rocked my socks, YEEEEEEAAAH!!!Minus 1.5 for the cramped and stuffy experience. The place is Oh-mi-god super stuffed. Its tough to groove without getting stepped on. I thought I was excellent at manouvering and not getting stepped over but in the end I nearly fell on my face. And I was'nt even buzzing yet. LOLMinus 1 for the gin and tonic the bartender made. My honey fell sick after downing that despicable concoction.Its gonna take a lot of convincing for me to go back."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 21, 2009",
    "review": "I like Rickshaw Stop on nights when it's not dancetronic 90s club kid wanna be paradise.Granted, those nights are far and few in between.  Though I have been to this club when it's been less than packed and had a really good time.  I've also seen a band play here and liked the venue for that.I think that I am just too old to really get into the whole smooshed together with sweaty underaged boys wearing no shirts and Oakland A's hats groovin' out with glowsticks and spilling Red Bull and vodka on my brand new shoes.Dude, what's happened to me?  Pretty soon I'm going to be yelling at kids to get off my fucking lawn.  Ugh, color me old."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 14, 2009",
    "review": "the music, staff, and dancefloor is so awesome and the drinks are not expensive one bit but i just couldn't stand some folks that were there. weeeelll, i can't entirely blame the club for the patrons that attend. i don't know if it's like this every night - i really hope not - but there were kids rolling hella hard and hella drunk and they had those x's on their hands. but that's not the problem because i was under 21 once. but some of these kids were down right rude. and honestly it's a bit of a scene. but i guess these days, everything is a scene. but the fact that gil mantera's party dream was there and fucking rocked it, this place gets 3 stars."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 13, 2009",
    "review": "I've only been here for cockblock.... which effin' rules!The dancefloor can get really hot and crowded, but the upstairs allows for a quick getaway if you're feelin' overheated."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Feb 5, 2009",
    "review": "This is a dope little place to watch some live music.  Sound board guy is on his game.  I was there on a thurs, so not that packed. We were able to get drunk with no waiting, listen to some good bands and watch drunk girls try to get free drinks.  Recommend it."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 29, 2009",
    "review": "This place can be a hit or miss depending on the music that night, but if you pay attention to the calendar and plan ahead, you'll have a great time.  Great place to go to grab a few drinks and enjoy some good music.  Beware of Friday nights if you don't like partying with a bunch of kids since it's 18+ those nights.  I randomly went there on a Friday night not knowing what to expect, and I felt like I was at a high school party.  The staff is great and friendly, especially the bartenders ;)  Just don't act like a dumb ass and you'll earn their respect, same as any bar you go.  There's also a foosball table upstairs!  Upstairs is a great place to lounge and enjoy the music.  you can sit on one of the many couches they have up there or chill by the balcony and watch the band play.  There's even an actual rickshaw upstairs that you can sit on (as long as you're not a fatty fat fatass)."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 21, 2009",
    "review": "Note: This review is more a review of a particular club night, maybe not on the establishment itself. In my experience the people that work at the Rickshaw Stop are great people, it just seems like its something about the Blow Up promoters that get under my skin and here is why: It was pretty dead earlier in the night but soon the trying-to-hard-hipsters started to make their way in. The DJ was moderately good the entire night but much to arrogant. Its hilarious watching these young girls hang on to these guys like rockstars. They didn't like the fact that I went up to them and asked them to play a song. Okay DJ's maybe you don't have to play it, maybe you don't want to play it, but don't be an ass a simple \"I'll try to get it in there\" would be awesome. Don't be a pretentious fuck just because I'm not a coked out whore asking to blow you.The more packed it got the more the temperature started to rise. It becomes unbearable by midnight. I was with a group of friends but I instantly noticed how people here are not as friendly as I have encountered at other places.It also took way to long to get a drink at the bar which surprised me because on other nights I would be served rather quickly.So, on Blow Up nights, the standard for this place is lowered. It becomes much to chaotic and the people who run it don't seem to care about the patrons. However, the crowd doesn't seem to care how they are treated for the most part either. The young kids, some probably with fake id's, are much more concerned with getting their picture taken making out with a stranger or with their left nipple hanging out.Maybe I am just much to old for this?I def want to attend a Cockblock or other gay/lez night and hopefully make up for the experience on this night."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 13, 2009",
    "review": "I didn't really enjoys it.  Alot of people, maybe on differeant day.  My friend used to work, so I could get in free.  It is my mothers liquor store."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 12, 2009",
    "review": "Lets set the scene for this event.... Its New years eve and my FAVORITE band... Shiny Toy Guns.. is performing at Rickshaw Stop along with DJ Low B.We got to rickshaw around 11. We had pre paid for tickets and stood in line for just a few minutes. We walked in and could feel the excitement. The actual venue is not Schick or sophisticated. Its simplistic, retro, and very functional. You walk and see  a bar on your right. On the left stair stairs lead up to another bar and more seating. We quickly and easily got our drinks from the 1st floor bar. From that point we walked straight into a huge open room. One end was the stage. We made our way to the side of the room and were able to score a low table to put our drinks and jackets on (and later stand and dance on).The band rocked. Everyone was in a great mood. No one was worried about appearances or glam. Everyone here was mellow. I SSSOOO appreciated being able to go out in just a t shirt (a fancy one) jeans and chucks. We danced and jumped all around all night.Bottom line. Fair drink prices. Friendly Staff. No dress code. PRICELESS!!!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 12, 2009",
    "review": "*This review is for Friday Nights and Blow Up*18nUP? It's been years, and I mean YEARS since I've been to such an event but I sucked it up for a friend's birthday. I was plesantly surprized because I ended up having a good time. The whole place reminded me of High School! Not in a bad way, and no, not because I was a couple of years older than the majority of the folks there but because of the setup and decor. The venue set-up reminded me of a HS auditorium because it's a widely spacious dance floor that faces a stage. There's also an upstairs bar + balcony with vintage decorations like old school bikes and 80s looking tables. The crowd was dressed uber trendy. For some reason I noticed a lot of boys in fashionable hats. A good handful of girlies were wearing party or cocktail dresses. Their best threads for the friday night school dance. I keed, they all looked cute, I swear!Electric music. Heard some Kanye, 80s, brit pop, and other uppity beats while I was there. I love dancing to it! Anything goes, and ANYONE can dance to it. Folks were wyling out and letting themselves go to the beats. Good for them for enjoying themselves! Drinks weren't bad: $3 for beer and $6 for wine. Contrary to other reviews, the bartenders aren't jerks either. Don't think I'd come back by choice but Rickshaw is okay in my book."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 11, 2009",
    "review": "I've only gone here for Blow Up which is held like 3 Fridays of the month.Check it out here: http://blowupsf.com/I am just going to say that this is one of my favorite places to get drunk and go nuts.If you don't like Top 40 or any other crap they play on the radio come here and listen to some good funk, electropop, foreign, and electronica.I promise you'll have fun here as long as you're cool with being around lots of hipster people and not that many Asian people.The drinks are priced well.The number one thing is the music. It's so worth it just to listen to the dope DJ's spin some sick songs you've never heard.The only reason I don't give this place 5-stars is because it's an 18+ place. If it were 21+ then it would be perfect."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 11, 2009",
    "review": "Eh.  Get on the guest list somehow, because it's not worth the line otherwise.  Sweaty, good music, lots of underage kids, asshole bartenders, large space.  Good to go to like once every 2 months."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 11, 2009",
    "review": "Went for Halloween 08, didn't even get in because I didn't buy a pre-ticket- totally my fault. 2nd time I went with a small group of three and only had to wait 30ish mins to get in (this was considered awesome since the last time I couldn't even hear any music I was so stuck in line)Not a fabulous venue but for $15 I'll take it. No pictures, not even the ones they take of themselves will do Rickshaw justice. The lighting and visual was fantastic but I don't recommend getting too shit faced unless you wanna give the people waiting in line a good show (on stupidity). Been to a few clubs now, and have been to neko to go on stage but this time some stranger just pulled me up and I had a blast. AMAZING in comparison to Club X. Like my friend explained, trashy people go where trashy people are, regardless of the club. Blow up is lucky to have down to earth cool people. Had NO problem whatsoever about the space issue, I like that so it works for me. Guys were tasteful and I was never surprised with a random bulge humping my backside like Club X.DEFF going back. deff."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 10, 2009",
    "review": "I've gone to the Rickshaw Stop a few times now, on both \"quieter\" nights and nights like Blow Up. The place is rather drab looking when the seizure lights aren't all over the place, the bar is nice, and I quite adore the smoking room. Blow Up is always crazy packed and if you haven't seen the collections at American Apparel, then come here. $15 for 18+ and $10 for 21+. The music is pretty good, really crammed, and sweaty. I've started to really like going out dancing and this is place is reliably fun with the right group of friends."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Jan 4, 2009",
    "review": "Venue shmenue.It's really about the act.  I've been here for Nonstop Bhangra, and I've seen a couple of bands perform.  Dengue Fever?  Good stuff.  They created a festive atmosphere with balloons and streamers.Other times?  The venue just sits on its own, like an Ikea dining table in an ugly apartment."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 18, 2008",
    "review": "I've only been here for Blow Up to dance to electro/indie music so barring that detail, I'm still a fan. $15 cover charge for 18+, $10 for 21+. I gotta get my dirtying dancing on sometime, but since there ain't no Havana Nights to speak of, Rickshaw does just fine.The crowd is pretty mixed here, but I always have a good time. It's always about the crowd of people you bring with you though. Just dance like no one's watching (save the photographers and video recording). They play some pretty sick mixes here so I've been here again and again.It would be accurate to say that this is a hipster hotspot on Blow Up nights, but it's not like you're out of place because I'm mos def not a hipster. BLOW UP AND GET DOWN!"
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 3, 2008",
    "review": "Love this place!  Met the owners and found out they love to support the local artist/music scene.  They were able to squeeze our 2 hour film screening party on a Saturday- which is very hard to do.  My top reasons why you should go there:1. Bartenders are quick and slick.2. They offer my favorite pear cider there. 3. If you love live music- this is the place to go.4. The people are mixed, hip, and good-looking5. If you are short, and cannot make it to the front, there is an upstairs floor where you can lounge on sofas and watch the show.6. Always seem to have a blast when I am there!Say hi to Billy the bartender when you get drinks.  Tip him good...."
  },
  {
    "venue_name": "Rickshaw Stop",
    "date": "Dec 2, 2008",
    "review": "A fun place to hang out. The crowd changes along with what's going on and who's playing that night...it's not always teeny boppers, though that happens sometimes. Check out bands here before they make it big, as they tend to book them just before they make it big. MIA...Lesly and the Ly's...Cody Breaker. The foosball table rocks, they have one of the few indoor smoking rooms in San Francisco (I don't even smoke anymore, but think it's nice to let the poor smokers be inside, all warm and cozy  for a change) and the bartenders are always friendly."
  }
]